Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x81e (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x36c1b): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x794a5): ../Core/MikroSDK-ExampleCode/i2cIO.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x16b2f): C:/Users/pjura/Desktop/dev/stm32/3d-motion-debug/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x66e2c): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x3b318): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0xc6326): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x989af): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0xa7844): __uint16_t
    <4f>   DW_AT_decl_file   : 2
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0xc4acd): short unsigned int
 <1><5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 5	(signed)
    <60>   DW_AT_name        : (indirect string, offset: 0x116c8): long int
 <1><64>: Abbrev Number: 3 (DW_TAG_typedef)
    <65>   DW_AT_name        : (indirect string, offset: 0x82cf6): __uint32_t
    <69>   DW_AT_decl_file   : 2
    <6a>   DW_AT_decl_line   : 79
    <6b>   DW_AT_decl_column : 25
    <6c>   DW_AT_type        : <0x70>
 <1><70>: Abbrev Number: 2 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 4
    <72>   DW_AT_encoding    : 7	(unsigned)
    <73>   DW_AT_name        : (indirect string, offset: 0x3ed1b): long unsigned int
 <1><77>: Abbrev Number: 2 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 8
    <79>   DW_AT_encoding    : 5	(signed)
    <7a>   DW_AT_name        : (indirect string, offset: 0x5d971): long long int
 <1><7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 8
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0x2a770): long long unsigned int
 <1><85>: Abbrev Number: 4 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : int
 <1><8c>: Abbrev Number: 2 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x10dbb): unsigned int
 <1><93>: Abbrev Number: 2 (DW_TAG_base_type)
    <94>   DW_AT_byte_size   : 8
    <95>   DW_AT_encoding    : 4	(float)
    <96>   DW_AT_name        : (indirect string, offset: 0x12ee1): long double
 <1><9a>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <9b>   DW_AT_byte_size   : 4
 <1><9c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9d>   DW_AT_byte_size   : 4
    <9e>   DW_AT_type        : <0xa2>
 <1><a2>: Abbrev Number: 2 (DW_TAG_base_type)
    <a3>   DW_AT_byte_size   : 1
    <a4>   DW_AT_encoding    : 8	(unsigned char)
    <a5>   DW_AT_name        : (indirect string, offset: 0x41dd9): char
 <1><a9>: Abbrev Number: 7 (DW_TAG_const_type)
    <aa>   DW_AT_type        : <0xa2>
 <1><ae>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <af>   DW_AT_byte_size   : 4
    <b0>   DW_AT_type        : <0xa9>
 <1><b4>: Abbrev Number: 3 (DW_TAG_typedef)
    <b5>   DW_AT_name        : (indirect string, offset: 0x3b31a): uint8_t
    <b9>   DW_AT_decl_file   : 3
    <ba>   DW_AT_decl_line   : 24
    <bb>   DW_AT_decl_column : 19
    <bc>   DW_AT_type        : <0x30>
 <1><c0>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1>   DW_AT_name        : (indirect string, offset: 0x96ff2): uint16_t
    <c5>   DW_AT_decl_file   : 3
    <c6>   DW_AT_decl_line   : 36
    <c7>   DW_AT_decl_column : 20
    <c8>   DW_AT_type        : <0x4a>
 <1><cc>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <cd>   DW_AT_type        : <0xc0>
 <1><d1>: Abbrev Number: 3 (DW_TAG_typedef)
    <d2>   DW_AT_name        : (indirect string, offset: 0x9504f): uint32_t
    <d6>   DW_AT_decl_file   : 3
    <d7>   DW_AT_decl_line   : 48
    <d8>   DW_AT_decl_column : 20
    <d9>   DW_AT_type        : <0x64>
 <1><dd>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <de>   DW_AT_type        : <0xd1>
 <1><e2>: Abbrev Number: 2 (DW_TAG_base_type)
    <e3>   DW_AT_byte_size   : 4
    <e4>   DW_AT_encoding    : 4	(float)
    <e5>   DW_AT_name        : (indirect string, offset: 0x2ffb): float
 <1><e9>: Abbrev Number: 2 (DW_TAG_base_type)
    <ea>   DW_AT_byte_size   : 8
    <eb>   DW_AT_encoding    : 4	(float)
    <ec>   DW_AT_name        : (indirect string, offset: 0x18f15): double
 <1><f0>: Abbrev Number: 3 (DW_TAG_typedef)
    <f1>   DW_AT_name        : (indirect string, offset: 0xb19ce): UINT8
    <f5>   DW_AT_decl_file   : 4
    <f6>   DW_AT_decl_line   : 61
    <f7>   DW_AT_decl_column : 23
    <f8>   DW_AT_type        : <0x3c>
 <1><fc>: Abbrev Number: 3 (DW_TAG_typedef)
    <fd>   DW_AT_name        : (indirect string, offset: 0x89e90): BOOL
    <101>   DW_AT_decl_file   : 4
    <102>   DW_AT_decl_line   : 62
    <103>   DW_AT_decl_column : 23
    <104>   DW_AT_type        : <0x3c>
 <1><108>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <109>   DW_AT_type        : <0xfc>
 <1><10d>: Abbrev Number: 3 (DW_TAG_typedef)
    <10e>   DW_AT_name        : (indirect string, offset: 0xa25bd): UINT16
    <112>   DW_AT_decl_file   : 4
    <113>   DW_AT_decl_line   : 64
    <114>   DW_AT_decl_column : 22
    <115>   DW_AT_type        : <0x8c>
 <1><119>: Abbrev Number: 9 (DW_TAG_structure_type)
    <11a>   DW_AT_byte_size   : 16
    <11b>   DW_AT_decl_file   : 5
    <11c>   DW_AT_decl_line   : 360
    <11e>   DW_AT_decl_column : 9
    <11f>   DW_AT_sibling     : <0x15c>
 <2><123>: Abbrev Number: 10 (DW_TAG_member)
    <124>   DW_AT_name        : CCR
    <128>   DW_AT_decl_file   : 5
    <129>   DW_AT_decl_line   : 362
    <12b>   DW_AT_decl_column : 17
    <12c>   DW_AT_type        : <0xdd>
    <130>   DW_AT_data_member_location: 0
 <2><131>: Abbrev Number: 11 (DW_TAG_member)
    <132>   DW_AT_name        : (indirect string, offset: 0x8621b): CNDTR
    <136>   DW_AT_decl_file   : 5
    <137>   DW_AT_decl_line   : 363
    <139>   DW_AT_decl_column : 17
    <13a>   DW_AT_type        : <0xdd>
    <13e>   DW_AT_data_member_location: 4
 <2><13f>: Abbrev Number: 11 (DW_TAG_member)
    <140>   DW_AT_name        : (indirect string, offset: 0xbac28): CPAR
    <144>   DW_AT_decl_file   : 5
    <145>   DW_AT_decl_line   : 364
    <147>   DW_AT_decl_column : 17
    <148>   DW_AT_type        : <0xdd>
    <14c>   DW_AT_data_member_location: 8
 <2><14d>: Abbrev Number: 11 (DW_TAG_member)
    <14e>   DW_AT_name        : (indirect string, offset: 0x71af3): CMAR
    <152>   DW_AT_decl_file   : 5
    <153>   DW_AT_decl_line   : 365
    <155>   DW_AT_decl_column : 17
    <156>   DW_AT_type        : <0xdd>
    <15a>   DW_AT_data_member_location: 12
 <2><15b>: Abbrev Number: 0
 <1><15c>: Abbrev Number: 12 (DW_TAG_typedef)
    <15d>   DW_AT_name        : (indirect string, offset: 0xc14fe): DMA_Channel_TypeDef
    <161>   DW_AT_decl_file   : 5
    <162>   DW_AT_decl_line   : 366
    <164>   DW_AT_decl_column : 3
    <165>   DW_AT_type        : <0x119>
 <1><169>: Abbrev Number: 9 (DW_TAG_structure_type)
    <16a>   DW_AT_byte_size   : 8
    <16b>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 368
    <16e>   DW_AT_decl_column : 9
    <16f>   DW_AT_sibling     : <0x190>
 <2><173>: Abbrev Number: 10 (DW_TAG_member)
    <174>   DW_AT_name        : ISR
    <178>   DW_AT_decl_file   : 5
    <179>   DW_AT_decl_line   : 370
    <17b>   DW_AT_decl_column : 17
    <17c>   DW_AT_type        : <0xdd>
    <180>   DW_AT_data_member_location: 0
 <2><181>: Abbrev Number: 11 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x8fcc8): IFCR
    <186>   DW_AT_decl_file   : 5
    <187>   DW_AT_decl_line   : 371
    <189>   DW_AT_decl_column : 17
    <18a>   DW_AT_type        : <0xdd>
    <18e>   DW_AT_data_member_location: 4
 <2><18f>: Abbrev Number: 0
 <1><190>: Abbrev Number: 12 (DW_TAG_typedef)
    <191>   DW_AT_name        : (indirect string, offset: 0x4a8e8): DMA_TypeDef
    <195>   DW_AT_decl_file   : 5
    <196>   DW_AT_decl_line   : 372
    <198>   DW_AT_decl_column : 3
    <199>   DW_AT_type        : <0x169>
 <1><19d>: Abbrev Number: 9 (DW_TAG_structure_type)
    <19e>   DW_AT_byte_size   : 44
    <19f>   DW_AT_decl_file   : 5
    <1a0>   DW_AT_decl_line   : 471
    <1a2>   DW_AT_decl_column : 9
    <1a3>   DW_AT_sibling     : <0x242>
 <2><1a7>: Abbrev Number: 10 (DW_TAG_member)
    <1a8>   DW_AT_name        : CR1
    <1ac>   DW_AT_decl_file   : 5
    <1ad>   DW_AT_decl_line   : 473
    <1af>   DW_AT_decl_column : 17
    <1b0>   DW_AT_type        : <0xdd>
    <1b4>   DW_AT_data_member_location: 0
 <2><1b5>: Abbrev Number: 10 (DW_TAG_member)
    <1b6>   DW_AT_name        : CR2
    <1ba>   DW_AT_decl_file   : 5
    <1bb>   DW_AT_decl_line   : 474
    <1bd>   DW_AT_decl_column : 17
    <1be>   DW_AT_type        : <0xdd>
    <1c2>   DW_AT_data_member_location: 4
 <2><1c3>: Abbrev Number: 11 (DW_TAG_member)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x1e1d6): OAR1
    <1c8>   DW_AT_decl_file   : 5
    <1c9>   DW_AT_decl_line   : 475
    <1cb>   DW_AT_decl_column : 17
    <1cc>   DW_AT_type        : <0xdd>
    <1d0>   DW_AT_data_member_location: 8
 <2><1d1>: Abbrev Number: 11 (DW_TAG_member)
    <1d2>   DW_AT_name        : (indirect string, offset: 0x564fc): OAR2
    <1d6>   DW_AT_decl_file   : 5
    <1d7>   DW_AT_decl_line   : 476
    <1d9>   DW_AT_decl_column : 17
    <1da>   DW_AT_type        : <0xdd>
    <1de>   DW_AT_data_member_location: 12
 <2><1df>: Abbrev Number: 11 (DW_TAG_member)
    <1e0>   DW_AT_name        : (indirect string, offset: 0x789eb): TIMINGR
    <1e4>   DW_AT_decl_file   : 5
    <1e5>   DW_AT_decl_line   : 477
    <1e7>   DW_AT_decl_column : 17
    <1e8>   DW_AT_type        : <0xdd>
    <1ec>   DW_AT_data_member_location: 16
 <2><1ed>: Abbrev Number: 11 (DW_TAG_member)
    <1ee>   DW_AT_name        : (indirect string, offset: 0xa6fc3): TIMEOUTR
    <1f2>   DW_AT_decl_file   : 5
    <1f3>   DW_AT_decl_line   : 478
    <1f5>   DW_AT_decl_column : 17
    <1f6>   DW_AT_type        : <0xdd>
    <1fa>   DW_AT_data_member_location: 20
 <2><1fb>: Abbrev Number: 10 (DW_TAG_member)
    <1fc>   DW_AT_name        : ISR
    <200>   DW_AT_decl_file   : 5
    <201>   DW_AT_decl_line   : 479
    <203>   DW_AT_decl_column : 17
    <204>   DW_AT_type        : <0xdd>
    <208>   DW_AT_data_member_location: 24
 <2><209>: Abbrev Number: 10 (DW_TAG_member)
    <20a>   DW_AT_name        : ICR
    <20e>   DW_AT_decl_file   : 5
    <20f>   DW_AT_decl_line   : 480
    <211>   DW_AT_decl_column : 17
    <212>   DW_AT_type        : <0xdd>
    <216>   DW_AT_data_member_location: 28
 <2><217>: Abbrev Number: 11 (DW_TAG_member)
    <218>   DW_AT_name        : (indirect string, offset: 0xae7cc): PECR
    <21c>   DW_AT_decl_file   : 5
    <21d>   DW_AT_decl_line   : 481
    <21f>   DW_AT_decl_column : 17
    <220>   DW_AT_type        : <0xdd>
    <224>   DW_AT_data_member_location: 32
 <2><225>: Abbrev Number: 11 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0xa93b0): RXDR
    <22a>   DW_AT_decl_file   : 5
    <22b>   DW_AT_decl_line   : 482
    <22d>   DW_AT_decl_column : 17
    <22e>   DW_AT_type        : <0xdd>
    <232>   DW_AT_data_member_location: 36
 <2><233>: Abbrev Number: 11 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0xd330b): TXDR
    <238>   DW_AT_decl_file   : 5
    <239>   DW_AT_decl_line   : 483
    <23b>   DW_AT_decl_column : 17
    <23c>   DW_AT_type        : <0xdd>
    <240>   DW_AT_data_member_location: 40
 <2><241>: Abbrev Number: 0
 <1><242>: Abbrev Number: 12 (DW_TAG_typedef)
    <243>   DW_AT_name        : (indirect string, offset: 0x1c017): I2C_TypeDef
    <247>   DW_AT_decl_file   : 5
    <248>   DW_AT_decl_line   : 484
    <24a>   DW_AT_decl_column : 3
    <24b>   DW_AT_type        : <0x19d>
 <1><24f>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <250>   DW_AT_encoding    : 7	(unsigned)
    <251>   DW_AT_byte_size   : 1
    <252>   DW_AT_type        : <0x3c>
    <256>   DW_AT_decl_file   : 6
    <257>   DW_AT_decl_line   : 39
    <258>   DW_AT_decl_column : 1
    <259>   DW_AT_sibling     : <0x276>
 <2><25d>: Abbrev Number: 14 (DW_TAG_enumerator)
    <25e>   DW_AT_name        : (indirect string, offset: 0x44d8d): HAL_OK
    <262>   DW_AT_const_value : 0
 <2><263>: Abbrev Number: 14 (DW_TAG_enumerator)
    <264>   DW_AT_name        : (indirect string, offset: 0x803ea): HAL_ERROR
    <268>   DW_AT_const_value : 1
 <2><269>: Abbrev Number: 14 (DW_TAG_enumerator)
    <26a>   DW_AT_name        : (indirect string, offset: 0x23d26): HAL_BUSY
    <26e>   DW_AT_const_value : 2
 <2><26f>: Abbrev Number: 14 (DW_TAG_enumerator)
    <270>   DW_AT_name        : (indirect string, offset: 0x3b886): HAL_TIMEOUT
    <274>   DW_AT_const_value : 3
 <2><275>: Abbrev Number: 0
 <1><276>: Abbrev Number: 3 (DW_TAG_typedef)
    <277>   DW_AT_name        : (indirect string, offset: 0x25e0): HAL_StatusTypeDef
    <27b>   DW_AT_decl_file   : 6
    <27c>   DW_AT_decl_line   : 44
    <27d>   DW_AT_decl_column : 3
    <27e>   DW_AT_type        : <0x24f>
 <1><282>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <283>   DW_AT_encoding    : 7	(unsigned)
    <284>   DW_AT_byte_size   : 1
    <285>   DW_AT_type        : <0x3c>
    <289>   DW_AT_decl_file   : 6
    <28a>   DW_AT_decl_line   : 50
    <28b>   DW_AT_decl_column : 1
    <28c>   DW_AT_sibling     : <0x29d>
 <2><290>: Abbrev Number: 14 (DW_TAG_enumerator)
    <291>   DW_AT_name        : (indirect string, offset: 0x979ac): HAL_UNLOCKED
    <295>   DW_AT_const_value : 0
 <2><296>: Abbrev Number: 14 (DW_TAG_enumerator)
    <297>   DW_AT_name        : (indirect string, offset: 0xcd21f): HAL_LOCKED
    <29b>   DW_AT_const_value : 1
 <2><29c>: Abbrev Number: 0
 <1><29d>: Abbrev Number: 3 (DW_TAG_typedef)
    <29e>   DW_AT_name        : (indirect string, offset: 0x78bf8): HAL_LockTypeDef
    <2a2>   DW_AT_decl_file   : 6
    <2a3>   DW_AT_decl_line   : 53
    <2a4>   DW_AT_decl_column : 3
    <2a5>   DW_AT_type        : <0x282>
 <1><2a9>: Abbrev Number: 15 (DW_TAG_structure_type)
    <2aa>   DW_AT_byte_size   : 32
    <2ab>   DW_AT_decl_file   : 7
    <2ac>   DW_AT_decl_line   : 46
    <2ad>   DW_AT_decl_column : 9
    <2ae>   DW_AT_sibling     : <0x31b>
 <2><2b2>: Abbrev Number: 16 (DW_TAG_member)
    <2b3>   DW_AT_name        : (indirect string, offset: 0xd2ba7): Request
    <2b7>   DW_AT_decl_file   : 7
    <2b8>   DW_AT_decl_line   : 48
    <2b9>   DW_AT_decl_column : 12
    <2ba>   DW_AT_type        : <0xd1>
    <2be>   DW_AT_data_member_location: 0
 <2><2bf>: Abbrev Number: 16 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0xd3196): Direction
    <2c4>   DW_AT_decl_file   : 7
    <2c5>   DW_AT_decl_line   : 51
    <2c6>   DW_AT_decl_column : 12
    <2c7>   DW_AT_type        : <0xd1>
    <2cb>   DW_AT_data_member_location: 4
 <2><2cc>: Abbrev Number: 16 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0xdcba): PeriphInc
    <2d1>   DW_AT_decl_file   : 7
    <2d2>   DW_AT_decl_line   : 55
    <2d3>   DW_AT_decl_column : 12
    <2d4>   DW_AT_type        : <0xd1>
    <2d8>   DW_AT_data_member_location: 8
 <2><2d9>: Abbrev Number: 16 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x1feef): MemInc
    <2de>   DW_AT_decl_file   : 7
    <2df>   DW_AT_decl_line   : 58
    <2e0>   DW_AT_decl_column : 12
    <2e1>   DW_AT_type        : <0xd1>
    <2e5>   DW_AT_data_member_location: 12
 <2><2e6>: Abbrev Number: 16 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x66282): PeriphDataAlignment
    <2eb>   DW_AT_decl_file   : 7
    <2ec>   DW_AT_decl_line   : 61
    <2ed>   DW_AT_decl_column : 12
    <2ee>   DW_AT_type        : <0xd1>
    <2f2>   DW_AT_data_member_location: 16
 <2><2f3>: Abbrev Number: 16 (DW_TAG_member)
    <2f4>   DW_AT_name        : (indirect string, offset: 0xb9094): MemDataAlignment
    <2f8>   DW_AT_decl_file   : 7
    <2f9>   DW_AT_decl_line   : 64
    <2fa>   DW_AT_decl_column : 12
    <2fb>   DW_AT_type        : <0xd1>
    <2ff>   DW_AT_data_member_location: 20
 <2><300>: Abbrev Number: 16 (DW_TAG_member)
    <301>   DW_AT_name        : (indirect string, offset: 0xd3a5b): Mode
    <305>   DW_AT_decl_file   : 7
    <306>   DW_AT_decl_line   : 67
    <307>   DW_AT_decl_column : 12
    <308>   DW_AT_type        : <0xd1>
    <30c>   DW_AT_data_member_location: 24
 <2><30d>: Abbrev Number: 16 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0xd2513): Priority
    <312>   DW_AT_decl_file   : 7
    <313>   DW_AT_decl_line   : 72
    <314>   DW_AT_decl_column : 12
    <315>   DW_AT_type        : <0xd1>
    <319>   DW_AT_data_member_location: 28
 <2><31a>: Abbrev Number: 0
 <1><31b>: Abbrev Number: 3 (DW_TAG_typedef)
    <31c>   DW_AT_name        : (indirect string, offset: 0x36f5a): DMA_InitTypeDef
    <320>   DW_AT_decl_file   : 7
    <321>   DW_AT_decl_line   : 74
    <322>   DW_AT_decl_column : 3
    <323>   DW_AT_type        : <0x2a9>
 <1><327>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <328>   DW_AT_encoding    : 7	(unsigned)
    <329>   DW_AT_byte_size   : 1
    <32a>   DW_AT_type        : <0x3c>
    <32e>   DW_AT_decl_file   : 7
    <32f>   DW_AT_decl_line   : 80
    <330>   DW_AT_decl_column : 1
    <331>   DW_AT_sibling     : <0x34e>
 <2><335>: Abbrev Number: 14 (DW_TAG_enumerator)
    <336>   DW_AT_name        : (indirect string, offset: 0x98cf9): HAL_DMA_STATE_RESET
    <33a>   DW_AT_const_value : 0
 <2><33b>: Abbrev Number: 14 (DW_TAG_enumerator)
    <33c>   DW_AT_name        : (indirect string, offset: 0x19c87): HAL_DMA_STATE_READY
    <340>   DW_AT_const_value : 1
 <2><341>: Abbrev Number: 14 (DW_TAG_enumerator)
    <342>   DW_AT_name        : (indirect string, offset: 0x8e6db): HAL_DMA_STATE_BUSY
    <346>   DW_AT_const_value : 2
 <2><347>: Abbrev Number: 14 (DW_TAG_enumerator)
    <348>   DW_AT_name        : (indirect string, offset: 0xca132): HAL_DMA_STATE_TIMEOUT
    <34c>   DW_AT_const_value : 3
 <2><34d>: Abbrev Number: 0
 <1><34e>: Abbrev Number: 3 (DW_TAG_typedef)
    <34f>   DW_AT_name        : (indirect string, offset: 0x71375): HAL_DMA_StateTypeDef
    <353>   DW_AT_decl_file   : 7
    <354>   DW_AT_decl_line   : 85
    <355>   DW_AT_decl_column : 2
    <356>   DW_AT_type        : <0x327>
 <1><35a>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <35b>   DW_AT_type        : <0x34e>
 <1><35f>: Abbrev Number: 17 (DW_TAG_structure_type)
    <360>   DW_AT_name        : (indirect string, offset: 0xae938): __DMA_HandleTypeDef
    <364>   DW_AT_byte_size   : 72
    <365>   DW_AT_decl_file   : 7
    <366>   DW_AT_decl_line   : 112
    <367>   DW_AT_decl_column : 16
    <368>   DW_AT_sibling     : <0x409>
 <2><36c>: Abbrev Number: 16 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0xa75a1): Instance
    <371>   DW_AT_decl_file   : 7
    <372>   DW_AT_decl_line   : 114
    <373>   DW_AT_decl_column : 27
    <374>   DW_AT_type        : <0x409>
    <378>   DW_AT_data_member_location: 0
 <2><379>: Abbrev Number: 16 (DW_TAG_member)
    <37a>   DW_AT_name        : (indirect string, offset: 0xd46c3): Init
    <37e>   DW_AT_decl_file   : 7
    <37f>   DW_AT_decl_line   : 116
    <380>   DW_AT_decl_column : 25
    <381>   DW_AT_type        : <0x31b>
    <385>   DW_AT_data_member_location: 4
 <2><386>: Abbrev Number: 16 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0x92500): Lock
    <38b>   DW_AT_decl_file   : 7
    <38c>   DW_AT_decl_line   : 118
    <38d>   DW_AT_decl_column : 25
    <38e>   DW_AT_type        : <0x29d>
    <392>   DW_AT_data_member_location: 36
 <2><393>: Abbrev Number: 16 (DW_TAG_member)
    <394>   DW_AT_name        : (indirect string, offset: 0xd5713): State
    <398>   DW_AT_decl_file   : 7
    <399>   DW_AT_decl_line   : 120
    <39a>   DW_AT_decl_column : 30
    <39b>   DW_AT_type        : <0x35a>
    <39f>   DW_AT_data_member_location: 37
 <2><3a0>: Abbrev Number: 16 (DW_TAG_member)
    <3a1>   DW_AT_name        : (indirect string, offset: 0xc32ff): Parent
    <3a5>   DW_AT_decl_file   : 7
    <3a6>   DW_AT_decl_line   : 122
    <3a7>   DW_AT_decl_column : 26
    <3a8>   DW_AT_type        : <0x9a>
    <3ac>   DW_AT_data_member_location: 40
 <2><3ad>: Abbrev Number: 16 (DW_TAG_member)
    <3ae>   DW_AT_name        : (indirect string, offset: 0xcc3fd): XferCpltCallback
    <3b2>   DW_AT_decl_file   : 7
    <3b3>   DW_AT_decl_line   : 124
    <3b4>   DW_AT_decl_column : 28
    <3b5>   DW_AT_type        : <0x420>
    <3b9>   DW_AT_data_member_location: 44
 <2><3ba>: Abbrev Number: 16 (DW_TAG_member)
    <3bb>   DW_AT_name        : (indirect string, offset: 0x9f599): XferHalfCpltCallback
    <3bf>   DW_AT_decl_file   : 7
    <3c0>   DW_AT_decl_line   : 126
    <3c1>   DW_AT_decl_column : 28
    <3c2>   DW_AT_type        : <0x420>
    <3c6>   DW_AT_data_member_location: 48
 <2><3c7>: Abbrev Number: 16 (DW_TAG_member)
    <3c8>   DW_AT_name        : (indirect string, offset: 0x1d5ec): XferErrorCallback
    <3cc>   DW_AT_decl_file   : 7
    <3cd>   DW_AT_decl_line   : 128
    <3ce>   DW_AT_decl_column : 28
    <3cf>   DW_AT_type        : <0x420>
    <3d3>   DW_AT_data_member_location: 52
 <2><3d4>: Abbrev Number: 16 (DW_TAG_member)
    <3d5>   DW_AT_name        : (indirect string, offset: 0xbf446): XferAbortCallback
    <3d9>   DW_AT_decl_file   : 7
    <3da>   DW_AT_decl_line   : 130
    <3db>   DW_AT_decl_column : 28
    <3dc>   DW_AT_type        : <0x420>
    <3e0>   DW_AT_data_member_location: 56
 <2><3e1>: Abbrev Number: 16 (DW_TAG_member)
    <3e2>   DW_AT_name        : (indirect string, offset: 0xc8b10): ErrorCode
    <3e6>   DW_AT_decl_file   : 7
    <3e7>   DW_AT_decl_line   : 132
    <3e8>   DW_AT_decl_column : 25
    <3e9>   DW_AT_type        : <0xdd>
    <3ed>   DW_AT_data_member_location: 60
 <2><3ee>: Abbrev Number: 16 (DW_TAG_member)
    <3ef>   DW_AT_name        : (indirect string, offset: 0x52e38): DmaBaseAddress
    <3f3>   DW_AT_decl_file   : 7
    <3f4>   DW_AT_decl_line   : 134
    <3f5>   DW_AT_decl_column : 26
    <3f6>   DW_AT_type        : <0x426>
    <3fa>   DW_AT_data_member_location: 64
 <2><3fb>: Abbrev Number: 16 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0xbe0f2): ChannelIndex
    <400>   DW_AT_decl_file   : 7
    <401>   DW_AT_decl_line   : 136
    <402>   DW_AT_decl_column : 25
    <403>   DW_AT_type        : <0xd1>
    <407>   DW_AT_data_member_location: 68
 <2><408>: Abbrev Number: 0
 <1><409>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <40a>   DW_AT_byte_size   : 4
    <40b>   DW_AT_type        : <0x15c>
 <1><40f>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <410>   DW_AT_prototyped  : 1
    <410>   DW_AT_sibling     : <0x41a>
 <2><414>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <415>   DW_AT_type        : <0x41a>
 <2><419>: Abbrev Number: 0
 <1><41a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <41b>   DW_AT_byte_size   : 4
    <41c>   DW_AT_type        : <0x35f>
 <1><420>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <421>   DW_AT_byte_size   : 4
    <422>   DW_AT_type        : <0x40f>
 <1><426>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <427>   DW_AT_byte_size   : 4
    <428>   DW_AT_type        : <0x190>
 <1><42c>: Abbrev Number: 3 (DW_TAG_typedef)
    <42d>   DW_AT_name        : (indirect string, offset: 0xae93a): DMA_HandleTypeDef
    <431>   DW_AT_decl_file   : 7
    <432>   DW_AT_decl_line   : 153
    <433>   DW_AT_decl_column : 2
    <434>   DW_AT_type        : <0x35f>
 <1><438>: Abbrev Number: 15 (DW_TAG_structure_type)
    <439>   DW_AT_byte_size   : 32
    <43a>   DW_AT_decl_file   : 8
    <43b>   DW_AT_decl_line   : 47
    <43c>   DW_AT_decl_column : 9
    <43d>   DW_AT_sibling     : <0x4aa>
 <2><441>: Abbrev Number: 16 (DW_TAG_member)
    <442>   DW_AT_name        : (indirect string, offset: 0xba1cb): Timing
    <446>   DW_AT_decl_file   : 8
    <447>   DW_AT_decl_line   : 49
    <448>   DW_AT_decl_column : 12
    <449>   DW_AT_type        : <0xd1>
    <44d>   DW_AT_data_member_location: 0
 <2><44e>: Abbrev Number: 16 (DW_TAG_member)
    <44f>   DW_AT_name        : (indirect string, offset: 0x49c41): OwnAddress1
    <453>   DW_AT_decl_file   : 8
    <454>   DW_AT_decl_line   : 53
    <455>   DW_AT_decl_column : 12
    <456>   DW_AT_type        : <0xd1>
    <45a>   DW_AT_data_member_location: 4
 <2><45b>: Abbrev Number: 16 (DW_TAG_member)
    <45c>   DW_AT_name        : (indirect string, offset: 0x56efe): AddressingMode
    <460>   DW_AT_decl_file   : 8
    <461>   DW_AT_decl_line   : 56
    <462>   DW_AT_decl_column : 12
    <463>   DW_AT_type        : <0xd1>
    <467>   DW_AT_data_member_location: 8
 <2><468>: Abbrev Number: 16 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0x93698): DualAddressMode
    <46d>   DW_AT_decl_file   : 8
    <46e>   DW_AT_decl_line   : 59
    <46f>   DW_AT_decl_column : 12
    <470>   DW_AT_type        : <0xd1>
    <474>   DW_AT_data_member_location: 12
 <2><475>: Abbrev Number: 16 (DW_TAG_member)
    <476>   DW_AT_name        : (indirect string, offset: 0x49c4d): OwnAddress2
    <47a>   DW_AT_decl_file   : 8
    <47b>   DW_AT_decl_line   : 62
    <47c>   DW_AT_decl_column : 12
    <47d>   DW_AT_type        : <0xd1>
    <481>   DW_AT_data_member_location: 16
 <2><482>: Abbrev Number: 16 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0x58485): OwnAddress2Masks
    <487>   DW_AT_decl_file   : 8
    <488>   DW_AT_decl_line   : 65
    <489>   DW_AT_decl_column : 12
    <48a>   DW_AT_type        : <0xd1>
    <48e>   DW_AT_data_member_location: 20
 <2><48f>: Abbrev Number: 16 (DW_TAG_member)
    <490>   DW_AT_name        : (indirect string, offset: 0x21278): GeneralCallMode
    <494>   DW_AT_decl_file   : 8
    <495>   DW_AT_decl_line   : 69
    <496>   DW_AT_decl_column : 12
    <497>   DW_AT_type        : <0xd1>
    <49b>   DW_AT_data_member_location: 24
 <2><49c>: Abbrev Number: 16 (DW_TAG_member)
    <49d>   DW_AT_name        : (indirect string, offset: 0x3e650): NoStretchMode
    <4a1>   DW_AT_decl_file   : 8
    <4a2>   DW_AT_decl_line   : 72
    <4a3>   DW_AT_decl_column : 12
    <4a4>   DW_AT_type        : <0xd1>
    <4a8>   DW_AT_data_member_location: 28
 <2><4a9>: Abbrev Number: 0
 <1><4aa>: Abbrev Number: 3 (DW_TAG_typedef)
    <4ab>   DW_AT_name        : (indirect string, offset: 0x40e6d): I2C_InitTypeDef
    <4af>   DW_AT_decl_file   : 8
    <4b0>   DW_AT_decl_line   : 75
    <4b1>   DW_AT_decl_column : 3
    <4b2>   DW_AT_type        : <0x438>
 <1><4b6>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <4b7>   DW_AT_encoding    : 7	(unsigned)
    <4b8>   DW_AT_byte_size   : 1
    <4b9>   DW_AT_type        : <0x3c>
    <4bd>   DW_AT_decl_file   : 8
    <4be>   DW_AT_decl_line   : 109
    <4bf>   DW_AT_decl_column : 1
    <4c0>   DW_AT_sibling     : <0x507>
 <2><4c4>: Abbrev Number: 14 (DW_TAG_enumerator)
    <4c5>   DW_AT_name        : (indirect string, offset: 0x401f9): HAL_I2C_STATE_RESET
    <4c9>   DW_AT_const_value : 0
 <2><4ca>: Abbrev Number: 14 (DW_TAG_enumerator)
    <4cb>   DW_AT_name        : (indirect string, offset: 0x41f7f): HAL_I2C_STATE_READY
    <4cf>   DW_AT_const_value : 32
 <2><4d0>: Abbrev Number: 14 (DW_TAG_enumerator)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x3ae3e): HAL_I2C_STATE_BUSY
    <4d5>   DW_AT_const_value : 36
 <2><4d6>: Abbrev Number: 14 (DW_TAG_enumerator)
    <4d7>   DW_AT_name        : (indirect string, offset: 0xc2389): HAL_I2C_STATE_BUSY_TX
    <4db>   DW_AT_const_value : 33
 <2><4dc>: Abbrev Number: 14 (DW_TAG_enumerator)
    <4dd>   DW_AT_name        : (indirect string, offset: 0x1280e): HAL_I2C_STATE_BUSY_RX
    <4e1>   DW_AT_const_value : 34
 <2><4e2>: Abbrev Number: 14 (DW_TAG_enumerator)
    <4e3>   DW_AT_name        : (indirect string, offset: 0x51029): HAL_I2C_STATE_LISTEN
    <4e7>   DW_AT_const_value : 40
 <2><4e8>: Abbrev Number: 14 (DW_TAG_enumerator)
    <4e9>   DW_AT_name        : (indirect string, offset: 0x30fad): HAL_I2C_STATE_BUSY_TX_LISTEN
    <4ed>   DW_AT_const_value : 41
 <2><4ee>: Abbrev Number: 14 (DW_TAG_enumerator)
    <4ef>   DW_AT_name        : (indirect string, offset: 0xac0bd): HAL_I2C_STATE_BUSY_RX_LISTEN
    <4f3>   DW_AT_const_value : 42
 <2><4f4>: Abbrev Number: 14 (DW_TAG_enumerator)
    <4f5>   DW_AT_name        : (indirect string, offset: 0x385f0): HAL_I2C_STATE_ABORT
    <4f9>   DW_AT_const_value : 96
 <2><4fa>: Abbrev Number: 14 (DW_TAG_enumerator)
    <4fb>   DW_AT_name        : (indirect string, offset: 0xab341): HAL_I2C_STATE_TIMEOUT
    <4ff>   DW_AT_const_value : 160
 <2><500>: Abbrev Number: 14 (DW_TAG_enumerator)
    <501>   DW_AT_name        : (indirect string, offset: 0xb9a8b): HAL_I2C_STATE_ERROR
    <505>   DW_AT_const_value : 224
 <2><506>: Abbrev Number: 0
 <1><507>: Abbrev Number: 3 (DW_TAG_typedef)
    <508>   DW_AT_name        : (indirect string, offset: 0x220fd): HAL_I2C_StateTypeDef
    <50c>   DW_AT_decl_file   : 8
    <50d>   DW_AT_decl_line   : 124
    <50e>   DW_AT_decl_column : 3
    <50f>   DW_AT_type        : <0x4b6>
 <1><513>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <514>   DW_AT_type        : <0x507>
 <1><518>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <519>   DW_AT_encoding    : 7	(unsigned)
    <51a>   DW_AT_byte_size   : 1
    <51b>   DW_AT_type        : <0x3c>
    <51f>   DW_AT_decl_file   : 8
    <520>   DW_AT_decl_line   : 149
    <521>   DW_AT_decl_column : 1
    <522>   DW_AT_sibling     : <0x53f>
 <2><526>: Abbrev Number: 14 (DW_TAG_enumerator)
    <527>   DW_AT_name        : (indirect string, offset: 0x358a7): HAL_I2C_MODE_NONE
    <52b>   DW_AT_const_value : 0
 <2><52c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <52d>   DW_AT_name        : (indirect string, offset: 0x6d5d6): HAL_I2C_MODE_MASTER
    <531>   DW_AT_const_value : 16
 <2><532>: Abbrev Number: 14 (DW_TAG_enumerator)
    <533>   DW_AT_name        : (indirect string, offset: 0x66920): HAL_I2C_MODE_SLAVE
    <537>   DW_AT_const_value : 32
 <2><538>: Abbrev Number: 14 (DW_TAG_enumerator)
    <539>   DW_AT_name        : (indirect string, offset: 0x406aa): HAL_I2C_MODE_MEM
    <53d>   DW_AT_const_value : 64
 <2><53e>: Abbrev Number: 0
 <1><53f>: Abbrev Number: 3 (DW_TAG_typedef)
    <540>   DW_AT_name        : (indirect string, offset: 0x63437): HAL_I2C_ModeTypeDef
    <544>   DW_AT_decl_file   : 8
    <545>   DW_AT_decl_line   : 155
    <546>   DW_AT_decl_column : 3
    <547>   DW_AT_type        : <0x518>
 <1><54b>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <54c>   DW_AT_type        : <0x53f>
 <1><550>: Abbrev Number: 17 (DW_TAG_structure_type)
    <551>   DW_AT_name        : (indirect string, offset: 0x15351): __I2C_HandleTypeDef
    <555>   DW_AT_byte_size   : 84
    <556>   DW_AT_decl_file   : 8
    <557>   DW_AT_decl_line   : 186
    <558>   DW_AT_decl_column : 16
    <559>   DW_AT_sibling     : <0x63b>
 <2><55d>: Abbrev Number: 16 (DW_TAG_member)
    <55e>   DW_AT_name        : (indirect string, offset: 0xa75a1): Instance
    <562>   DW_AT_decl_file   : 8
    <563>   DW_AT_decl_line   : 188
    <564>   DW_AT_decl_column : 31
    <565>   DW_AT_type        : <0x63b>
    <569>   DW_AT_data_member_location: 0
 <2><56a>: Abbrev Number: 16 (DW_TAG_member)
    <56b>   DW_AT_name        : (indirect string, offset: 0xd46c3): Init
    <56f>   DW_AT_decl_file   : 8
    <570>   DW_AT_decl_line   : 190
    <571>   DW_AT_decl_column : 30
    <572>   DW_AT_type        : <0x4aa>
    <576>   DW_AT_data_member_location: 4
 <2><577>: Abbrev Number: 16 (DW_TAG_member)
    <578>   DW_AT_name        : (indirect string, offset: 0x1366a): pBuffPtr
    <57c>   DW_AT_decl_file   : 8
    <57d>   DW_AT_decl_line   : 192
    <57e>   DW_AT_decl_column : 31
    <57f>   DW_AT_type        : <0x641>
    <583>   DW_AT_data_member_location: 36
 <2><584>: Abbrev Number: 16 (DW_TAG_member)
    <585>   DW_AT_name        : (indirect string, offset: 0xcf3c1): XferSize
    <589>   DW_AT_decl_file   : 8
    <58a>   DW_AT_decl_line   : 194
    <58b>   DW_AT_decl_column : 30
    <58c>   DW_AT_type        : <0xc0>
    <590>   DW_AT_data_member_location: 40
 <2><591>: Abbrev Number: 16 (DW_TAG_member)
    <592>   DW_AT_name        : (indirect string, offset: 0xcf68f): XferCount
    <596>   DW_AT_decl_file   : 8
    <597>   DW_AT_decl_line   : 196
    <598>   DW_AT_decl_column : 30
    <599>   DW_AT_type        : <0xcc>
    <59d>   DW_AT_data_member_location: 42
 <2><59e>: Abbrev Number: 16 (DW_TAG_member)
    <59f>   DW_AT_name        : (indirect string, offset: 0xd2bbf): XferOptions
    <5a3>   DW_AT_decl_file   : 8
    <5a4>   DW_AT_decl_line   : 198
    <5a5>   DW_AT_decl_column : 30
    <5a6>   DW_AT_type        : <0xdd>
    <5aa>   DW_AT_data_member_location: 44
 <2><5ab>: Abbrev Number: 16 (DW_TAG_member)
    <5ac>   DW_AT_name        : (indirect string, offset: 0x5afb9): PreviousState
    <5b0>   DW_AT_decl_file   : 8
    <5b1>   DW_AT_decl_line   : 201
    <5b2>   DW_AT_decl_column : 30
    <5b3>   DW_AT_type        : <0xdd>
    <5b7>   DW_AT_data_member_location: 48
 <2><5b8>: Abbrev Number: 16 (DW_TAG_member)
    <5b9>   DW_AT_name        : (indirect string, offset: 0x75295): XferISR
    <5bd>   DW_AT_decl_file   : 8
    <5be>   DW_AT_decl_line   : 203
    <5bf>   DW_AT_decl_column : 22
    <5c0>   DW_AT_type        : <0x666>
    <5c4>   DW_AT_data_member_location: 52
 <2><5c5>: Abbrev Number: 16 (DW_TAG_member)
    <5c6>   DW_AT_name        : (indirect string, offset: 0xa845c): hdmatx
    <5ca>   DW_AT_decl_file   : 8
    <5cb>   DW_AT_decl_line   : 206
    <5cc>   DW_AT_decl_column : 31
    <5cd>   DW_AT_type        : <0x66c>
    <5d1>   DW_AT_data_member_location: 56
 <2><5d2>: Abbrev Number: 16 (DW_TAG_member)
    <5d3>   DW_AT_name        : (indirect string, offset: 0xc725b): hdmarx
    <5d7>   DW_AT_decl_file   : 8
    <5d8>   DW_AT_decl_line   : 208
    <5d9>   DW_AT_decl_column : 31
    <5da>   DW_AT_type        : <0x66c>
    <5de>   DW_AT_data_member_location: 60
 <2><5df>: Abbrev Number: 16 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x92500): Lock
    <5e4>   DW_AT_decl_file   : 8
    <5e5>   DW_AT_decl_line   : 210
    <5e6>   DW_AT_decl_column : 30
    <5e7>   DW_AT_type        : <0x29d>
    <5eb>   DW_AT_data_member_location: 64
 <2><5ec>: Abbrev Number: 16 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xd5713): State
    <5f1>   DW_AT_decl_file   : 8
    <5f2>   DW_AT_decl_line   : 212
    <5f3>   DW_AT_decl_column : 30
    <5f4>   DW_AT_type        : <0x513>
    <5f8>   DW_AT_data_member_location: 65
 <2><5f9>: Abbrev Number: 16 (DW_TAG_member)
    <5fa>   DW_AT_name        : (indirect string, offset: 0xd3a5b): Mode
    <5fe>   DW_AT_decl_file   : 8
    <5ff>   DW_AT_decl_line   : 214
    <600>   DW_AT_decl_column : 30
    <601>   DW_AT_type        : <0x54b>
    <605>   DW_AT_data_member_location: 66
 <2><606>: Abbrev Number: 16 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0xc8b10): ErrorCode
    <60b>   DW_AT_decl_file   : 8
    <60c>   DW_AT_decl_line   : 216
    <60d>   DW_AT_decl_column : 30
    <60e>   DW_AT_type        : <0xdd>
    <612>   DW_AT_data_member_location: 68
 <2><613>: Abbrev Number: 16 (DW_TAG_member)
    <614>   DW_AT_name        : (indirect string, offset: 0xa7df): AddrEventCount
    <618>   DW_AT_decl_file   : 8
    <619>   DW_AT_decl_line   : 218
    <61a>   DW_AT_decl_column : 30
    <61b>   DW_AT_type        : <0xdd>
    <61f>   DW_AT_data_member_location: 72
 <2><620>: Abbrev Number: 16 (DW_TAG_member)
    <621>   DW_AT_name        : (indirect string, offset: 0x8531b): Devaddress
    <625>   DW_AT_decl_file   : 8
    <626>   DW_AT_decl_line   : 220
    <627>   DW_AT_decl_column : 30
    <628>   DW_AT_type        : <0xdd>
    <62c>   DW_AT_data_member_location: 76
 <2><62d>: Abbrev Number: 16 (DW_TAG_member)
    <62e>   DW_AT_name        : (indirect string, offset: 0x7d4c8): Memaddress
    <632>   DW_AT_decl_file   : 8
    <633>   DW_AT_decl_line   : 222
    <634>   DW_AT_decl_column : 30
    <635>   DW_AT_type        : <0xdd>
    <639>   DW_AT_data_member_location: 80
 <2><63a>: Abbrev Number: 0
 <1><63b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <63c>   DW_AT_byte_size   : 4
    <63d>   DW_AT_type        : <0x242>
 <1><641>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <642>   DW_AT_byte_size   : 4
    <643>   DW_AT_type        : <0xb4>
 <1><647>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <648>   DW_AT_prototyped  : 1
    <648>   DW_AT_type        : <0x276>
    <64c>   DW_AT_sibling     : <0x660>
 <2><650>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <651>   DW_AT_type        : <0x660>
 <2><655>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <656>   DW_AT_type        : <0xd1>
 <2><65a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <65b>   DW_AT_type        : <0xd1>
 <2><65f>: Abbrev Number: 0
 <1><660>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <661>   DW_AT_byte_size   : 4
    <662>   DW_AT_type        : <0x550>
 <1><666>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <667>   DW_AT_byte_size   : 4
    <668>   DW_AT_type        : <0x647>
 <1><66c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <66d>   DW_AT_byte_size   : 4
    <66e>   DW_AT_type        : <0x42c>
 <1><672>: Abbrev Number: 3 (DW_TAG_typedef)
    <673>   DW_AT_name        : (indirect string, offset: 0x15353): I2C_HandleTypeDef
    <677>   DW_AT_decl_file   : 8
    <678>   DW_AT_decl_line   : 253
    <679>   DW_AT_decl_column : 3
    <67a>   DW_AT_type        : <0x550>
 <1><67e>: Abbrev Number: 21 (DW_TAG_variable)
    <67f>   DW_AT_name        : (indirect string, offset: 0xce336): status
    <683>   DW_AT_decl_file   : 1
    <684>   DW_AT_decl_line   : 6
    <685>   DW_AT_decl_column : 19
    <686>   DW_AT_type        : <0xcc>
    <68a>   DW_AT_external    : 1
    <68a>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><690>: Abbrev Number: 22 (DW_TAG_variable)
    <691>   DW_AT_name        : (indirect string, offset: 0x56da): hi2c1
    <695>   DW_AT_decl_file   : 1
    <696>   DW_AT_decl_line   : 7
    <697>   DW_AT_decl_column : 26
    <698>   DW_AT_type        : <0x672>
    <69c>   DW_AT_external    : 1
    <69c>   DW_AT_declaration : 1
 <1><69c>: Abbrev Number: 21 (DW_TAG_variable)
    <69d>   DW_AT_name        : (indirect string, offset: 0x43ab7): TIMER_1MS_FLG
    <6a1>   DW_AT_decl_file   : 1
    <6a2>   DW_AT_decl_line   : 10
    <6a3>   DW_AT_decl_column : 15
    <6a4>   DW_AT_type        : <0x108>
    <6a8>   DW_AT_external    : 1
    <6a8>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><6ae>: Abbrev Number: 21 (DW_TAG_variable)
    <6af>   DW_AT_name        : (indirect string, offset: 0x89aa5): EC_DATA_AVAIL
    <6b3>   DW_AT_decl_file   : 1
    <6b4>   DW_AT_decl_line   : 11
    <6b5>   DW_AT_decl_column : 15
    <6b6>   DW_AT_type        : <0x108>
    <6ba>   DW_AT_external    : 1
    <6ba>   DW_AT_location    : 5 byte block: 3 95 0 0 20 	(DW_OP_addr: 20000095)
 <1><6c0>: Abbrev Number: 23 (DW_TAG_subprogram)
    <6c1>   DW_AT_external    : 1
    <6c1>   DW_AT_name        : (indirect string, offset: 0x9204c): vPortExitCritical
    <6c5>   DW_AT_decl_file   : 9
    <6c6>   DW_AT_decl_line   : 98
    <6c7>   DW_AT_decl_column : 13
    <6c8>   DW_AT_prototyped  : 1
    <6c8>   DW_AT_declaration : 1
 <1><6c8>: Abbrev Number: 23 (DW_TAG_subprogram)
    <6c9>   DW_AT_external    : 1
    <6c9>   DW_AT_name        : (indirect string, offset: 0xc40d0): vPortEnterCritical
    <6cd>   DW_AT_decl_file   : 9
    <6ce>   DW_AT_decl_line   : 97
    <6cf>   DW_AT_decl_column : 13
    <6d0>   DW_AT_prototyped  : 1
    <6d0>   DW_AT_declaration : 1
 <1><6d0>: Abbrev Number: 24 (DW_TAG_subprogram)
    <6d1>   DW_AT_external    : 1
    <6d1>   DW_AT_name        : (indirect string, offset: 0xc357e): HAL_I2C_Master_Receive
    <6d5>   DW_AT_decl_file   : 8
    <6d6>   DW_AT_decl_line   : 627
    <6d8>   DW_AT_decl_column : 19
    <6d9>   DW_AT_prototyped  : 1
    <6d9>   DW_AT_type        : <0x276>
    <6dd>   DW_AT_declaration : 1
    <6dd>   DW_AT_sibling     : <0x6fb>
 <2><6e1>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <6e2>   DW_AT_type        : <0x6fb>
 <2><6e6>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <6e7>   DW_AT_type        : <0xc0>
 <2><6eb>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <6ec>   DW_AT_type        : <0x641>
 <2><6f0>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <6f1>   DW_AT_type        : <0xc0>
 <2><6f5>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <6f6>   DW_AT_type        : <0xd1>
 <2><6fa>: Abbrev Number: 0
 <1><6fb>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <6fc>   DW_AT_byte_size   : 4
    <6fd>   DW_AT_type        : <0x672>
 <1><701>: Abbrev Number: 24 (DW_TAG_subprogram)
    <702>   DW_AT_external    : 1
    <702>   DW_AT_name        : (indirect string, offset: 0x4e717): HAL_I2C_Master_Transmit
    <706>   DW_AT_decl_file   : 8
    <707>   DW_AT_decl_line   : 625
    <709>   DW_AT_decl_column : 19
    <70a>   DW_AT_prototyped  : 1
    <70a>   DW_AT_type        : <0x276>
    <70e>   DW_AT_declaration : 1
    <70e>   DW_AT_sibling     : <0x72c>
 <2><712>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <713>   DW_AT_type        : <0x6fb>
 <2><717>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <718>   DW_AT_type        : <0xc0>
 <2><71c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <71d>   DW_AT_type        : <0x641>
 <2><721>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <722>   DW_AT_type        : <0xc0>
 <2><726>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <727>   DW_AT_type        : <0xd1>
 <2><72b>: Abbrev Number: 0
 <1><72c>: Abbrev Number: 25 (DW_TAG_subprogram)
    <72d>   DW_AT_external    : 1
    <72d>   DW_AT_name        : (indirect string, offset: 0x7624): printf
    <731>   DW_AT_decl_file   : 10
    <732>   DW_AT_decl_line   : 200
    <733>   DW_AT_decl_column : 5
    <734>   DW_AT_prototyped  : 1
    <734>   DW_AT_type        : <0x85>
    <738>   DW_AT_declaration : 1
    <738>   DW_AT_sibling     : <0x743>
 <2><73c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <73d>   DW_AT_type        : <0xae>
 <2><741>: Abbrev Number: 26 (DW_TAG_unspecified_parameters)
 <2><742>: Abbrev Number: 0
 <1><743>: Abbrev Number: 27 (DW_TAG_subprogram)
    <744>   DW_AT_external    : 1
    <744>   DW_AT_name        : (indirect string, offset: 0xbda40): i2c_cmd_WrRd
    <748>   DW_AT_decl_file   : 1
    <749>   DW_AT_decl_line   : 32
    <74a>   DW_AT_decl_column : 7
    <74b>   DW_AT_prototyped  : 1
    <74b>   DW_AT_type        : <0xf0>
    <74f>   DW_AT_low_pc      : 0x8000ec8
    <753>   DW_AT_high_pc     : 0xec
    <757>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <759>   DW_AT_GNU_all_tail_call_sites: 1
    <759>   DW_AT_sibling     : <0x7b8>
 <2><75d>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <75e>   DW_AT_name        : (indirect string, offset: 0x50617): ucCmd
    <762>   DW_AT_decl_file   : 1
    <763>   DW_AT_decl_line   : 32
    <764>   DW_AT_decl_column : 26
    <765>   DW_AT_type        : <0xf0>
    <769>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><76c>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <76d>   DW_AT_name        : (indirect string, offset: 0xb55f0): ucBytes_wr
    <771>   DW_AT_decl_file   : 1
    <772>   DW_AT_decl_line   : 32
    <773>   DW_AT_decl_column : 39
    <774>   DW_AT_type        : <0xf0>
    <778>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><77b>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <77c>   DW_AT_name        : (indirect string, offset: 0x19e3c): ucData_wr
    <780>   DW_AT_decl_file   : 1
    <781>   DW_AT_decl_line   : 32
    <782>   DW_AT_decl_column : 58
    <783>   DW_AT_type        : <0x7b8>
    <787>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><78a>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <78b>   DW_AT_name        : (indirect string, offset: 0x6b7c2): usBytes_rd
    <78f>   DW_AT_decl_file   : 1
    <790>   DW_AT_decl_line   : 32
    <791>   DW_AT_decl_column : 76
    <792>   DW_AT_type        : <0x10d>
    <796>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><799>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <79a>   DW_AT_name        : (indirect string, offset: 0x17b2b): ucData_rd
    <79e>   DW_AT_decl_file   : 1
    <79f>   DW_AT_decl_line   : 32
    <7a0>   DW_AT_decl_column : 95
    <7a1>   DW_AT_type        : <0x7b8>
    <7a5>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><7a8>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <7a9>   DW_AT_name        : (indirect string, offset: 0xa5c22): bAdjust
    <7ad>   DW_AT_decl_file   : 1
    <7ae>   DW_AT_decl_line   : 32
    <7af>   DW_AT_decl_column : 111
    <7b0>   DW_AT_type        : <0xfc>
    <7b4>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><7b7>: Abbrev Number: 0
 <1><7b8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <7b9>   DW_AT_byte_size   : 4
    <7ba>   DW_AT_type        : <0xf0>
 <1><7be>: Abbrev Number: 29 (DW_TAG_subprogram)
    <7bf>   DW_AT_external    : 1
    <7bf>   DW_AT_name        : (indirect string, offset: 0xa7645): error_handler
    <7c3>   DW_AT_decl_file   : 1
    <7c4>   DW_AT_decl_line   : 16
    <7c5>   DW_AT_decl_column : 6
    <7c6>   DW_AT_prototyped  : 1
    <7c6>   DW_AT_low_pc      : 0x8000e9c
    <7ca>   DW_AT_high_pc     : 0x2c
    <7ce>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7d0>   DW_AT_GNU_all_tail_call_sites: 1
    <7d0>   DW_AT_sibling     : <0x815>
 <2><7d4>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <7d5>   DW_AT_name        : str
    <7d9>   DW_AT_decl_file   : 1
    <7da>   DW_AT_decl_line   : 16
    <7db>   DW_AT_decl_column : 26
    <7dc>   DW_AT_type        : <0x9c>
    <7e0>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><7e4>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <7e5>   DW_AT_name        : (indirect string, offset: 0xd090b): offset
    <7e9>   DW_AT_decl_file   : 1
    <7ea>   DW_AT_decl_line   : 16
    <7eb>   DW_AT_decl_column : 38
    <7ec>   DW_AT_type        : <0x10d>
    <7f0>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><7f4>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <7f5>   DW_AT_name        : (indirect string, offset: 0xb882e): errval
    <7f9>   DW_AT_decl_file   : 1
    <7fa>   DW_AT_decl_line   : 16
    <7fb>   DW_AT_decl_column : 53
    <7fc>   DW_AT_type        : <0x10d>
    <800>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <2><804>: Abbrev Number: 31 (DW_TAG_variable)
    <805>   DW_AT_name        : (indirect string, offset: 0x54aed): err_buf
    <809>   DW_AT_decl_file   : 1
    <80a>   DW_AT_decl_line   : 18
    <80b>   DW_AT_decl_column : 7
    <80c>   DW_AT_type        : <0x815>
    <810>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><814>: Abbrev Number: 0
 <1><815>: Abbrev Number: 32 (DW_TAG_array_type)
    <816>   DW_AT_type        : <0xa2>
 <2><81a>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <81b>   DW_AT_type        : <0x8c>
    <81f>   DW_AT_upper_bound : 63
 <2><820>: Abbrev Number: 0
 <1><821>: Abbrev Number: 0
  Compilation Unit @ offset 0x822:
   Length:        0x5fb (32-bit)
   Version:       4
   Abbrev Offset: 0x1eb
   Pointer Size:  4
 <0><82d>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <82e>   DW_AT_producer    : (indirect string, offset: 0x36c1b): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <832>   DW_AT_language    : 12	(ANSI C99)
    <833>   DW_AT_name        : (indirect string, offset: 0xcdfa2): ../Core/MikroSDK-ExampleCode/sensors.c
    <837>   DW_AT_comp_dir    : (indirect string, offset: 0x16b2f): C:/Users/pjura/Desktop/dev/stm32/3d-motion-debug/Debug
    <83b>   DW_AT_ranges      : 0x18
    <83f>   DW_AT_low_pc      : 0x0
    <843>   DW_AT_stmt_list   : 0xb7c
    <847>   DW_AT_GNU_macros  : 0x108f
 <1><84b>: Abbrev Number: 2 (DW_TAG_typedef)
    <84c>   DW_AT_name        : (indirect string, offset: 0xcdef6): __int8_t
    <850>   DW_AT_decl_file   : 2
    <851>   DW_AT_decl_line   : 41
    <852>   DW_AT_decl_column : 23
    <853>   DW_AT_type        : <0x857>
 <1><857>: Abbrev Number: 3 (DW_TAG_base_type)
    <858>   DW_AT_byte_size   : 1
    <859>   DW_AT_encoding    : 6	(signed char)
    <85a>   DW_AT_name        : (indirect string, offset: 0x66e2c): signed char
 <1><85e>: Abbrev Number: 3 (DW_TAG_base_type)
    <85f>   DW_AT_byte_size   : 1
    <860>   DW_AT_encoding    : 8	(unsigned char)
    <861>   DW_AT_name        : (indirect string, offset: 0xc6326): unsigned char
 <1><865>: Abbrev Number: 2 (DW_TAG_typedef)
    <866>   DW_AT_name        : (indirect string, offset: 0xcdf12): __int16_t
    <86a>   DW_AT_decl_file   : 2
    <86b>   DW_AT_decl_line   : 55
    <86c>   DW_AT_decl_column : 24
    <86d>   DW_AT_type        : <0x871>
 <1><871>: Abbrev Number: 3 (DW_TAG_base_type)
    <872>   DW_AT_byte_size   : 2
    <873>   DW_AT_encoding    : 5	(signed)
    <874>   DW_AT_name        : (indirect string, offset: 0x989af): short int
 <1><878>: Abbrev Number: 3 (DW_TAG_base_type)
    <879>   DW_AT_byte_size   : 2
    <87a>   DW_AT_encoding    : 7	(unsigned)
    <87b>   DW_AT_name        : (indirect string, offset: 0xc4acd): short unsigned int
 <1><87f>: Abbrev Number: 3 (DW_TAG_base_type)
    <880>   DW_AT_byte_size   : 4
    <881>   DW_AT_encoding    : 5	(signed)
    <882>   DW_AT_name        : (indirect string, offset: 0x116c8): long int
 <1><886>: Abbrev Number: 3 (DW_TAG_base_type)
    <887>   DW_AT_byte_size   : 4
    <888>   DW_AT_encoding    : 7	(unsigned)
    <889>   DW_AT_name        : (indirect string, offset: 0x3ed1b): long unsigned int
 <1><88d>: Abbrev Number: 3 (DW_TAG_base_type)
    <88e>   DW_AT_byte_size   : 8
    <88f>   DW_AT_encoding    : 5	(signed)
    <890>   DW_AT_name        : (indirect string, offset: 0x5d971): long long int
 <1><894>: Abbrev Number: 3 (DW_TAG_base_type)
    <895>   DW_AT_byte_size   : 8
    <896>   DW_AT_encoding    : 7	(unsigned)
    <897>   DW_AT_name        : (indirect string, offset: 0x2a770): long long unsigned int
 <1><89b>: Abbrev Number: 4 (DW_TAG_base_type)
    <89c>   DW_AT_byte_size   : 4
    <89d>   DW_AT_encoding    : 5	(signed)
    <89e>   DW_AT_name        : int
 <1><8a2>: Abbrev Number: 3 (DW_TAG_base_type)
    <8a3>   DW_AT_byte_size   : 4
    <8a4>   DW_AT_encoding    : 7	(unsigned)
    <8a5>   DW_AT_name        : (indirect string, offset: 0x10dbb): unsigned int
 <1><8a9>: Abbrev Number: 3 (DW_TAG_base_type)
    <8aa>   DW_AT_byte_size   : 8
    <8ab>   DW_AT_encoding    : 4	(float)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x12ee1): long double
 <1><8b0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <8b1>   DW_AT_byte_size   : 4
    <8b2>   DW_AT_type        : <0x8b6>
 <1><8b6>: Abbrev Number: 3 (DW_TAG_base_type)
    <8b7>   DW_AT_byte_size   : 1
    <8b8>   DW_AT_encoding    : 8	(unsigned char)
    <8b9>   DW_AT_name        : (indirect string, offset: 0x41dd9): char
 <1><8bd>: Abbrev Number: 6 (DW_TAG_const_type)
    <8be>   DW_AT_type        : <0x8b6>
 <1><8c2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <8c3>   DW_AT_byte_size   : 4
    <8c4>   DW_AT_type        : <0x8bd>
 <1><8c8>: Abbrev Number: 2 (DW_TAG_typedef)
    <8c9>   DW_AT_name        : (indirect string, offset: 0xcdef8): int8_t
    <8cd>   DW_AT_decl_file   : 3
    <8ce>   DW_AT_decl_line   : 20
    <8cf>   DW_AT_decl_column : 18
    <8d0>   DW_AT_type        : <0x84b>
 <1><8d4>: Abbrev Number: 2 (DW_TAG_typedef)
    <8d5>   DW_AT_name        : (indirect string, offset: 0xcdf14): int16_t
    <8d9>   DW_AT_decl_file   : 3
    <8da>   DW_AT_decl_line   : 32
    <8db>   DW_AT_decl_column : 19
    <8dc>   DW_AT_type        : <0x865>
 <1><8e0>: Abbrev Number: 3 (DW_TAG_base_type)
    <8e1>   DW_AT_byte_size   : 4
    <8e2>   DW_AT_encoding    : 4	(float)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x2ffb): float
 <1><8e7>: Abbrev Number: 3 (DW_TAG_base_type)
    <8e8>   DW_AT_byte_size   : 8
    <8e9>   DW_AT_encoding    : 4	(float)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x18f15): double
 <1><8ee>: Abbrev Number: 2 (DW_TAG_typedef)
    <8ef>   DW_AT_name        : (indirect string, offset: 0xb19ce): UINT8
    <8f3>   DW_AT_decl_file   : 4
    <8f4>   DW_AT_decl_line   : 61
    <8f5>   DW_AT_decl_column : 23
    <8f6>   DW_AT_type        : <0x85e>
 <1><8fa>: Abbrev Number: 2 (DW_TAG_typedef)
    <8fb>   DW_AT_name        : (indirect string, offset: 0xa25bd): UINT16
    <8ff>   DW_AT_decl_file   : 4
    <900>   DW_AT_decl_line   : 64
    <901>   DW_AT_decl_column : 22
    <902>   DW_AT_type        : <0x8a2>
 <1><906>: Abbrev Number: 7 (DW_TAG_array_type)
    <907>   DW_AT_type        : <0x8e7>
    <90b>   DW_AT_sibling     : <0x916>
 <2><90f>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <910>   DW_AT_type        : <0x8a2>
    <914>   DW_AT_upper_bound : 3
 <2><915>: Abbrev Number: 0
 <1><916>: Abbrev Number: 9 (DW_TAG_variable)
    <917>   DW_AT_name        : (indirect string, offset: 0xcdf78): prev_dat
    <91b>   DW_AT_decl_file   : 1
    <91c>   DW_AT_decl_line   : 4
    <91d>   DW_AT_decl_column : 15
    <91e>   DW_AT_type        : <0x906>
    <922>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><928>: Abbrev Number: 10 (DW_TAG_variable)
    <929>   DW_AT_name        : (indirect string, offset: 0xd3343): flag
    <92d>   DW_AT_decl_file   : 1
    <92e>   DW_AT_decl_line   : 7
    <92f>   DW_AT_decl_column : 6
    <930>   DW_AT_type        : <0x8b6>
    <934>   DW_AT_external    : 1
    <934>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><93a>: Abbrev Number: 7 (DW_TAG_array_type)
    <93b>   DW_AT_type        : <0x8b6>
    <93f>   DW_AT_sibling     : <0x94a>
 <2><943>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <944>   DW_AT_type        : <0x8a2>
    <948>   DW_AT_upper_bound : 10
 <2><949>: Abbrev Number: 0
 <1><94a>: Abbrev Number: 11 (DW_TAG_variable)
    <94b>   DW_AT_name        : _x
    <94e>   DW_AT_decl_file   : 1
    <94f>   DW_AT_decl_line   : 312
    <951>   DW_AT_decl_column : 6
    <952>   DW_AT_type        : <0x93a>
    <956>   DW_AT_external    : 1
    <956>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><95c>: Abbrev Number: 11 (DW_TAG_variable)
    <95d>   DW_AT_name        : _y
    <960>   DW_AT_decl_file   : 1
    <961>   DW_AT_decl_line   : 312
    <963>   DW_AT_decl_column : 14
    <964>   DW_AT_type        : <0x93a>
    <968>   DW_AT_external    : 1
    <968>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><96e>: Abbrev Number: 11 (DW_TAG_variable)
    <96f>   DW_AT_name        : _z
    <972>   DW_AT_decl_file   : 1
    <973>   DW_AT_decl_line   : 312
    <975>   DW_AT_decl_column : 22
    <976>   DW_AT_type        : <0x93a>
    <97a>   DW_AT_external    : 1
    <97a>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><980>: Abbrev Number: 11 (DW_TAG_variable)
    <981>   DW_AT_name        : _w
    <984>   DW_AT_decl_file   : 1
    <985>   DW_AT_decl_line   : 312
    <987>   DW_AT_decl_column : 30
    <988>   DW_AT_type        : <0x93a>
    <98c>   DW_AT_external    : 1
    <98c>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><992>: Abbrev Number: 12 (DW_TAG_subprogram)
    <993>   DW_AT_external    : 1
    <993>   DW_AT_name        : (indirect string, offset: 0x7624): printf
    <997>   DW_AT_decl_file   : 5
    <998>   DW_AT_decl_line   : 200
    <999>   DW_AT_decl_column : 5
    <99a>   DW_AT_prototyped  : 1
    <99a>   DW_AT_type        : <0x89b>
    <99e>   DW_AT_declaration : 1
    <99e>   DW_AT_sibling     : <0x9a9>
 <2><9a2>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9a3>   DW_AT_type        : <0x8c2>
 <2><9a7>: Abbrev Number: 14 (DW_TAG_unspecified_parameters)
 <2><9a8>: Abbrev Number: 0
 <1><9a9>: Abbrev Number: 12 (DW_TAG_subprogram)
    <9aa>   DW_AT_external    : 1
    <9aa>   DW_AT_name        : (indirect string, offset: 0xcdf6b): ret_exponent
    <9ae>   DW_AT_decl_file   : 6
    <9af>   DW_AT_decl_line   : 192
    <9b0>   DW_AT_decl_column : 8
    <9b1>   DW_AT_prototyped  : 1
    <9b1>   DW_AT_type        : <0x8e7>
    <9b5>   DW_AT_declaration : 1
    <9b5>   DW_AT_sibling     : <0x9bf>
 <2><9b9>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9ba>   DW_AT_type        : <0x8ee>
 <2><9be>: Abbrev Number: 0
 <1><9bf>: Abbrev Number: 15 (DW_TAG_subprogram)
    <9c0>   DW_AT_external    : 1
    <9c0>   DW_AT_name        : (indirect string, offset: 0xa7645): error_handler
    <9c4>   DW_AT_decl_file   : 8
    <9c5>   DW_AT_decl_line   : 62
    <9c6>   DW_AT_decl_column : 6
    <9c7>   DW_AT_prototyped  : 1
    <9c7>   DW_AT_declaration : 1
    <9c7>   DW_AT_sibling     : <0x9db>
 <2><9cb>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9cc>   DW_AT_type        : <0x8b0>
 <2><9d0>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9d1>   DW_AT_type        : <0x8fa>
 <2><9d5>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9d6>   DW_AT_type        : <0x8fa>
 <2><9da>: Abbrev Number: 0
 <1><9db>: Abbrev Number: 16 (DW_TAG_subprogram)
    <9dc>   DW_AT_external    : 1
    <9dc>   DW_AT_name        : (indirect string, offset: 0xcdf41): HOST_SF_LIB_VREG_write
    <9e0>   DW_AT_decl_file   : 7
    <9e1>   DW_AT_decl_line   : 460
    <9e3>   DW_AT_decl_column : 7
    <9e4>   DW_AT_prototyped  : 1
    <9e4>   DW_AT_type        : <0x8ee>
    <9e8>   DW_AT_declaration : 1
    <9e8>   DW_AT_sibling     : <0x9f7>
 <2><9ec>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9ed>   DW_AT_type        : <0x8ee>
 <2><9f1>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9f2>   DW_AT_type        : <0x8fa>
 <2><9f6>: Abbrev Number: 0
 <1><9f7>: Abbrev Number: 16 (DW_TAG_subprogram)
    <9f8>   DW_AT_external    : 1
    <9f8>   DW_AT_name        : (indirect string, offset: 0xcdee0): HOST_SF_LIB_VREG_read
    <9fc>   DW_AT_decl_file   : 7
    <9fd>   DW_AT_decl_line   : 459
    <9ff>   DW_AT_decl_column : 7
    <a00>   DW_AT_prototyped  : 1
    <a00>   DW_AT_type        : <0x8ee>
    <a04>   DW_AT_declaration : 1
    <a04>   DW_AT_sibling     : <0xa13>
 <2><a08>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <a09>   DW_AT_type        : <0x8ee>
 <2><a0d>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <a0e>   DW_AT_type        : <0xa13>
 <2><a12>: Abbrev Number: 0
 <1><a13>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a14>   DW_AT_byte_size   : 4
    <a15>   DW_AT_type        : <0x8fa>
 <1><a19>: Abbrev Number: 17 (DW_TAG_subprogram)
    <a1a>   DW_AT_external    : 1
    <a1a>   DW_AT_name        : (indirect string, offset: 0xcdeff): _rawGyro
    <a1e>   DW_AT_decl_file   : 1
    <a1f>   DW_AT_decl_line   : 450
    <a21>   DW_AT_decl_column : 6
    <a22>   DW_AT_low_pc      : 0x0
    <a26>   DW_AT_high_pc     : 0x270
    <a2a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a2c>   DW_AT_GNU_all_tail_call_sites: 1
    <a2c>   DW_AT_sibling     : <0xaa1>
 <2><a30>: Abbrev Number: 18 (DW_TAG_variable)
    <a31>   DW_AT_name        : (indirect string, offset: 0xcdfd2): ucRetStat
    <a35>   DW_AT_decl_file   : 1
    <a36>   DW_AT_decl_line   : 452
    <a38>   DW_AT_decl_column : 8
    <a39>   DW_AT_type        : <0x8ee>
    <a3d>   DW_AT_location    : 2 byte block: 91 57 	(DW_OP_fbreg: -41)
 <2><a40>: Abbrev Number: 18 (DW_TAG_variable)
    <a41>   DW_AT_name        : (indirect string, offset: 0xcdf65): wdata
    <a45>   DW_AT_decl_file   : 1
    <a46>   DW_AT_decl_line   : 453
    <a48>   DW_AT_decl_column : 9
    <a49>   DW_AT_type        : <0x8fa>
    <a4d>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><a50>: Abbrev Number: 18 (DW_TAG_variable)
    <a51>   DW_AT_name        : (indirect string, offset: 0xcdf2c): dDataX
    <a55>   DW_AT_decl_file   : 1
    <a56>   DW_AT_decl_line   : 454
    <a58>   DW_AT_decl_column : 9
    <a59>   DW_AT_type        : <0x8e7>
    <a5d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><a60>: Abbrev Number: 18 (DW_TAG_variable)
    <a61>   DW_AT_name        : (indirect string, offset: 0xcdf33): dDataY
    <a65>   DW_AT_decl_file   : 1
    <a66>   DW_AT_decl_line   : 454
    <a68>   DW_AT_decl_column : 21
    <a69>   DW_AT_type        : <0x8e7>
    <a6d>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a70>: Abbrev Number: 18 (DW_TAG_variable)
    <a71>   DW_AT_name        : (indirect string, offset: 0xcdf3a): dDataZ
    <a75>   DW_AT_decl_file   : 1
    <a76>   DW_AT_decl_line   : 454
    <a78>   DW_AT_decl_column : 33
    <a79>   DW_AT_type        : <0x8e7>
    <a7d>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><a80>: Abbrev Number: 18 (DW_TAG_variable)
    <a81>   DW_AT_name        : (indirect string, offset: 0xcdf89): dMult
    <a85>   DW_AT_decl_file   : 1
    <a86>   DW_AT_decl_line   : 455
    <a88>   DW_AT_decl_column : 9
    <a89>   DW_AT_type        : <0x8e7>
    <a8d>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><a90>: Abbrev Number: 18 (DW_TAG_variable)
    <a91>   DW_AT_name        : (indirect string, offset: 0xcdf1c): wRMWdata
    <a95>   DW_AT_decl_file   : 1
    <a96>   DW_AT_decl_line   : 456
    <a98>   DW_AT_decl_column : 9
    <a99>   DW_AT_type        : <0x8fa>
    <a9d>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><aa0>: Abbrev Number: 0
 <1><aa1>: Abbrev Number: 17 (DW_TAG_subprogram)
    <aa2>   DW_AT_external    : 1
    <aa2>   DW_AT_name        : (indirect string, offset: 0xcdf97): _rawMagnet
    <aa6>   DW_AT_decl_file   : 1
    <aa7>   DW_AT_decl_line   : 384
    <aa9>   DW_AT_decl_column : 6
    <aaa>   DW_AT_low_pc      : 0x0
    <aae>   DW_AT_high_pc     : 0x268
    <ab2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ab4>   DW_AT_GNU_all_tail_call_sites: 1
    <ab4>   DW_AT_sibling     : <0xb29>
 <2><ab8>: Abbrev Number: 18 (DW_TAG_variable)
    <ab9>   DW_AT_name        : (indirect string, offset: 0xcdfd2): ucRetStat
    <abd>   DW_AT_decl_file   : 1
    <abe>   DW_AT_decl_line   : 385
    <ac0>   DW_AT_decl_column : 8
    <ac1>   DW_AT_type        : <0x8ee>
    <ac5>   DW_AT_location    : 2 byte block: 91 57 	(DW_OP_fbreg: -41)
 <2><ac8>: Abbrev Number: 18 (DW_TAG_variable)
    <ac9>   DW_AT_name        : (indirect string, offset: 0xcdf65): wdata
    <acd>   DW_AT_decl_file   : 1
    <ace>   DW_AT_decl_line   : 386
    <ad0>   DW_AT_decl_column : 9
    <ad1>   DW_AT_type        : <0x8fa>
    <ad5>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><ad8>: Abbrev Number: 18 (DW_TAG_variable)
    <ad9>   DW_AT_name        : (indirect string, offset: 0xcdf2c): dDataX
    <add>   DW_AT_decl_file   : 1
    <ade>   DW_AT_decl_line   : 387
    <ae0>   DW_AT_decl_column : 9
    <ae1>   DW_AT_type        : <0x8e7>
    <ae5>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><ae8>: Abbrev Number: 18 (DW_TAG_variable)
    <ae9>   DW_AT_name        : (indirect string, offset: 0xcdf33): dDataY
    <aed>   DW_AT_decl_file   : 1
    <aee>   DW_AT_decl_line   : 387
    <af0>   DW_AT_decl_column : 21
    <af1>   DW_AT_type        : <0x8e7>
    <af5>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><af8>: Abbrev Number: 18 (DW_TAG_variable)
    <af9>   DW_AT_name        : (indirect string, offset: 0xcdf3a): dDataZ
    <afd>   DW_AT_decl_file   : 1
    <afe>   DW_AT_decl_line   : 387
    <b00>   DW_AT_decl_column : 33
    <b01>   DW_AT_type        : <0x8e7>
    <b05>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><b08>: Abbrev Number: 18 (DW_TAG_variable)
    <b09>   DW_AT_name        : (indirect string, offset: 0xcdf89): dMult
    <b0d>   DW_AT_decl_file   : 1
    <b0e>   DW_AT_decl_line   : 388
    <b10>   DW_AT_decl_column : 9
    <b11>   DW_AT_type        : <0x8e7>
    <b15>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><b18>: Abbrev Number: 18 (DW_TAG_variable)
    <b19>   DW_AT_name        : (indirect string, offset: 0xcdf1c): wRMWdata
    <b1d>   DW_AT_decl_file   : 1
    <b1e>   DW_AT_decl_line   : 389
    <b20>   DW_AT_decl_column : 9
    <b21>   DW_AT_type        : <0x8fa>
    <b25>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><b28>: Abbrev Number: 0
 <1><b29>: Abbrev Number: 17 (DW_TAG_subprogram)
    <b2a>   DW_AT_external    : 1
    <b2a>   DW_AT_name        : (indirect string, offset: 0xcdf08): _rawAccel
    <b2e>   DW_AT_decl_file   : 1
    <b2f>   DW_AT_decl_line   : 314
    <b31>   DW_AT_decl_column : 6
    <b32>   DW_AT_low_pc      : 0x0
    <b36>   DW_AT_high_pc     : 0x268
    <b3a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b3c>   DW_AT_GNU_all_tail_call_sites: 1
    <b3c>   DW_AT_sibling     : <0xbb1>
 <2><b40>: Abbrev Number: 18 (DW_TAG_variable)
    <b41>   DW_AT_name        : (indirect string, offset: 0xcdfd2): ucRetStat
    <b45>   DW_AT_decl_file   : 1
    <b46>   DW_AT_decl_line   : 315
    <b48>   DW_AT_decl_column : 8
    <b49>   DW_AT_type        : <0x8ee>
    <b4d>   DW_AT_location    : 2 byte block: 91 57 	(DW_OP_fbreg: -41)
 <2><b50>: Abbrev Number: 18 (DW_TAG_variable)
    <b51>   DW_AT_name        : (indirect string, offset: 0xcdf65): wdata
    <b55>   DW_AT_decl_file   : 1
    <b56>   DW_AT_decl_line   : 316
    <b58>   DW_AT_decl_column : 9
    <b59>   DW_AT_type        : <0x8fa>
    <b5d>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><b60>: Abbrev Number: 18 (DW_TAG_variable)
    <b61>   DW_AT_name        : (indirect string, offset: 0xcdf2c): dDataX
    <b65>   DW_AT_decl_file   : 1
    <b66>   DW_AT_decl_line   : 317
    <b68>   DW_AT_decl_column : 9
    <b69>   DW_AT_type        : <0x8e7>
    <b6d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><b70>: Abbrev Number: 18 (DW_TAG_variable)
    <b71>   DW_AT_name        : (indirect string, offset: 0xcdf33): dDataY
    <b75>   DW_AT_decl_file   : 1
    <b76>   DW_AT_decl_line   : 317
    <b78>   DW_AT_decl_column : 21
    <b79>   DW_AT_type        : <0x8e7>
    <b7d>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><b80>: Abbrev Number: 18 (DW_TAG_variable)
    <b81>   DW_AT_name        : (indirect string, offset: 0xcdf3a): dDataZ
    <b85>   DW_AT_decl_file   : 1
    <b86>   DW_AT_decl_line   : 317
    <b88>   DW_AT_decl_column : 33
    <b89>   DW_AT_type        : <0x8e7>
    <b8d>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><b90>: Abbrev Number: 18 (DW_TAG_variable)
    <b91>   DW_AT_name        : (indirect string, offset: 0xcdf89): dMult
    <b95>   DW_AT_decl_file   : 1
    <b96>   DW_AT_decl_line   : 318
    <b98>   DW_AT_decl_column : 9
    <b99>   DW_AT_type        : <0x8e7>
    <b9d>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><ba0>: Abbrev Number: 18 (DW_TAG_variable)
    <ba1>   DW_AT_name        : (indirect string, offset: 0xcdf1c): wRMWdata
    <ba5>   DW_AT_decl_file   : 1
    <ba6>   DW_AT_decl_line   : 319
    <ba8>   DW_AT_decl_column : 9
    <ba9>   DW_AT_type        : <0x8fa>
    <bad>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><bb0>: Abbrev Number: 0
 <1><bb1>: Abbrev Number: 19 (DW_TAG_subprogram)
    <bb2>   DW_AT_external    : 1
    <bb2>   DW_AT_name        : (indirect string, offset: 0xcdf81): _inclin
    <bb6>   DW_AT_decl_file   : 1
    <bb7>   DW_AT_decl_line   : 252
    <bb8>   DW_AT_decl_column : 6
    <bb9>   DW_AT_low_pc      : 0x0
    <bbd>   DW_AT_high_pc     : 0x24c
    <bc1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bc3>   DW_AT_GNU_all_tail_call_sites: 1
    <bc3>   DW_AT_sibling     : <0xc33>
 <2><bc7>: Abbrev Number: 9 (DW_TAG_variable)
    <bc8>   DW_AT_name        : (indirect string, offset: 0xcdfd2): ucRetStat
    <bcc>   DW_AT_decl_file   : 1
    <bcd>   DW_AT_decl_line   : 253
    <bce>   DW_AT_decl_column : 8
    <bcf>   DW_AT_type        : <0x8ee>
    <bd3>   DW_AT_location    : 2 byte block: 91 57 	(DW_OP_fbreg: -41)
 <2><bd6>: Abbrev Number: 9 (DW_TAG_variable)
    <bd7>   DW_AT_name        : (indirect string, offset: 0xcdf65): wdata
    <bdb>   DW_AT_decl_file   : 1
    <bdc>   DW_AT_decl_line   : 254
    <bdd>   DW_AT_decl_column : 9
    <bde>   DW_AT_type        : <0x8fa>
    <be2>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><be5>: Abbrev Number: 9 (DW_TAG_variable)
    <be6>   DW_AT_name        : (indirect string, offset: 0xcdf2c): dDataX
    <bea>   DW_AT_decl_file   : 1
    <beb>   DW_AT_decl_line   : 255
    <bec>   DW_AT_decl_column : 9
    <bed>   DW_AT_type        : <0x8e7>
    <bf1>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><bf4>: Abbrev Number: 9 (DW_TAG_variable)
    <bf5>   DW_AT_name        : (indirect string, offset: 0xcdf33): dDataY
    <bf9>   DW_AT_decl_file   : 1
    <bfa>   DW_AT_decl_line   : 255
    <bfb>   DW_AT_decl_column : 21
    <bfc>   DW_AT_type        : <0x8e7>
    <c00>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><c03>: Abbrev Number: 9 (DW_TAG_variable)
    <c04>   DW_AT_name        : (indirect string, offset: 0xcdf3a): dDataZ
    <c08>   DW_AT_decl_file   : 1
    <c09>   DW_AT_decl_line   : 255
    <c0a>   DW_AT_decl_column : 33
    <c0b>   DW_AT_type        : <0x8e7>
    <c0f>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><c12>: Abbrev Number: 18 (DW_TAG_variable)
    <c13>   DW_AT_name        : (indirect string, offset: 0xcdf89): dMult
    <c17>   DW_AT_decl_file   : 1
    <c18>   DW_AT_decl_line   : 256
    <c1a>   DW_AT_decl_column : 9
    <c1b>   DW_AT_type        : <0x8e7>
    <c1f>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><c22>: Abbrev Number: 18 (DW_TAG_variable)
    <c23>   DW_AT_name        : (indirect string, offset: 0xcdf1c): wRMWdata
    <c27>   DW_AT_decl_file   : 1
    <c28>   DW_AT_decl_line   : 257
    <c2a>   DW_AT_decl_column : 9
    <c2b>   DW_AT_type        : <0x8fa>
    <c2f>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><c32>: Abbrev Number: 0
 <1><c33>: Abbrev Number: 19 (DW_TAG_subprogram)
    <c34>   DW_AT_external    : 1
    <c34>   DW_AT_name        : (indirect string, offset: 0xcdf8f): _orient
    <c38>   DW_AT_decl_file   : 1
    <c39>   DW_AT_decl_line   : 184
    <c3a>   DW_AT_decl_column : 6
    <c3b>   DW_AT_low_pc      : 0x0
    <c3f>   DW_AT_high_pc     : 0x2b4
    <c43>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c45>   DW_AT_GNU_all_tail_call_sites: 1
    <c45>   DW_AT_sibling     : <0xcc2>
 <2><c49>: Abbrev Number: 9 (DW_TAG_variable)
    <c4a>   DW_AT_name        : (indirect string, offset: 0xcdfd2): ucRetStat
    <c4e>   DW_AT_decl_file   : 1
    <c4f>   DW_AT_decl_line   : 185
    <c50>   DW_AT_decl_column : 8
    <c51>   DW_AT_type        : <0x8ee>
    <c55>   DW_AT_location    : 2 byte block: 91 4f 	(DW_OP_fbreg: -49)
 <2><c58>: Abbrev Number: 9 (DW_TAG_variable)
    <c59>   DW_AT_name        : (indirect string, offset: 0xcdf65): wdata
    <c5d>   DW_AT_decl_file   : 1
    <c5e>   DW_AT_decl_line   : 186
    <c5f>   DW_AT_decl_column : 9
    <c60>   DW_AT_type        : <0x8fa>
    <c64>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><c67>: Abbrev Number: 9 (DW_TAG_variable)
    <c68>   DW_AT_name        : (indirect string, offset: 0xcdf2c): dDataX
    <c6c>   DW_AT_decl_file   : 1
    <c6d>   DW_AT_decl_line   : 187
    <c6e>   DW_AT_decl_column : 9
    <c6f>   DW_AT_type        : <0x8e7>
    <c73>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><c76>: Abbrev Number: 9 (DW_TAG_variable)
    <c77>   DW_AT_name        : (indirect string, offset: 0xcdf33): dDataY
    <c7b>   DW_AT_decl_file   : 1
    <c7c>   DW_AT_decl_line   : 187
    <c7d>   DW_AT_decl_column : 21
    <c7e>   DW_AT_type        : <0x8e7>
    <c82>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><c85>: Abbrev Number: 9 (DW_TAG_variable)
    <c86>   DW_AT_name        : (indirect string, offset: 0xcdf3a): dDataZ
    <c8a>   DW_AT_decl_file   : 1
    <c8b>   DW_AT_decl_line   : 187
    <c8c>   DW_AT_decl_column : 33
    <c8d>   DW_AT_type        : <0x8e7>
    <c91>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><c94>: Abbrev Number: 9 (DW_TAG_variable)
    <c95>   DW_AT_name        : (indirect string, offset: 0xcdf25): dDataW
    <c99>   DW_AT_decl_file   : 1
    <c9a>   DW_AT_decl_line   : 187
    <c9b>   DW_AT_decl_column : 45
    <c9c>   DW_AT_type        : <0x8e7>
    <ca0>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><ca3>: Abbrev Number: 9 (DW_TAG_variable)
    <ca4>   DW_AT_name        : (indirect string, offset: 0xcdf89): dMult
    <ca8>   DW_AT_decl_file   : 1
    <ca9>   DW_AT_decl_line   : 188
    <caa>   DW_AT_decl_column : 9
    <cab>   DW_AT_type        : <0x8e7>
    <caf>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><cb2>: Abbrev Number: 9 (DW_TAG_variable)
    <cb3>   DW_AT_name        : (indirect string, offset: 0xcdf1c): wRMWdata
    <cb7>   DW_AT_decl_file   : 1
    <cb8>   DW_AT_decl_line   : 189
    <cb9>   DW_AT_decl_column : 9
    <cba>   DW_AT_type        : <0x8fa>
    <cbe>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><cc1>: Abbrev Number: 0
 <1><cc2>: Abbrev Number: 19 (DW_TAG_subprogram)
    <cc3>   DW_AT_external    : 1
    <cc3>   DW_AT_name        : (indirect string, offset: 0xcdfc9): _compass
    <cc7>   DW_AT_decl_file   : 1
    <cc8>   DW_AT_decl_line   : 136
    <cc9>   DW_AT_decl_column : 6
    <cca>   DW_AT_low_pc      : 0x0
    <cce>   DW_AT_high_pc     : 0x178
    <cd2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cd4>   DW_AT_GNU_all_tail_call_sites: 1
    <cd4>   DW_AT_sibling     : <0xd24>
 <2><cd8>: Abbrev Number: 9 (DW_TAG_variable)
    <cd9>   DW_AT_name        : (indirect string, offset: 0xcdfd2): ucRetStat
    <cdd>   DW_AT_decl_file   : 1
    <cde>   DW_AT_decl_line   : 137
    <cdf>   DW_AT_decl_column : 8
    <ce0>   DW_AT_type        : <0x8ee>
    <ce4>   DW_AT_location    : 2 byte block: 91 67 	(DW_OP_fbreg: -25)
 <2><ce7>: Abbrev Number: 9 (DW_TAG_variable)
    <ce8>   DW_AT_name        : (indirect string, offset: 0xcdf65): wdata
    <cec>   DW_AT_decl_file   : 1
    <ced>   DW_AT_decl_line   : 138
    <cee>   DW_AT_decl_column : 9
    <cef>   DW_AT_type        : <0x8fa>
    <cf3>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><cf6>: Abbrev Number: 9 (DW_TAG_variable)
    <cf7>   DW_AT_name        : (indirect string, offset: 0xcdf2c): dDataX
    <cfb>   DW_AT_decl_file   : 1
    <cfc>   DW_AT_decl_line   : 139
    <cfd>   DW_AT_decl_column : 9
    <cfe>   DW_AT_type        : <0x8e7>
    <d02>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><d05>: Abbrev Number: 9 (DW_TAG_variable)
    <d06>   DW_AT_name        : (indirect string, offset: 0xcdf89): dMult
    <d0a>   DW_AT_decl_file   : 1
    <d0b>   DW_AT_decl_line   : 140
    <d0c>   DW_AT_decl_column : 9
    <d0d>   DW_AT_type        : <0x8e7>
    <d11>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><d14>: Abbrev Number: 9 (DW_TAG_variable)
    <d15>   DW_AT_name        : (indirect string, offset: 0xcdf1c): wRMWdata
    <d19>   DW_AT_decl_file   : 1
    <d1a>   DW_AT_decl_line   : 141
    <d1b>   DW_AT_decl_column : 9
    <d1c>   DW_AT_type        : <0x8fa>
    <d20>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><d23>: Abbrev Number: 0
 <1><d24>: Abbrev Number: 19 (DW_TAG_subprogram)
    <d25>   DW_AT_external    : 1
    <d25>   DW_AT_name        : (indirect string, offset: 0xcdf5f): _gyro
    <d29>   DW_AT_decl_file   : 1
    <d2a>   DW_AT_decl_line   : 72
    <d2b>   DW_AT_decl_column : 6
    <d2c>   DW_AT_low_pc      : 0x8000fb4
    <d30>   DW_AT_high_pc     : 0x284
    <d34>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d36>   DW_AT_GNU_all_tail_call_sites: 1
    <d36>   DW_AT_sibling     : <0xda4>
 <2><d3a>: Abbrev Number: 9 (DW_TAG_variable)
    <d3b>   DW_AT_name        : (indirect string, offset: 0xcdfd2): ucRetStat
    <d3f>   DW_AT_decl_file   : 1
    <d40>   DW_AT_decl_line   : 73
    <d41>   DW_AT_decl_column : 8
    <d42>   DW_AT_type        : <0x8ee>
    <d46>   DW_AT_location    : 2 byte block: 91 57 	(DW_OP_fbreg: -41)
 <2><d49>: Abbrev Number: 9 (DW_TAG_variable)
    <d4a>   DW_AT_name        : (indirect string, offset: 0xcdf65): wdata
    <d4e>   DW_AT_decl_file   : 1
    <d4f>   DW_AT_decl_line   : 74
    <d50>   DW_AT_decl_column : 9
    <d51>   DW_AT_type        : <0x8fa>
    <d55>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><d58>: Abbrev Number: 9 (DW_TAG_variable)
    <d59>   DW_AT_name        : (indirect string, offset: 0xcdf2c): dDataX
    <d5d>   DW_AT_decl_file   : 1
    <d5e>   DW_AT_decl_line   : 75
    <d5f>   DW_AT_decl_column : 9
    <d60>   DW_AT_type        : <0x8e7>
    <d64>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><d67>: Abbrev Number: 9 (DW_TAG_variable)
    <d68>   DW_AT_name        : (indirect string, offset: 0xcdf33): dDataY
    <d6c>   DW_AT_decl_file   : 1
    <d6d>   DW_AT_decl_line   : 75
    <d6e>   DW_AT_decl_column : 21
    <d6f>   DW_AT_type        : <0x8e7>
    <d73>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><d76>: Abbrev Number: 9 (DW_TAG_variable)
    <d77>   DW_AT_name        : (indirect string, offset: 0xcdf3a): dDataZ
    <d7b>   DW_AT_decl_file   : 1
    <d7c>   DW_AT_decl_line   : 75
    <d7d>   DW_AT_decl_column : 33
    <d7e>   DW_AT_type        : <0x8e7>
    <d82>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><d85>: Abbrev Number: 9 (DW_TAG_variable)
    <d86>   DW_AT_name        : (indirect string, offset: 0xcdf89): dMult
    <d8a>   DW_AT_decl_file   : 1
    <d8b>   DW_AT_decl_line   : 76
    <d8c>   DW_AT_decl_column : 9
    <d8d>   DW_AT_type        : <0x8e7>
    <d91>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><d94>: Abbrev Number: 9 (DW_TAG_variable)
    <d95>   DW_AT_name        : (indirect string, offset: 0xcdf1c): wRMWdata
    <d99>   DW_AT_decl_file   : 1
    <d9a>   DW_AT_decl_line   : 77
    <d9b>   DW_AT_decl_column : 9
    <d9c>   DW_AT_type        : <0x8fa>
    <da0>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><da3>: Abbrev Number: 0
 <1><da4>: Abbrev Number: 20 (DW_TAG_subprogram)
    <da5>   DW_AT_external    : 1
    <da5>   DW_AT_name        : (indirect string, offset: 0xcdf58): _accel
    <da9>   DW_AT_decl_file   : 1
    <daa>   DW_AT_decl_line   : 11
    <dab>   DW_AT_decl_column : 6
    <dac>   DW_AT_low_pc      : 0x0
    <db0>   DW_AT_high_pc     : 0x24c
    <db4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <db6>   DW_AT_GNU_all_tail_call_sites: 1
 <2><db6>: Abbrev Number: 9 (DW_TAG_variable)
    <db7>   DW_AT_name        : (indirect string, offset: 0xcdfd2): ucRetStat
    <dbb>   DW_AT_decl_file   : 1
    <dbc>   DW_AT_decl_line   : 12
    <dbd>   DW_AT_decl_column : 8
    <dbe>   DW_AT_type        : <0x8ee>
    <dc2>   DW_AT_location    : 2 byte block: 91 57 	(DW_OP_fbreg: -41)
 <2><dc5>: Abbrev Number: 9 (DW_TAG_variable)
    <dc6>   DW_AT_name        : (indirect string, offset: 0xcdf65): wdata
    <dca>   DW_AT_decl_file   : 1
    <dcb>   DW_AT_decl_line   : 13
    <dcc>   DW_AT_decl_column : 9
    <dcd>   DW_AT_type        : <0x8fa>
    <dd1>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><dd4>: Abbrev Number: 9 (DW_TAG_variable)
    <dd5>   DW_AT_name        : (indirect string, offset: 0xcdf2c): dDataX
    <dd9>   DW_AT_decl_file   : 1
    <dda>   DW_AT_decl_line   : 14
    <ddb>   DW_AT_decl_column : 9
    <ddc>   DW_AT_type        : <0x8e7>
    <de0>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><de3>: Abbrev Number: 9 (DW_TAG_variable)
    <de4>   DW_AT_name        : (indirect string, offset: 0xcdf33): dDataY
    <de8>   DW_AT_decl_file   : 1
    <de9>   DW_AT_decl_line   : 14
    <dea>   DW_AT_decl_column : 21
    <deb>   DW_AT_type        : <0x8e7>
    <def>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><df2>: Abbrev Number: 9 (DW_TAG_variable)
    <df3>   DW_AT_name        : (indirect string, offset: 0xcdf3a): dDataZ
    <df7>   DW_AT_decl_file   : 1
    <df8>   DW_AT_decl_line   : 14
    <df9>   DW_AT_decl_column : 33
    <dfa>   DW_AT_type        : <0x8e7>
    <dfe>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><e01>: Abbrev Number: 9 (DW_TAG_variable)
    <e02>   DW_AT_name        : (indirect string, offset: 0xcdf89): dMult
    <e06>   DW_AT_decl_file   : 1
    <e07>   DW_AT_decl_line   : 15
    <e08>   DW_AT_decl_column : 9
    <e09>   DW_AT_type        : <0x8e7>
    <e0d>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><e10>: Abbrev Number: 9 (DW_TAG_variable)
    <e11>   DW_AT_name        : (indirect string, offset: 0xcdf1c): wRMWdata
    <e15>   DW_AT_decl_file   : 1
    <e16>   DW_AT_decl_line   : 16
    <e17>   DW_AT_decl_column : 9
    <e18>   DW_AT_type        : <0x8fa>
    <e1c>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><e1f>: Abbrev Number: 0
 <1><e20>: Abbrev Number: 0
  Compilation Unit @ offset 0xe21:
   Length:        0xfd5 (32-bit)
   Version:       4
   Abbrev Offset: 0x32c
   Pointer Size:  4
 <0><e2c>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <e2d>   DW_AT_producer    : (indirect string, offset: 0x36c1b): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <e31>   DW_AT_language    : 12	(ANSI C99)
    <e32>   DW_AT_name        : (indirect string, offset: 0xce3ad): ../Core/MikroSDK-ExampleCode/sf.c
    <e36>   DW_AT_comp_dir    : (indirect string, offset: 0x16b2f): C:/Users/pjura/Desktop/dev/stm32/3d-motion-debug/Debug
    <e3a>   DW_AT_ranges      : 0x60
    <e3e>   DW_AT_low_pc      : 0x0
    <e42>   DW_AT_stmt_list   : 0x1b35
    <e46>   DW_AT_GNU_macros  : 0x14bd
 <1><e4a>: Abbrev Number: 2 (DW_TAG_base_type)
    <e4b>   DW_AT_byte_size   : 1
    <e4c>   DW_AT_encoding    : 6	(signed char)
    <e4d>   DW_AT_name        : (indirect string, offset: 0x66e2c): signed char
 <1><e51>: Abbrev Number: 2 (DW_TAG_base_type)
    <e52>   DW_AT_byte_size   : 1
    <e53>   DW_AT_encoding    : 8	(unsigned char)
    <e54>   DW_AT_name        : (indirect string, offset: 0xc6326): unsigned char
 <1><e58>: Abbrev Number: 3 (DW_TAG_typedef)
    <e59>   DW_AT_name        : (indirect string, offset: 0xcdf12): __int16_t
    <e5d>   DW_AT_decl_file   : 2
    <e5e>   DW_AT_decl_line   : 55
    <e5f>   DW_AT_decl_column : 24
    <e60>   DW_AT_type        : <0xe64>
 <1><e64>: Abbrev Number: 2 (DW_TAG_base_type)
    <e65>   DW_AT_byte_size   : 2
    <e66>   DW_AT_encoding    : 5	(signed)
    <e67>   DW_AT_name        : (indirect string, offset: 0x989af): short int
 <1><e6b>: Abbrev Number: 2 (DW_TAG_base_type)
    <e6c>   DW_AT_byte_size   : 2
    <e6d>   DW_AT_encoding    : 7	(unsigned)
    <e6e>   DW_AT_name        : (indirect string, offset: 0xc4acd): short unsigned int
 <1><e72>: Abbrev Number: 2 (DW_TAG_base_type)
    <e73>   DW_AT_byte_size   : 4
    <e74>   DW_AT_encoding    : 5	(signed)
    <e75>   DW_AT_name        : (indirect string, offset: 0x116c8): long int
 <1><e79>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7a>   DW_AT_byte_size   : 4
    <e7b>   DW_AT_encoding    : 7	(unsigned)
    <e7c>   DW_AT_name        : (indirect string, offset: 0x3ed1b): long unsigned int
 <1><e80>: Abbrev Number: 2 (DW_TAG_base_type)
    <e81>   DW_AT_byte_size   : 8
    <e82>   DW_AT_encoding    : 5	(signed)
    <e83>   DW_AT_name        : (indirect string, offset: 0x5d971): long long int
 <1><e87>: Abbrev Number: 2 (DW_TAG_base_type)
    <e88>   DW_AT_byte_size   : 8
    <e89>   DW_AT_encoding    : 7	(unsigned)
    <e8a>   DW_AT_name        : (indirect string, offset: 0x2a770): long long unsigned int
 <1><e8e>: Abbrev Number: 4 (DW_TAG_base_type)
    <e8f>   DW_AT_byte_size   : 4
    <e90>   DW_AT_encoding    : 5	(signed)
    <e91>   DW_AT_name        : int
 <1><e95>: Abbrev Number: 2 (DW_TAG_base_type)
    <e96>   DW_AT_byte_size   : 4
    <e97>   DW_AT_encoding    : 7	(unsigned)
    <e98>   DW_AT_name        : (indirect string, offset: 0x10dbb): unsigned int
 <1><e9c>: Abbrev Number: 3 (DW_TAG_typedef)
    <e9d>   DW_AT_name        : (indirect string, offset: 0x8c27): size_t
    <ea1>   DW_AT_decl_file   : 3
    <ea2>   DW_AT_decl_line   : 209
    <ea3>   DW_AT_decl_column : 23
    <ea4>   DW_AT_type        : <0xe95>
 <1><ea8>: Abbrev Number: 2 (DW_TAG_base_type)
    <ea9>   DW_AT_byte_size   : 8
    <eaa>   DW_AT_encoding    : 4	(float)
    <eab>   DW_AT_name        : (indirect string, offset: 0x12ee1): long double
 <1><eaf>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <eb0>   DW_AT_byte_size   : 4
 <1><eb1>: Abbrev Number: 2 (DW_TAG_base_type)
    <eb2>   DW_AT_byte_size   : 1
    <eb3>   DW_AT_encoding    : 8	(unsigned char)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x41dd9): char
 <1><eb8>: Abbrev Number: 3 (DW_TAG_typedef)
    <eb9>   DW_AT_name        : (indirect string, offset: 0xcdf14): int16_t
    <ebd>   DW_AT_decl_file   : 4
    <ebe>   DW_AT_decl_line   : 32
    <ebf>   DW_AT_decl_column : 19
    <ec0>   DW_AT_type        : <0xe58>
 <1><ec4>: Abbrev Number: 2 (DW_TAG_base_type)
    <ec5>   DW_AT_byte_size   : 4
    <ec6>   DW_AT_encoding    : 4	(float)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x2ffb): float
 <1><ecb>: Abbrev Number: 2 (DW_TAG_base_type)
    <ecc>   DW_AT_byte_size   : 8
    <ecd>   DW_AT_encoding    : 4	(float)
    <ece>   DW_AT_name        : (indirect string, offset: 0x18f15): double
 <1><ed2>: Abbrev Number: 3 (DW_TAG_typedef)
    <ed3>   DW_AT_name        : (indirect string, offset: 0xb19ce): UINT8
    <ed7>   DW_AT_decl_file   : 5
    <ed8>   DW_AT_decl_line   : 61
    <ed9>   DW_AT_decl_column : 23
    <eda>   DW_AT_type        : <0xe51>
 <1><ede>: Abbrev Number: 3 (DW_TAG_typedef)
    <edf>   DW_AT_name        : (indirect string, offset: 0x89e90): BOOL
    <ee3>   DW_AT_decl_file   : 5
    <ee4>   DW_AT_decl_line   : 62
    <ee5>   DW_AT_decl_column : 23
    <ee6>   DW_AT_type        : <0xe51>
 <1><eea>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <eeb>   DW_AT_type        : <0xede>
 <1><eef>: Abbrev Number: 3 (DW_TAG_typedef)
    <ef0>   DW_AT_name        : (indirect string, offset: 0xa25bd): UINT16
    <ef4>   DW_AT_decl_file   : 5
    <ef5>   DW_AT_decl_line   : 64
    <ef6>   DW_AT_decl_column : 22
    <ef7>   DW_AT_type        : <0xe95>
 <1><efb>: Abbrev Number: 7 (DW_TAG_structure_type)
    <efc>   DW_AT_name        : (indirect string, offset: 0xce16e): SENSOR_HUB_CONFIG
    <f00>   DW_AT_byte_size   : 4
    <f01>   DW_AT_decl_file   : 6
    <f02>   DW_AT_decl_line   : 114
    <f03>   DW_AT_decl_column : 8
    <f04>   DW_AT_sibling     : <0xfe9>
 <2><f08>: Abbrev Number: 8 (DW_TAG_member)
    <f09>   DW_AT_name        : (indirect string, offset: 0xce3a6): SHwake
    <f0d>   DW_AT_decl_file   : 6
    <f0e>   DW_AT_decl_line   : 116
    <f0f>   DW_AT_decl_column : 14
    <f10>   DW_AT_type        : <0xe95>
    <f14>   DW_AT_byte_size   : 4
    <f15>   DW_AT_bit_size    : 1
    <f16>   DW_AT_bit_offset  : 31
    <f17>   DW_AT_data_member_location: 0
 <2><f18>: Abbrev Number: 8 (DW_TAG_member)
    <f19>   DW_AT_name        : (indirect string, offset: 0xce069): sleep
    <f1d>   DW_AT_decl_file   : 6
    <f1e>   DW_AT_decl_line   : 117
    <f1f>   DW_AT_decl_column : 14
    <f20>   DW_AT_type        : <0xe95>
    <f24>   DW_AT_byte_size   : 4
    <f25>   DW_AT_bit_size    : 1
    <f26>   DW_AT_bit_offset  : 30
    <f27>   DW_AT_data_member_location: 0
 <2><f28>: Abbrev Number: 8 (DW_TAG_member)
    <f29>   DW_AT_name        : (indirect string, offset: 0xce2fe): SHstart
    <f2d>   DW_AT_decl_file   : 6
    <f2e>   DW_AT_decl_line   : 118
    <f2f>   DW_AT_decl_column : 14
    <f30>   DW_AT_type        : <0xe95>
    <f34>   DW_AT_byte_size   : 4
    <f35>   DW_AT_bit_size    : 1
    <f36>   DW_AT_bit_offset  : 29
    <f37>   DW_AT_data_member_location: 0
 <2><f38>: Abbrev Number: 8 (DW_TAG_member)
    <f39>   DW_AT_name        : (indirect string, offset: 0xce1e4): reset
    <f3d>   DW_AT_decl_file   : 6
    <f3e>   DW_AT_decl_line   : 119
    <f3f>   DW_AT_decl_column : 14
    <f40>   DW_AT_type        : <0xe95>
    <f44>   DW_AT_byte_size   : 4
    <f45>   DW_AT_bit_size    : 1
    <f46>   DW_AT_bit_offset  : 28
    <f47>   DW_AT_data_member_location: 0
 <2><f48>: Abbrev Number: 8 (DW_TAG_member)
    <f49>   DW_AT_name        : (indirect string, offset: 0xce5c4): AccelEnable
    <f4d>   DW_AT_decl_file   : 6
    <f4e>   DW_AT_decl_line   : 120
    <f4f>   DW_AT_decl_column : 14
    <f50>   DW_AT_type        : <0xe95>
    <f54>   DW_AT_byte_size   : 4
    <f55>   DW_AT_bit_size    : 1
    <f56>   DW_AT_bit_offset  : 27
    <f57>   DW_AT_data_member_location: 0
 <2><f58>: Abbrev Number: 8 (DW_TAG_member)
    <f59>   DW_AT_name        : (indirect string, offset: 0xce0ee): GyroEnable
    <f5d>   DW_AT_decl_file   : 6
    <f5e>   DW_AT_decl_line   : 121
    <f5f>   DW_AT_decl_column : 14
    <f60>   DW_AT_type        : <0xe95>
    <f64>   DW_AT_byte_size   : 4
    <f65>   DW_AT_bit_size    : 1
    <f66>   DW_AT_bit_offset  : 26
    <f67>   DW_AT_data_member_location: 0
 <2><f68>: Abbrev Number: 8 (DW_TAG_member)
    <f69>   DW_AT_name        : (indirect string, offset: 0xce447): CmpEnable
    <f6d>   DW_AT_decl_file   : 6
    <f6e>   DW_AT_decl_line   : 122
    <f6f>   DW_AT_decl_column : 14
    <f70>   DW_AT_type        : <0xe95>
    <f74>   DW_AT_byte_size   : 4
    <f75>   DW_AT_bit_size    : 1
    <f76>   DW_AT_bit_offset  : 25
    <f77>   DW_AT_data_member_location: 0
 <2><f78>: Abbrev Number: 8 (DW_TAG_member)
    <f79>   DW_AT_name        : (indirect string, offset: 0xce00c): OriEnable
    <f7d>   DW_AT_decl_file   : 6
    <f7e>   DW_AT_decl_line   : 123
    <f7f>   DW_AT_decl_column : 14
    <f80>   DW_AT_type        : <0xe95>
    <f84>   DW_AT_byte_size   : 4
    <f85>   DW_AT_bit_size    : 1
    <f86>   DW_AT_bit_offset  : 24
    <f87>   DW_AT_data_member_location: 0
 <2><f88>: Abbrev Number: 8 (DW_TAG_member)
    <f89>   DW_AT_name        : (indirect string, offset: 0xce33d): InclEnable
    <f8d>   DW_AT_decl_file   : 6
    <f8e>   DW_AT_decl_line   : 124
    <f8f>   DW_AT_decl_column : 14
    <f90>   DW_AT_type        : <0xe95>
    <f94>   DW_AT_byte_size   : 4
    <f95>   DW_AT_bit_size    : 1
    <f96>   DW_AT_bit_offset  : 23
    <f97>   DW_AT_data_member_location: 0
 <2><f98>: Abbrev Number: 8 (DW_TAG_member)
    <f99>   DW_AT_name        : (indirect string, offset: 0xce63c): BarEnable
    <f9d>   DW_AT_decl_file   : 6
    <f9e>   DW_AT_decl_line   : 125
    <f9f>   DW_AT_decl_column : 14
    <fa0>   DW_AT_type        : <0xe95>
    <fa4>   DW_AT_byte_size   : 4
    <fa5>   DW_AT_bit_size    : 1
    <fa6>   DW_AT_bit_offset  : 22
    <fa7>   DW_AT_data_member_location: 0
 <2><fa8>: Abbrev Number: 8 (DW_TAG_member)
    <fa9>   DW_AT_name        : (indirect string, offset: 0xce261): AlsEnable
    <fad>   DW_AT_decl_file   : 6
    <fae>   DW_AT_decl_line   : 126
    <faf>   DW_AT_decl_column : 14
    <fb0>   DW_AT_type        : <0xe95>
    <fb4>   DW_AT_byte_size   : 4
    <fb5>   DW_AT_bit_size    : 1
    <fb6>   DW_AT_bit_offset  : 21
    <fb7>   DW_AT_data_member_location: 0
 <2><fb8>: Abbrev Number: 8 (DW_TAG_member)
    <fb9>   DW_AT_name        : (indirect string, offset: 0xce5c1): RawAccelEnable
    <fbd>   DW_AT_decl_file   : 6
    <fbe>   DW_AT_decl_line   : 127
    <fbf>   DW_AT_decl_column : 14
    <fc0>   DW_AT_type        : <0xe95>
    <fc4>   DW_AT_byte_size   : 4
    <fc5>   DW_AT_bit_size    : 1
    <fc6>   DW_AT_bit_offset  : 20
    <fc7>   DW_AT_data_member_location: 0
 <2><fc8>: Abbrev Number: 8 (DW_TAG_member)
    <fc9>   DW_AT_name        : (indirect string, offset: 0xce527): RawMagEnable
    <fcd>   DW_AT_decl_file   : 6
    <fce>   DW_AT_decl_line   : 128
    <fcf>   DW_AT_decl_column : 14
    <fd0>   DW_AT_type        : <0xe95>
    <fd4>   DW_AT_byte_size   : 4
    <fd5>   DW_AT_bit_size    : 1
    <fd6>   DW_AT_bit_offset  : 19
    <fd7>   DW_AT_data_member_location: 0
 <2><fd8>: Abbrev Number: 8 (DW_TAG_member)
    <fd9>   DW_AT_name        : (indirect string, offset: 0xce0eb): RawGyroEnable
    <fdd>   DW_AT_decl_file   : 6
    <fde>   DW_AT_decl_line   : 129
    <fdf>   DW_AT_decl_column : 14
    <fe0>   DW_AT_type        : <0xe95>
    <fe4>   DW_AT_byte_size   : 4
    <fe5>   DW_AT_bit_size    : 1
    <fe6>   DW_AT_bit_offset  : 18
    <fe7>   DW_AT_data_member_location: 0
 <2><fe8>: Abbrev Number: 0
 <1><fe9>: Abbrev Number: 7 (DW_TAG_structure_type)
    <fea>   DW_AT_name        : (indirect string, offset: 0xce016): SENSOR_LIST
    <fee>   DW_AT_byte_size   : 4
    <fef>   DW_AT_decl_file   : 6
    <ff0>   DW_AT_decl_line   : 138
    <ff1>   DW_AT_decl_column : 8
    <ff2>   DW_AT_sibling     : <0x1057>
 <2><ff6>: Abbrev Number: 8 (DW_TAG_member)
    <ff7>   DW_AT_name        : (indirect string, offset: 0xcdf59): accel
    <ffb>   DW_AT_decl_file   : 6
    <ffc>   DW_AT_decl_line   : 140
    <ffd>   DW_AT_decl_column : 14
    <ffe>   DW_AT_type        : <0xe95>
    <1002>   DW_AT_byte_size   : 4
    <1003>   DW_AT_bit_size    : 1
    <1004>   DW_AT_bit_offset  : 31
    <1005>   DW_AT_data_member_location: 0
 <2><1006>: Abbrev Number: 8 (DW_TAG_member)
    <1007>   DW_AT_name        : (indirect string, offset: 0xcdf60): gyro
    <100b>   DW_AT_decl_file   : 6
    <100c>   DW_AT_decl_line   : 141
    <100d>   DW_AT_decl_column : 14
    <100e>   DW_AT_type        : <0xe95>
    <1012>   DW_AT_byte_size   : 4
    <1013>   DW_AT_bit_size    : 1
    <1014>   DW_AT_bit_offset  : 30
    <1015>   DW_AT_data_member_location: 0
 <2><1016>: Abbrev Number: 9 (DW_TAG_member)
    <1017>   DW_AT_name        : cmp
    <101b>   DW_AT_decl_file   : 6
    <101c>   DW_AT_decl_line   : 142
    <101d>   DW_AT_decl_column : 14
    <101e>   DW_AT_type        : <0xe95>
    <1022>   DW_AT_byte_size   : 4
    <1023>   DW_AT_bit_size    : 1
    <1024>   DW_AT_bit_offset  : 29
    <1025>   DW_AT_data_member_location: 0
 <2><1026>: Abbrev Number: 9 (DW_TAG_member)
    <1027>   DW_AT_name        : ori
    <102b>   DW_AT_decl_file   : 6
    <102c>   DW_AT_decl_line   : 143
    <102d>   DW_AT_decl_column : 14
    <102e>   DW_AT_type        : <0xe95>
    <1032>   DW_AT_byte_size   : 4
    <1033>   DW_AT_bit_size    : 1
    <1034>   DW_AT_bit_offset  : 28
    <1035>   DW_AT_data_member_location: 0
 <2><1036>: Abbrev Number: 8 (DW_TAG_member)
    <1037>   DW_AT_name        : (indirect string, offset: 0xce0e6): incl
    <103b>   DW_AT_decl_file   : 6
    <103c>   DW_AT_decl_line   : 144
    <103d>   DW_AT_decl_column : 14
    <103e>   DW_AT_type        : <0xe95>
    <1042>   DW_AT_byte_size   : 4
    <1043>   DW_AT_bit_size    : 1
    <1044>   DW_AT_bit_offset  : 27
    <1045>   DW_AT_data_member_location: 0
 <2><1046>: Abbrev Number: 9 (DW_TAG_member)
    <1047>   DW_AT_name        : res
    <104b>   DW_AT_decl_file   : 6
    <104c>   DW_AT_decl_line   : 145
    <104d>   DW_AT_decl_column : 14
    <104e>   DW_AT_type        : <0xe95>
    <1052>   DW_AT_byte_size   : 4
    <1053>   DW_AT_bit_size    : 11
    <1054>   DW_AT_bit_offset  : 16
    <1055>   DW_AT_data_member_location: 0
 <2><1056>: Abbrev Number: 0
 <1><1057>: Abbrev Number: 7 (DW_TAG_structure_type)
    <1058>   DW_AT_name        : (indirect string, offset: 0xce58b): SENSIT_REGS
    <105c>   DW_AT_byte_size   : 40
    <105d>   DW_AT_decl_file   : 6
    <105e>   DW_AT_decl_line   : 163
    <105f>   DW_AT_decl_column : 8
    <1060>   DW_AT_sibling     : <0x10e7>
 <2><1064>: Abbrev Number: 10 (DW_TAG_member)
    <1065>   DW_AT_name        : (indirect string, offset: 0xce1f6): ACSEN
    <1069>   DW_AT_decl_file   : 6
    <106a>   DW_AT_decl_line   : 165
    <106b>   DW_AT_decl_column : 12
    <106c>   DW_AT_type        : <0xeef>
    <1070>   DW_AT_data_member_location: 0
 <2><1071>: Abbrev Number: 10 (DW_TAG_member)
    <1072>   DW_AT_name        : (indirect string, offset: 0xce0c8): GYSEN
    <1076>   DW_AT_decl_file   : 6
    <1077>   DW_AT_decl_line   : 166
    <1078>   DW_AT_decl_column : 12
    <1079>   DW_AT_type        : <0xeef>
    <107d>   DW_AT_data_member_location: 4
 <2><107e>: Abbrev Number: 10 (DW_TAG_member)
    <107f>   DW_AT_name        : (indirect string, offset: 0xce323): CMSEN
    <1083>   DW_AT_decl_file   : 6
    <1084>   DW_AT_decl_line   : 167
    <1085>   DW_AT_decl_column : 12
    <1086>   DW_AT_type        : <0xeef>
    <108a>   DW_AT_data_member_location: 8
 <2><108b>: Abbrev Number: 10 (DW_TAG_member)
    <108c>   DW_AT_name        : (indirect string, offset: 0xce190): ORSEN
    <1090>   DW_AT_decl_file   : 6
    <1091>   DW_AT_decl_line   : 168
    <1092>   DW_AT_decl_column : 12
    <1093>   DW_AT_type        : <0xeef>
    <1097>   DW_AT_data_member_location: 12
 <2><1098>: Abbrev Number: 10 (DW_TAG_member)
    <1099>   DW_AT_name        : (indirect string, offset: 0xce36c): INSEN
    <109d>   DW_AT_decl_file   : 6
    <109e>   DW_AT_decl_line   : 169
    <109f>   DW_AT_decl_column : 12
    <10a0>   DW_AT_type        : <0xeef>
    <10a4>   DW_AT_data_member_location: 16
 <2><10a5>: Abbrev Number: 10 (DW_TAG_member)
    <10a6>   DW_AT_name        : (indirect string, offset: 0xce3f1): RES_VREG07
    <10aa>   DW_AT_decl_file   : 6
    <10ab>   DW_AT_decl_line   : 170
    <10ac>   DW_AT_decl_column : 12
    <10ad>   DW_AT_type        : <0xeef>
    <10b1>   DW_AT_data_member_location: 20
 <2><10b2>: Abbrev Number: 10 (DW_TAG_member)
    <10b3>   DW_AT_name        : (indirect string, offset: 0xce53c): RES_VREG08
    <10b7>   DW_AT_decl_file   : 6
    <10b8>   DW_AT_decl_line   : 171
    <10b9>   DW_AT_decl_column : 12
    <10ba>   DW_AT_type        : <0xeef>
    <10be>   DW_AT_data_member_location: 24
 <2><10bf>: Abbrev Number: 10 (DW_TAG_member)
    <10c0>   DW_AT_name        : (indirect string, offset: 0xce1f5): RACSEN
