Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xbe7 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x358fb): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x398f4): ../Core/MikroeSDK_3D-Motion/i2cIO.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xb43c): C:/Users/pjura/Desktop/dev/stm32/embsys_bubble-level/Source/nucleo-l432kc_3d-motion/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x64980): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x39f0b): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1

    <3f>   DW_AT_name        : (indirect string, offset: 0xc1f9b): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x95302): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0xa3e56): __uint16_t
    <4f>   DW_AT_decl_file   : 2
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0xc075e): short unsigned int
 <1><5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 5	(signed)
    <60>   DW_AT_name        : (indirect string, offset: 0x11394): long int
 <1><64>: Abbrev Number: 3 (DW_TAG_typedef)
    <65>   DW_AT_name        : (indirect string, offset: 0x7fe1a): __uint32_t
    <69>   DW_AT_decl_file   : 2
    <6a>   DW_AT_decl_line   : 79
    <6b>   DW_AT_decl_column : 25
    <6c>   DW_AT_type        : <0x70>
 <1><70>: Abbrev Number: 2 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 4
    <72>   DW_AT_encoding    : 7	(unsigned)
    <73>   DW_AT_name        : (indirect string, offset: 0x3d754): long unsigned int
 <1><77>: Abbrev Number: 2 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 8
    <79>   DW_AT_encoding    : 5	(signed)
    <7a>   DW_AT_name        : (indirect string, offset: 0x5b6d8): long long int
 <1><7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 8
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0x297c8): long long unsigned int
 <1><85>: Abbrev Number: 4 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : int
 <1><8c>: Abbrev Number: 2 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x10af7): unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_typedef)
    <94>   DW_AT_name        : (indirect string, offset: 0xc99e8): size_t
    <98>   DW_AT_decl_file   : 3
    <99>   DW_AT_decl_line   : 209
    <9a>   DW_AT_decl_column : 23
    <9b>   DW_AT_type        : <0x8c>
 <1><9f>: Abbrev Number: 2 (DW_TAG_base_type)
    <a0>   DW_AT_byte_size   : 8
    <a1>   DW_AT_encoding    : 4	(float)
    <a2>   DW_AT_name        : (indirect string, offset: 0x12a99): long double
 <1><a6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a7>   DW_AT_byte_size   : 4
 <1><a8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a9>   DW_AT_byte_size   : 4
    <aa>   DW_AT_type        : <0xae>
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 1
    <b0>   DW_AT_encoding    : 8	(unsigned char)
    <b1>   DW_AT_name        : (indirect string, offset: 0xcaedf): char
 <1><b5>: Abbrev Number: 7 (DW_TAG_const_type)
    <b6>   DW_AT_type        : <0xae>
 <1><ba>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <bb>   DW_AT_byte_size   : 4
    <bc>   DW_AT_type        : <0xb5>
 <1><c0>: Abbrev Number: 3 (DW_TAG_typedef)
    <c1>   DW_AT_name        : (indirect string, offset: 0x39f0d): uint8_t
    <c5>   DW_AT_decl_file   : 4
    <c6>   DW_AT_decl_line   : 24
    <c7>   DW_AT_decl_column : 19
    <c8>   DW_AT_type        : <0x30>
 <1><cc>: Abbrev Number: 7 (DW_TAG_const_type)
    <cd>   DW_AT_type        : <0xc0>
 <1><d1>: Abbrev Number: 3 (DW_TAG_typedef)
    <d2>   DW_AT_name        : (indirect string, offset: 0xcccc5): uint16_t
    <d6>   DW_AT_decl_file   : 4
    <d7>   DW_AT_decl_line   : 36
    <d8>   DW_AT_decl_column : 20
    <d9>   DW_AT_type        : <0x4a>
 <1><dd>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <de>   DW_AT_type        : <0xd1>
 <1><e2>: Abbrev Number: 3 (DW_TAG_typedef)
    <e3>   DW_AT_name        : (indirect string, offset: 0xccbdb): uint32_t
    <e7>   DW_AT_decl_file   : 4
    <e8>   DW_AT_decl_line   : 48
    <e9>   DW_AT_decl_column : 20
    <ea>   DW_AT_type        : <0x64>
 <1><ee>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <ef>   DW_AT_type        : <0xe2>
 <1><f3>: Abbrev Number: 2 (DW_TAG_base_type)
    <f4>   DW_AT_byte_size   : 4
    <f5>   DW_AT_encoding    : 4	(float)
    <f6>   DW_AT_name        : (indirect string, offset: 0xc9804): float
 <1><fa>: Abbrev Number: 2 (DW_TAG_base_type)
    <fb>   DW_AT_byte_size   : 8
    <fc>   DW_AT_encoding    : 4	(float)
    <fd>   DW_AT_name        : (indirect string, offset: 0xca07d): double
 <1><101>: Abbrev Number: 3 (DW_TAG_typedef)
    <102>   DW_AT_name        : (indirect string, offset: 0xadd77): UINT8
    <106>   DW_AT_decl_file   : 5
    <107>   DW_AT_decl_line   : 28
    <108>   DW_AT_decl_column : 23
    <109>   DW_AT_type        : <0x3c>
 <1><10d>: Abbrev Number: 3 (DW_TAG_typedef)
    <10e>   DW_AT_name        : (indirect string, offset: 0x86dc3): BOOL
    <112>   DW_AT_decl_file   : 5
    <113>   DW_AT_decl_line   : 29
    <114>   DW_AT_decl_column : 23
    <115>   DW_AT_type        : <0x3c>
 <1><119>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <11a>   DW_AT_type        : <0x10d>
 <1><11e>: Abbrev Number: 3 (DW_TAG_typedef)
    <11f>   DW_AT_name        : (indirect string, offset: 0x48873): UINT16
    <123>   DW_AT_decl_file   : 5
    <124>   DW_AT_decl_line   : 31
    <125>   DW_AT_decl_column : 22
    <126>   DW_AT_type        : <0x8c>
 <1><12a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <12b>   DW_AT_byte_size   : 16
    <12c>   DW_AT_decl_file   : 6
    <12d>   DW_AT_decl_line   : 360
    <12f>   DW_AT_decl_column : 9
    <130>   DW_AT_sibling     : <0x16d>
 <2><134>: Abbrev Number: 10 (DW_TAG_member)
    <135>   DW_AT_name        : CCR
    <139>   DW_AT_decl_file   : 6
    <13a>   DW_AT_decl_line   : 362
    <13c>   DW_AT_decl_column : 17
    <13d>   DW_AT_type        : <0xee>
    <141>   DW_AT_data_member_location: 0
 <2><142>: Abbrev Number: 11 (DW_TAG_member)
    <143>   DW_AT_name        : (indirect string, offset: 0x83258): CNDTR
    <147>   DW_AT_decl_file   : 6
    <148>   DW_AT_decl_line   : 363
    <14a>   DW_AT_decl_column : 17
    <14b>   DW_AT_type        : <0xee>
    <14f>   DW_AT_data_member_location: 4
 <2><150>: Abbrev Number: 11 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0xb6d1f): CPAR
    <155>   DW_AT_decl_file   : 6
    <156>   DW_AT_decl_line   : 364
    <158>   DW_AT_decl_column : 17
    <159>   DW_AT_type        : <0xee>
    <15d>   DW_AT_data_member_location: 8
 <2><15e>: Abbrev Number: 11 (DW_TAG_member)
    <15f>   DW_AT_name        : (indirect string, offset: 0x6f1ef): CMAR
    <163>   DW_AT_decl_file   : 6
    <164>   DW_AT_decl_line   : 365
    <166>   DW_AT_decl_column : 17
    <167>   DW_AT_type        : <0xee>
    <16b>   DW_AT_data_member_location: 12
 <2><16c>: Abbrev Number: 0
 <1><16d>: Abbrev Number: 12 (DW_TAG_typedef)
    <16e>   DW_AT_name        : (indirect string, offset: 0xbd276): DMA_Channel_TypeDef
    <172>   DW_AT_decl_file   : 6
    <173>   DW_AT_decl_line   : 366
    <175>   DW_AT_decl_column : 3
    <176>   DW_AT_type        : <0x12a>
 <1><17a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <17b>   DW_AT_byte_size   : 8
    <17c>   DW_AT_decl_file   : 6
    <17d>   DW_AT_decl_line   : 368
    <17f>   DW_AT_decl_column : 9
    <180>   DW_AT_sibling     : <0x1a1>
 <2><184>: Abbrev Number: 10 (DW_TAG_member)
    <185>   DW_AT_name        : ISR
    <189>   DW_AT_decl_file   : 6
    <18a>   DW_AT_decl_line   : 370
    <18c>   DW_AT_decl_column : 17
    <18d>   DW_AT_type        : <0xee>
    <191>   DW_AT_data_member_location: 0
 <2><192>: Abbrev Number: 11 (DW_TAG_member)
    <193>   DW_AT_name        : (indirect string, offset: 0x8c9f3): IFCR
    <197>   DW_AT_decl_file   : 6
    <198>   DW_AT_decl_line   : 371
    <19a>   DW_AT_decl_column : 17
    <19b>   DW_AT_type        : <0xee>
    <19f>   DW_AT_data_member_location: 4
 <2><1a0>: Abbrev Number: 0
 <1><1a1>: Abbrev Number: 12 (DW_TAG_typedef)
    <1a2>   DW_AT_name        : (indirect string, offset: 0x48d5f): DMA_TypeDef
    <1a6>   DW_AT_decl_file   : 6
    <1a7>   DW_AT_decl_line   : 372
    <1a9>   DW_AT_decl_column : 3
    <1aa>   DW_AT_type        : <0x17a>
 <1><1ae>: Abbrev Number: 9 (DW_TAG_structure_type)
    <1af>   DW_AT_byte_size   : 44
    <1b0>   DW_AT_decl_file   : 6
    <1b1>   DW_AT_decl_line   : 471
    <1b3>   DW_AT_decl_column : 9
    <1b4>   DW_AT_sibling     : <0x253>
 <2><1b8>: Abbrev Number: 10 (DW_TAG_member)
    <1b9>   DW_AT_name        : CR1
    <1bd>   DW_AT_decl_file   : 6
    <1be>   DW_AT_decl_line   : 473
    <1c0>   DW_AT_decl_column : 17
    <1c1>   DW_AT_type        : <0xee>
    <1c5>   DW_AT_data_member_location: 0
 <2><1c6>: Abbrev Number: 10 (DW_TAG_member)
    <1c7>   DW_AT_name        : CR2
    <1cb>   DW_AT_decl_file   : 6
    <1cc>   DW_AT_decl_line   : 474
    <1ce>   DW_AT_decl_column : 17
    <1cf>   DW_AT_type        : <0xee>
    <1d3>   DW_AT_data_member_location: 4
 <2><1d4>: Abbrev Number: 11 (DW_TAG_member)
    <1d5>   DW_AT_name        : (indirect string, offset: 0x1d7b8): OAR1
    <1d9>   DW_AT_decl_file   : 6
    <1da>   DW_AT_decl_line   : 475
    <1dc>   DW_AT_decl_column : 17
    <1dd>   DW_AT_type        : <0xee>
    <1e1>   DW_AT_data_member_location: 8
 <2><1e2>: Abbrev Number: 11 (DW_TAG_member)
    <1e3>   DW_AT_name        : (indirect string, offset: 0x544fd): OAR2
    <1e7>   DW_AT_decl_file   : 6
    <1e8>   DW_AT_decl_line   : 476
    <1ea>   DW_AT_decl_column : 17
    <1eb>   DW_AT_type        : <0xee>
    <1ef>   DW_AT_data_member_location: 12
 <2><1f0>: Abbrev Number: 11 (DW_TAG_member)
    <1f1>   DW_AT_name        : (indirect string, offset: 0x75e25): TIMINGR
    <1f5>   DW_AT_decl_file   : 6
    <1f6>   DW_AT_decl_line   : 477
    <1f8>   DW_AT_decl_column : 17
    <1f9>   DW_AT_type        : <0xee>
    <1fd>   DW_AT_data_member_location: 16
 <2><1fe>: Abbrev Number: 11 (DW_TAG_member)
    <1ff>   DW_AT_name        : (indirect string, offset: 0xa35ba): TIMEOUTR
    <203>   DW_AT_decl_file   : 6
    <204>   DW_AT_decl_line   : 478
    <206>   DW_AT_decl_column : 17
    <207>   DW_AT_type        : <0xee>
    <20b>   DW_AT_data_member_location: 20
 <2><20c>: Abbrev Number: 10 (DW_TAG_member)
    <20d>   DW_AT_name        : ISR
    <211>   DW_AT_decl_file   : 6
    <212>   DW_AT_decl_line   : 479
    <214>   DW_AT_decl_column : 17
    <215>   DW_AT_type        : <0xee>
    <219>   DW_AT_data_member_location: 24
 <2><21a>: Abbrev Number: 10 (DW_TAG_member)
    <21b>   DW_AT_name        : ICR
    <21f>   DW_AT_decl_file   : 6
    <220>   DW_AT_decl_line   : 480
    <222>   DW_AT_decl_column : 17
    <223>   DW_AT_type        : <0xee>
    <227>   DW_AT_data_member_location: 28
 <2><228>: Abbrev Number: 11 (DW_TAG_member)
    <229>   DW_AT_name        : (indirect string, offset: 0xaac4c): PECR
    <22d>   DW_AT_decl_file   : 6
    <22e>   DW_AT_decl_line   : 481
    <230>   DW_AT_decl_column : 17
    <231>   DW_AT_type        : <0xee>
    <235>   DW_AT_data_member_location: 32
 <2><236>: Abbrev Number: 11 (DW_TAG_member)
    <237>   DW_AT_name        : (indirect string, offset: 0xa594d): RXDR
    <23b>   DW_AT_decl_file   : 6
    <23c>   DW_AT_decl_line   : 482
    <23e>   DW_AT_decl_column : 17
    <23f>   DW_AT_type        : <0xee>
    <243>   DW_AT_data_member_location: 36
 <2><244>: Abbrev Number: 11 (DW_TAG_member)
    <245>   DW_AT_name        : (indirect string, offset: 0xd1712): TXDR
    <249>   DW_AT_decl_file   : 6
    <24a>   DW_AT_decl_line   : 483
    <24c>   DW_AT_decl_column : 17
    <24d>   DW_AT_type        : <0xee>
    <251>   DW_AT_data_member_location: 40
 <2><252>: Abbrev Number: 0
 <1><253>: Abbrev Number: 12 (DW_TAG_typedef)
    <254>   DW_AT_name        : (indirect string, offset: 0x1b5c2): I2C_TypeDef
    <258>   DW_AT_decl_file   : 6
    <259>   DW_AT_decl_line   : 484
    <25b>   DW_AT_decl_column : 3
    <25c>   DW_AT_type        : <0x1ae>
 <1><260>: Abbrev Number: 9 (DW_TAG_structure_type)
    <261>   DW_AT_byte_size   : 44
    <262>   DW_AT_decl_file   : 6
    <263>   DW_AT_decl_line   : 827
    <265>   DW_AT_decl_column : 9
    <266>   DW_AT_sibling     : <0x33d>
 <2><26a>: Abbrev Number: 10 (DW_TAG_member)
    <26b>   DW_AT_name        : CR1
    <26f>   DW_AT_decl_file   : 6
    <270>   DW_AT_decl_line   : 829
    <272>   DW_AT_decl_column : 17
    <273>   DW_AT_type        : <0xee>
    <277>   DW_AT_data_member_location: 0
 <2><278>: Abbrev Number: 10 (DW_TAG_member)
    <279>   DW_AT_name        : CR2
    <27d>   DW_AT_decl_file   : 6
    <27e>   DW_AT_decl_line   : 830
    <280>   DW_AT_decl_column : 17
    <281>   DW_AT_type        : <0xee>
    <285>   DW_AT_data_member_location: 4
 <2><286>: Abbrev Number: 10 (DW_TAG_member)
    <287>   DW_AT_name        : CR3
    <28b>   DW_AT_decl_file   : 6
    <28c>   DW_AT_decl_line   : 831
    <28e>   DW_AT_decl_column : 17
    <28f>   DW_AT_type        : <0xee>
    <293>   DW_AT_data_member_location: 8
 <2><294>: Abbrev Number: 10 (DW_TAG_member)
    <295>   DW_AT_name        : BRR
    <299>   DW_AT_decl_file   : 6
    <29a>   DW_AT_decl_line   : 832
    <29c>   DW_AT_decl_column : 17
    <29d>   DW_AT_type        : <0xee>
    <2a1>   DW_AT_data_member_location: 12
 <2><2a2>: Abbrev Number: 11 (DW_TAG_member)
    <2a3>   DW_AT_name        : (indirect string, offset: 0x3756f): GTPR
    <2a7>   DW_AT_decl_file   : 6
    <2a8>   DW_AT_decl_line   : 833
    <2aa>   DW_AT_decl_column : 17
    <2ab>   DW_AT_type        : <0xdd>
    <2af>   DW_AT_data_member_location: 16
 <2><2b0>: Abbrev Number: 11 (DW_TAG_member)
    <2b1>   DW_AT_name        : (indirect string, offset: 0xbd1a1): RESERVED2
    <2b5>   DW_AT_decl_file   : 6
    <2b6>   DW_AT_decl_line   : 834
    <2b8>   DW_AT_decl_column : 13
    <2b9>   DW_AT_type        : <0xd1>
    <2bd>   DW_AT_data_member_location: 18
 <2><2be>: Abbrev Number: 11 (DW_TAG_member)
    <2bf>   DW_AT_name        : (indirect string, offset: 0x760b5): RTOR
    <2c3>   DW_AT_decl_file   : 6
    <2c4>   DW_AT_decl_line   : 835
    <2c6>   DW_AT_decl_column : 17
    <2c7>   DW_AT_type        : <0xee>
    <2cb>   DW_AT_data_member_location: 20
 <2><2cc>: Abbrev Number: 10 (DW_TAG_member)
    <2cd>   DW_AT_name        : RQR
    <2d1>   DW_AT_decl_file   : 6
    <2d2>   DW_AT_decl_line   : 836
    <2d4>   DW_AT_decl_column : 17
    <2d5>   DW_AT_type        : <0xdd>
    <2d9>   DW_AT_data_member_location: 24
 <2><2da>: Abbrev Number: 11 (DW_TAG_member)
    <2db>   DW_AT_name        : (indirect string, offset: 0xbd1ab): RESERVED3
    <2df>   DW_AT_decl_file   : 6
    <2e0>   DW_AT_decl_line   : 837
    <2e2>   DW_AT_decl_column : 13
    <2e3>   DW_AT_type        : <0xd1>
    <2e7>   DW_AT_data_member_location: 26
 <2><2e8>: Abbrev Number: 10 (DW_TAG_member)
    <2e9>   DW_AT_name        : ISR
    <2ed>   DW_AT_decl_file   : 6
    <2ee>   DW_AT_decl_line   : 838
    <2f0>   DW_AT_decl_column : 17
    <2f1>   DW_AT_type        : <0xee>
    <2f5>   DW_AT_data_member_location: 28
 <2><2f6>: Abbrev Number: 10 (DW_TAG_member)
    <2f7>   DW_AT_name        : ICR
    <2fb>   DW_AT_decl_file   : 6
    <2fc>   DW_AT_decl_line   : 839
    <2fe>   DW_AT_decl_column : 17
    <2ff>   DW_AT_type        : <0xee>
    <303>   DW_AT_data_member_location: 32
 <2><304>: Abbrev Number: 10 (DW_TAG_member)
    <305>   DW_AT_name        : RDR
    <309>   DW_AT_decl_file   : 6
    <30a>   DW_AT_decl_line   : 840
    <30c>   DW_AT_decl_column : 17
    <30d>   DW_AT_type        : <0xdd>
    <311>   DW_AT_data_member_location: 36
 <2><312>: Abbrev Number: 11 (DW_TAG_member)
    <313>   DW_AT_name        : (indirect string, offset: 0x77059): RESERVED4
    <317>   DW_AT_decl_file   : 6
    <318>   DW_AT_decl_line   : 841
    <31a>   DW_AT_decl_column : 13
    <31b>   DW_AT_type        : <0xd1>
    <31f>   DW_AT_data_member_location: 38
 <2><320>: Abbrev Number: 10 (DW_TAG_member)
    <321>   DW_AT_name        : TDR
    <325>   DW_AT_decl_file   : 6
    <326>   DW_AT_decl_line   : 842
    <328>   DW_AT_decl_column : 17
    <329>   DW_AT_type        : <0xdd>
    <32d>   DW_AT_data_member_location: 40
 <2><32e>: Abbrev Number: 11 (DW_TAG_member)
    <32f>   DW_AT_name        : (indirect string, offset: 0xbd1d9): RESERVED5
    <333>   DW_AT_decl_file   : 6
    <334>   DW_AT_decl_line   : 843
    <336>   DW_AT_decl_column : 13
    <337>   DW_AT_type        : <0xd1>
    <33b>   DW_AT_data_member_location: 42
 <2><33c>: Abbrev Number: 0
 <1><33d>: Abbrev Number: 12 (DW_TAG_typedef)
    <33e>   DW_AT_name        : (indirect string, offset: 0xc7298): USART_TypeDef
    <342>   DW_AT_decl_file   : 6
    <343>   DW_AT_decl_line   : 844
    <345>   DW_AT_decl_column : 3
    <346>   DW_AT_type        : <0x260>
 <1><34a>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <34b>   DW_AT_encoding    : 7	(unsigned)
    <34c>   DW_AT_byte_size   : 1
    <34d>   DW_AT_type        : <0x3c>
    <351>   DW_AT_decl_file   : 7
    <352>   DW_AT_decl_line   : 39
    <353>   DW_AT_decl_column : 1
    <354>   DW_AT_sibling     : <0x371>
 <2><358>: Abbrev Number: 14 (DW_TAG_enumerator)
    <359>   DW_AT_name        : (indirect string, offset: 0x434b0): HAL_OK
    <35d>   DW_AT_const_value : 0
 <2><35e>: Abbrev Number: 14 (DW_TAG_enumerator)
    <35f>   DW_AT_name        : (indirect string, offset: 0x7d679): HAL_ERROR
    <363>   DW_AT_const_value : 1
 <2><364>: Abbrev Number: 14 (DW_TAG_enumerator)
    <365>   DW_AT_name        : (indirect string, offset: 0x2311a): HAL_BUSY
    <369>   DW_AT_const_value : 2
 <2><36a>: Abbrev Number: 14 (DW_TAG_enumerator)
    <36b>   DW_AT_name        : (indirect string, offset: 0x3a479): HAL_TIMEOUT
    <36f>   DW_AT_const_value : 3
 <2><370>: Abbrev Number: 0
 <1><371>: Abbrev Number: 3 (DW_TAG_typedef)
    <372>   DW_AT_name        : (indirect string, offset: 0x256c): HAL_StatusTypeDef
    <376>   DW_AT_decl_file   : 7
    <377>   DW_AT_decl_line   : 44
    <378>   DW_AT_decl_column : 3
    <379>   DW_AT_type        : <0x34a>
 <1><37d>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <37e>   DW_AT_encoding    : 7	(unsigned)
    <37f>   DW_AT_byte_size   : 1
    <380>   DW_AT_type        : <0x3c>
    <384>   DW_AT_decl_file   : 7
    <385>   DW_AT_decl_line   : 50
    <386>   DW_AT_decl_column : 1
    <387>   DW_AT_sibling     : <0x398>
 <2><38b>: Abbrev Number: 14 (DW_TAG_enumerator)
    <38c>   DW_AT_name        : (indirect string, offset: 0x942f4): HAL_UNLOCKED
    <390>   DW_AT_const_value : 0
 <2><391>: Abbrev Number: 14 (DW_TAG_enumerator)
    <392>   DW_AT_name        : (indirect string, offset: 0xc8ae6): HAL_LOCKED
    <396>   DW_AT_const_value : 1
 <2><397>: Abbrev Number: 0
 <1><398>: Abbrev Number: 3 (DW_TAG_typedef)
    <399>   DW_AT_name        : (indirect string, offset: 0x76032): HAL_LockTypeDef
    <39d>   DW_AT_decl_file   : 7
    <39e>   DW_AT_decl_line   : 53
    <39f>   DW_AT_decl_column : 3
    <3a0>   DW_AT_type        : <0x37d>
 <1><3a4>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3a5>   DW_AT_byte_size   : 32
    <3a6>   DW_AT_decl_file   : 8
    <3a7>   DW_AT_decl_line   : 46
    <3a8>   DW_AT_decl_column : 9
    <3a9>   DW_AT_sibling     : <0x416>
 <2><3ad>: Abbrev Number: 16 (DW_TAG_member)
    <3ae>   DW_AT_name        : (indirect string, offset: 0xd0f65): Request
    <3b2>   DW_AT_decl_file   : 8
    <3b3>   DW_AT_decl_line   : 48
    <3b4>   DW_AT_decl_column : 12
    <3b5>   DW_AT_type        : <0xe2>
    <3b9>   DW_AT_data_member_location: 0
 <2><3ba>: Abbrev Number: 16 (DW_TAG_member)
    <3bb>   DW_AT_name        : (indirect string, offset: 0xd159d): Direction
    <3bf>   DW_AT_decl_file   : 8
    <3c0>   DW_AT_decl_line   : 51
    <3c1>   DW_AT_decl_column : 12
    <3c2>   DW_AT_type        : <0xe2>
    <3c6>   DW_AT_data_member_location: 4
 <2><3c7>: Abbrev Number: 16 (DW_TAG_member)
    <3c8>   DW_AT_name        : (indirect string, offset: 0xdae2): PeriphInc
    <3cc>   DW_AT_decl_file   : 8
    <3cd>   DW_AT_decl_line   : 55
    <3ce>   DW_AT_decl_column : 12
    <3cf>   DW_AT_type        : <0xe2>
    <3d3>   DW_AT_data_member_location: 8
 <2><3d4>: Abbrev Number: 16 (DW_TAG_member)
    <3d5>   DW_AT_name        : (indirect string, offset: 0x1f459): MemInc
    <3d9>   DW_AT_decl_file   : 8
    <3da>   DW_AT_decl_line   : 58
    <3db>   DW_AT_decl_column : 12
    <3dc>   DW_AT_type        : <0xe2>
    <3e0>   DW_AT_data_member_location: 12
 <2><3e1>: Abbrev Number: 16 (DW_TAG_member)
    <3e2>   DW_AT_name        : (indirect string, offset: 0x63df0): PeriphDataAlignment
    <3e6>   DW_AT_decl_file   : 8
    <3e7>   DW_AT_decl_line   : 61
    <3e8>   DW_AT_decl_column : 12
    <3e9>   DW_AT_type        : <0xe2>
    <3ed>   DW_AT_data_member_location: 16
 <2><3ee>: Abbrev Number: 16 (DW_TAG_member)
    <3ef>   DW_AT_name        : (indirect string, offset: 0xb521e): MemDataAlignment
    <3f3>   DW_AT_decl_file   : 8
    <3f4>   DW_AT_decl_line   : 64
    <3f5>   DW_AT_decl_column : 12
    <3f6>   DW_AT_type        : <0xe2>
    <3fa>   DW_AT_data_member_location: 20
 <2><3fb>: Abbrev Number: 16 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0xd1e62): Mode
    <400>   DW_AT_decl_file   : 8
    <401>   DW_AT_decl_line   : 67
    <402>   DW_AT_decl_column : 12
    <403>   DW_AT_type        : <0xe2>
    <407>   DW_AT_data_member_location: 24
 <2><408>: Abbrev Number: 16 (DW_TAG_member)
    <409>   DW_AT_name        : (indirect string, offset: 0xd0b35): Priority
    <40d>   DW_AT_decl_file   : 8
    <40e>   DW_AT_decl_line   : 72
    <40f>   DW_AT_decl_column : 12
    <410>   DW_AT_type        : <0xe2>
    <414>   DW_AT_data_member_location: 28
 <2><415>: Abbrev Number: 0
 <1><416>: Abbrev Number: 3 (DW_TAG_typedef)
    <417>   DW_AT_name        : (indirect string, offset: 0x35c3a): DMA_InitTypeDef
    <41b>   DW_AT_decl_file   : 8
    <41c>   DW_AT_decl_line   : 74
    <41d>   DW_AT_decl_column : 3
    <41e>   DW_AT_type        : <0x3a4>
 <1><422>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <423>   DW_AT_encoding    : 7	(unsigned)
    <424>   DW_AT_byte_size   : 1
    <425>   DW_AT_type        : <0x3c>
    <429>   DW_AT_decl_file   : 8
    <42a>   DW_AT_decl_line   : 80
    <42b>   DW_AT_decl_column : 1
    <42c>   DW_AT_sibling     : <0x449>
 <2><430>: Abbrev Number: 14 (DW_TAG_enumerator)
    <431>   DW_AT_name        : (indirect string, offset: 0x95667): HAL_DMA_STATE_RESET
    <435>   DW_AT_const_value : 0
 <2><436>: Abbrev Number: 14 (DW_TAG_enumerator)
    <437>   DW_AT_name        : (indirect string, offset: 0x193d5): HAL_DMA_STATE_READY
    <43b>   DW_AT_const_value : 1
 <2><43c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <43d>   DW_AT_name        : (indirect string, offset: 0x8b425): HAL_DMA_STATE_BUSY
    <441>   DW_AT_const_value : 2
 <2><442>: Abbrev Number: 14 (DW_TAG_enumerator)
    <443>   DW_AT_name        : (indirect string, offset: 0xc5b9c): HAL_DMA_STATE_TIMEOUT
    <447>   DW_AT_const_value : 3
 <2><448>: Abbrev Number: 0
 <1><449>: Abbrev Number: 3 (DW_TAG_typedef)
    <44a>   DW_AT_name        : (indirect string, offset: 0x6ea71): HAL_DMA_StateTypeDef
    <44e>   DW_AT_decl_file   : 8
    <44f>   DW_AT_decl_line   : 85
    <450>   DW_AT_decl_column : 2
    <451>   DW_AT_type        : <0x422>
 <1><455>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <456>   DW_AT_type        : <0x449>
 <1><45a>: Abbrev Number: 17 (DW_TAG_structure_type)
    <45b>   DW_AT_name        : (indirect string, offset: 0xaadb8): __DMA_HandleTypeDef
    <45f>   DW_AT_byte_size   : 72
    <460>   DW_AT_decl_file   : 8
    <461>   DW_AT_decl_line   : 112
    <462>   DW_AT_decl_column : 16
    <463>   DW_AT_sibling     : <0x504>
 <2><467>: Abbrev Number: 16 (DW_TAG_member)
    <468>   DW_AT_name        : (indirect string, offset: 0xa3beb): Instance
    <46c>   DW_AT_decl_file   : 8
    <46d>   DW_AT_decl_line   : 114
    <46e>   DW_AT_decl_column : 27
    <46f>   DW_AT_type        : <0x504>
    <473>   DW_AT_data_member_location: 0
 <2><474>: Abbrev Number: 16 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0xd2aca): Init
    <479>   DW_AT_decl_file   : 8
    <47a>   DW_AT_decl_line   : 116
    <47b>   DW_AT_decl_column : 25
    <47c>   DW_AT_type        : <0x416>
    <480>   DW_AT_data_member_location: 4
 <2><481>: Abbrev Number: 16 (DW_TAG_member)
    <482>   DW_AT_name        : (indirect string, offset: 0x8f173): Lock
    <486>   DW_AT_decl_file   : 8
    <487>   DW_AT_decl_line   : 118
    <488>   DW_AT_decl_column : 25
    <489>   DW_AT_type        : <0x398>
    <48d>   DW_AT_data_member_location: 36
 <2><48e>: Abbrev Number: 16 (DW_TAG_member)
    <48f>   DW_AT_name        : (indirect string, offset: 0xd3b2d): State
    <493>   DW_AT_decl_file   : 8
    <494>   DW_AT_decl_line   : 120
    <495>   DW_AT_decl_column : 30
    <496>   DW_AT_type        : <0x455>
    <49a>   DW_AT_data_member_location: 37
 <2><49b>: Abbrev Number: 16 (DW_TAG_member)
    <49c>   DW_AT_name        : (indirect string, offset: 0xbf003): Parent
    <4a0>   DW_AT_decl_file   : 8
    <4a1>   DW_AT_decl_line   : 122
    <4a2>   DW_AT_decl_column : 26
    <4a3>   DW_AT_type        : <0xa6>
    <4a7>   DW_AT_data_member_location: 40
 <2><4a8>: Abbrev Number: 16 (DW_TAG_member)
    <4a9>   DW_AT_name        : (indirect string, offset: 0xc7df3): XferCpltCallback
    <4ad>   DW_AT_decl_file   : 8
    <4ae>   DW_AT_decl_line   : 124
    <4af>   DW_AT_decl_column : 28
    <4b0>   DW_AT_type        : <0x51b>
    <4b4>   DW_AT_data_member_location: 44
 <2><4b5>: Abbrev Number: 16 (DW_TAG_member)
    <4b6>   DW_AT_name        : (indirect string, offset: 0x9bd7c): XferHalfCpltCallback
    <4ba>   DW_AT_decl_file   : 8
    <4bb>   DW_AT_decl_line   : 126
    <4bc>   DW_AT_decl_column : 28
    <4bd>   DW_AT_type        : <0x51b>
    <4c1>   DW_AT_data_member_location: 48
 <2><4c2>: Abbrev Number: 16 (DW_TAG_member)
    <4c3>   DW_AT_name        : (indirect string, offset: 0x1cc10): XferErrorCallback
    <4c7>   DW_AT_decl_file   : 8
    <4c8>   DW_AT_decl_line   : 128
    <4c9>   DW_AT_decl_column : 28
    <4ca>   DW_AT_type        : <0x51b>
    <4ce>   DW_AT_data_member_location: 52
 <2><4cf>: Abbrev Number: 16 (DW_TAG_member)
    <4d0>   DW_AT_name        : (indirect string, offset: 0xbb2d9): XferAbortCallback
    <4d4>   DW_AT_decl_file   : 8
    <4d5>   DW_AT_decl_line   : 130
    <4d6>   DW_AT_decl_column : 28
    <4d7>   DW_AT_type        : <0x51b>
    <4db>   DW_AT_data_member_location: 56
 <2><4dc>: Abbrev Number: 16 (DW_TAG_member)
    <4dd>   DW_AT_name        : (indirect string, offset: 0xc46e9): ErrorCode
    <4e1>   DW_AT_decl_file   : 8
    <4e2>   DW_AT_decl_line   : 132
    <4e3>   DW_AT_decl_column : 25
    <4e4>   DW_AT_type        : <0xee>
    <4e8>   DW_AT_data_member_location: 60
 <2><4e9>: Abbrev Number: 16 (DW_TAG_member)
    <4ea>   DW_AT_name        : (indirect string, offset: 0x50fa6): DmaBaseAddress
    <4ee>   DW_AT_decl_file   : 8
    <4ef>   DW_AT_decl_line   : 134
    <4f0>   DW_AT_decl_column : 26
    <4f1>   DW_AT_type        : <0x521>
    <4f5>   DW_AT_data_member_location: 64
 <2><4f6>: Abbrev Number: 16 (DW_TAG_member)
    <4f7>   DW_AT_name        : (indirect string, offset: 0xba042): ChannelIndex
    <4fb>   DW_AT_decl_file   : 8
    <4fc>   DW_AT_decl_line   : 136
    <4fd>   DW_AT_decl_column : 25
    <4fe>   DW_AT_type        : <0xe2>
    <502>   DW_AT_data_member_location: 68
 <2><503>: Abbrev Number: 0
 <1><504>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <505>   DW_AT_byte_size   : 4
    <506>   DW_AT_type        : <0x16d>
 <1><50a>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <50b>   DW_AT_prototyped  : 1
    <50b>   DW_AT_sibling     : <0x515>
 <2><50f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <510>   DW_AT_type        : <0x515>
 <2><514>: Abbrev Number: 0
 <1><515>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <516>   DW_AT_byte_size   : 4
    <517>   DW_AT_type        : <0x45a>
 <1><51b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <51c>   DW_AT_byte_size   : 4
    <51d>   DW_AT_type        : <0x50a>
 <1><521>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <522>   DW_AT_byte_size   : 4
    <523>   DW_AT_type        : <0x1a1>
 <1><527>: Abbrev Number: 3 (DW_TAG_typedef)
    <528>   DW_AT_name        : (indirect string, offset: 0xaadba): DMA_HandleTypeDef
    <52c>   DW_AT_decl_file   : 8
    <52d>   DW_AT_decl_line   : 153
    <52e>   DW_AT_decl_column : 2
    <52f>   DW_AT_type        : <0x45a>
 <1><533>: Abbrev Number: 15 (DW_TAG_structure_type)
    <534>   DW_AT_byte_size   : 32
    <535>   DW_AT_decl_file   : 9
    <536>   DW_AT_decl_line   : 47
    <537>   DW_AT_decl_column : 9
    <538>   DW_AT_sibling     : <0x5a5>
 <2><53c>: Abbrev Number: 16 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0xb62ed): Timing
    <541>   DW_AT_decl_file   : 9
    <542>   DW_AT_decl_line   : 49
    <543>   DW_AT_decl_column : 12
    <544>   DW_AT_type        : <0xe2>
    <548>   DW_AT_data_member_location: 0
 <2><549>: Abbrev Number: 16 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0x481cf): OwnAddress1
    <54e>   DW_AT_decl_file   : 9
    <54f>   DW_AT_decl_line   : 53
    <550>   DW_AT_decl_column : 12
    <551>   DW_AT_type        : <0xe2>
    <555>   DW_AT_data_member_location: 4
 <2><556>: Abbrev Number: 16 (DW_TAG_member)
    <557>   DW_AT_name        : (indirect string, offset: 0x54ef9): AddressingMode
    <55b>   DW_AT_decl_file   : 9
    <55c>   DW_AT_decl_line   : 56
    <55d>   DW_AT_decl_column : 12
    <55e>   DW_AT_type        : <0xe2>
    <562>   DW_AT_data_member_location: 8
 <2><563>: Abbrev Number: 16 (DW_TAG_member)
    <564>   DW_AT_name        : (indirect string, offset: 0x90303): DualAddressMode
    <568>   DW_AT_decl_file   : 9
    <569>   DW_AT_decl_line   : 59
    <56a>   DW_AT_decl_column : 12
    <56b>   DW_AT_type        : <0xe2>
    <56f>   DW_AT_data_member_location: 12
 <2><570>: Abbrev Number: 16 (DW_TAG_member)
    <571>   DW_AT_name        : (indirect string, offset: 0x481db): OwnAddress2
    <575>   DW_AT_decl_file   : 9
    <576>   DW_AT_decl_line   : 62
    <577>   DW_AT_decl_column : 12
    <578>   DW_AT_type        : <0xe2>
    <57c>   DW_AT_data_member_location: 16
 <2><57d>: Abbrev Number: 16 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0x563d5): OwnAddress2Masks
    <582>   DW_AT_decl_file   : 9
    <583>   DW_AT_decl_line   : 65
    <584>   DW_AT_decl_column : 12
    <585>   DW_AT_type        : <0xe2>
    <589>   DW_AT_data_member_location: 20
 <2><58a>: Abbrev Number: 16 (DW_TAG_member)
    <58b>   DW_AT_name        : (indirect string, offset: 0x20789): GeneralCallMode
    <58f>   DW_AT_decl_file   : 9
    <590>   DW_AT_decl_line   : 69
    <591>   DW_AT_decl_column : 12
    <592>   DW_AT_type        : <0xe2>
    <596>   DW_AT_data_member_location: 24
 <2><597>: Abbrev Number: 16 (DW_TAG_member)
    <598>   DW_AT_name        : (indirect string, offset: 0x3d0b2): NoStretchMode
    <59c>   DW_AT_decl_file   : 9
    <59d>   DW_AT_decl_line   : 72
    <59e>   DW_AT_decl_column : 12
    <59f>   DW_AT_type        : <0xe2>
    <5a3>   DW_AT_data_member_location: 28
 <2><5a4>: Abbrev Number: 0
 <1><5a5>: Abbrev Number: 3 (DW_TAG_typedef)
    <5a6>   DW_AT_name        : (indirect string, offset: 0x3f782): I2C_InitTypeDef
    <5aa>   DW_AT_decl_file   : 9
    <5ab>   DW_AT_decl_line   : 75
    <5ac>   DW_AT_decl_column : 3
    <5ad>   DW_AT_type        : <0x533>
 <1><5b1>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <5b2>   DW_AT_encoding    : 7	(unsigned)
    <5b3>   DW_AT_byte_size   : 1
    <5b4>   DW_AT_type        : <0x3c>
    <5b8>   DW_AT_decl_file   : 9
    <5b9>   DW_AT_decl_line   : 109
    <5ba>   DW_AT_decl_column : 1
    <5bb>   DW_AT_sibling     : <0x602>
 <2><5bf>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5c0>   DW_AT_name        : (indirect string, offset: 0x3eb8b): HAL_I2C_STATE_RESET
    <5c4>   DW_AT_const_value : 0
 <2><5c5>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5c6>   DW_AT_name        : (indirect string, offset: 0x40786): HAL_I2C_STATE_READY
    <5ca>   DW_AT_const_value : 32
 <2><5cb>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5cc>   DW_AT_name        : (indirect string, offset: 0x39a0e): HAL_I2C_STATE_BUSY
    <5d0>   DW_AT_const_value : 36
 <2><5d1>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5d2>   DW_AT_name        : (indirect string, offset: 0xbe0ec): HAL_I2C_STATE_BUSY_TX
    <5d6>   DW_AT_const_value : 33
 <2><5d7>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5d8>   DW_AT_name        : (indirect string, offset: 0x123ad): HAL_I2C_STATE_BUSY_RX
    <5dc>   DW_AT_const_value : 34
 <2><5dd>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5de>   DW_AT_name        : (indirect string, offset: 0x4f28b): HAL_I2C_STATE_LISTEN
    <5e2>   DW_AT_const_value : 40
 <2><5e3>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x2fd58): HAL_I2C_STATE_BUSY_TX_LISTEN
    <5e8>   DW_AT_const_value : 41
 <2><5e9>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x8aa84): HAL_I2C_STATE_BUSY_RX_LISTEN
    <5ee>   DW_AT_const_value : 42
 <2><5ef>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5f0>   DW_AT_name        : (indirect string, offset: 0x37297): HAL_I2C_STATE_ABORT
    <5f4>   DW_AT_const_value : 96
 <2><5f5>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5f6>   DW_AT_name        : (indirect string, offset: 0xa7858): HAL_I2C_STATE_TIMEOUT
    <5fa>   DW_AT_const_value : 160
 <2><5fb>: Abbrev Number: 14 (DW_TAG_enumerator)
    <5fc>   DW_AT_name        : (indirect string, offset: 0xb5bd4): HAL_I2C_STATE_ERROR
    <600>   DW_AT_const_value : 224
 <2><601>: Abbrev Number: 0
 <1><602>: Abbrev Number: 3 (DW_TAG_typedef)
    <603>   DW_AT_name        : (indirect string, offset: 0x21594): HAL_I2C_StateTypeDef
    <607>   DW_AT_decl_file   : 9
    <608>   DW_AT_decl_line   : 124
    <609>   DW_AT_decl_column : 3
    <60a>   DW_AT_type        : <0x5b1>
 <1><60e>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <60f>   DW_AT_type        : <0x602>
 <1><613>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <614>   DW_AT_encoding    : 7	(unsigned)
    <615>   DW_AT_byte_size   : 1
    <616>   DW_AT_type        : <0x3c>
    <61a>   DW_AT_decl_file   : 9
    <61b>   DW_AT_decl_line   : 149
    <61c>   DW_AT_decl_column : 1
    <61d>   DW_AT_sibling     : <0x63a>
 <2><621>: Abbrev Number: 14 (DW_TAG_enumerator)
    <622>   DW_AT_name        : (indirect string, offset: 0x345e3): HAL_I2C_MODE_NONE
    <626>   DW_AT_const_value : 0
 <2><627>: Abbrev Number: 14 (DW_TAG_enumerator)
    <628>   DW_AT_name        : (indirect string, offset: 0x6af06): HAL_I2C_MODE_MASTER
    <62c>   DW_AT_const_value : 16
 <2><62d>: Abbrev Number: 14 (DW_TAG_enumerator)
    <62e>   DW_AT_name        : (indirect string, offset: 0x64455): HAL_I2C_MODE_SLAVE
    <632>   DW_AT_const_value : 32
 <2><633>: Abbrev Number: 14 (DW_TAG_enumerator)
    <634>   DW_AT_name        : (indirect string, offset: 0x3efeb): HAL_I2C_MODE_MEM
    <638>   DW_AT_const_value : 64
 <2><639>: Abbrev Number: 0
 <1><63a>: Abbrev Number: 3 (DW_TAG_typedef)
    <63b>   DW_AT_name        : (indirect string, offset: 0x61064): HAL_I2C_ModeTypeDef
    <63f>   DW_AT_decl_file   : 9
    <640>   DW_AT_decl_line   : 155
    <641>   DW_AT_decl_column : 3
    <642>   DW_AT_type        : <0x613>
 <1><646>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <647>   DW_AT_type        : <0x63a>
 <1><64b>: Abbrev Number: 17 (DW_TAG_structure_type)
    <64c>   DW_AT_name        : (indirect string, offset: 0x14e48): __I2C_HandleTypeDef
    <650>   DW_AT_byte_size   : 84
    <651>   DW_AT_decl_file   : 9
    <652>   DW_AT_decl_line   : 186
    <653>   DW_AT_decl_column : 16
    <654>   DW_AT_sibling     : <0x736>
 <2><658>: Abbrev Number: 16 (DW_TAG_member)
    <659>   DW_AT_name        : (indirect string, offset: 0xa3beb): Instance
    <65d>   DW_AT_decl_file   : 9
    <65e>   DW_AT_decl_line   : 188
    <65f>   DW_AT_decl_column : 31
    <660>   DW_AT_type        : <0x736>
    <664>   DW_AT_data_member_location: 0
 <2><665>: Abbrev Number: 16 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0xd2aca): Init
    <66a>   DW_AT_decl_file   : 9
    <66b>   DW_AT_decl_line   : 190
    <66c>   DW_AT_decl_column : 30
    <66d>   DW_AT_type        : <0x5a5>
    <671>   DW_AT_data_member_location: 4
 <2><672>: Abbrev Number: 16 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0x13209): pBuffPtr
    <677>   DW_AT_decl_file   : 9
    <678>   DW_AT_decl_line   : 192
    <679>   DW_AT_decl_column : 31
    <67a>   DW_AT_type        : <0x73c>
    <67e>   DW_AT_data_member_location: 36
 <2><67f>: Abbrev Number: 16 (DW_TAG_member)
    <680>   DW_AT_name        : (indirect string, offset: 0x63e6d): XferSize
    <684>   DW_AT_decl_file   : 9
    <685>   DW_AT_decl_line   : 194
    <686>   DW_AT_decl_column : 30
    <687>   DW_AT_type        : <0xd1>
    <68b>   DW_AT_data_member_location: 40
 <2><68c>: Abbrev Number: 16 (DW_TAG_member)
    <68d>   DW_AT_name        : (indirect string, offset: 0x785fa): XferCount
    <691>   DW_AT_decl_file   : 9
    <692>   DW_AT_decl_line   : 196
    <693>   DW_AT_decl_column : 30
    <694>   DW_AT_type        : <0xdd>
    <698>   DW_AT_data_member_location: 42
 <2><699>: Abbrev Number: 16 (DW_TAG_member)
    <69a>   DW_AT_name        : (indirect string, offset: 0xd0f8e): XferOptions
    <69e>   DW_AT_decl_file   : 9
    <69f>   DW_AT_decl_line   : 198
    <6a0>   DW_AT_decl_column : 30
    <6a1>   DW_AT_type        : <0xee>
    <6a5>   DW_AT_data_member_location: 44
 <2><6a6>: Abbrev Number: 16 (DW_TAG_member)
    <6a7>   DW_AT_name        : (indirect string, offset: 0x58e09): PreviousState
    <6ab>   DW_AT_decl_file   : 9
    <6ac>   DW_AT_decl_line   : 201
    <6ad>   DW_AT_decl_column : 30
    <6ae>   DW_AT_type        : <0xee>
    <6b2>   DW_AT_data_member_location: 48
 <2><6b3>: Abbrev Number: 16 (DW_TAG_member)
    <6b4>   DW_AT_name        : (indirect string, offset: 0x7288b): XferISR
    <6b8>   DW_AT_decl_file   : 9
    <6b9>   DW_AT_decl_line   : 203
    <6ba>   DW_AT_decl_column : 22
    <6bb>   DW_AT_type        : <0x761>
    <6bf>   DW_AT_data_member_location: 52
 <2><6c0>: Abbrev Number: 16 (DW_TAG_member)
    <6c1>   DW_AT_name        : (indirect string, offset: 0xa4a50): hdmatx
    <6c5>   DW_AT_decl_file   : 9
    <6c6>   DW_AT_decl_line   : 206
    <6c7>   DW_AT_decl_column : 31
    <6c8>   DW_AT_type        : <0x767>
    <6cc>   DW_AT_data_member_location: 56
 <2><6cd>: Abbrev Number: 16 (DW_TAG_member)
    <6ce>   DW_AT_name        : (indirect string, offset: 0xc2e88): hdmarx
    <6d2>   DW_AT_decl_file   : 9
    <6d3>   DW_AT_decl_line   : 208
    <6d4>   DW_AT_decl_column : 31
    <6d5>   DW_AT_type        : <0x767>
    <6d9>   DW_AT_data_member_location: 60
 <2><6da>: Abbrev Number: 16 (DW_TAG_member)
    <6db>   DW_AT_name        : (indirect string, offset: 0x8f173): Lock
    <6df>   DW_AT_decl_file   : 9
    <6e0>   DW_AT_decl_line   : 210
    <6e1>   DW_AT_decl_column : 30
    <6e2>   DW_AT_type        : <0x398>
    <6e6>   DW_AT_data_member_location: 64
 <2><6e7>: Abbrev Number: 16 (DW_TAG_member)
    <6e8>   DW_AT_name        : (indirect string, offset: 0xd3b2d): State
    <6ec>   DW_AT_decl_file   : 9
    <6ed>   DW_AT_decl_line   : 212
    <6ee>   DW_AT_decl_column : 30
    <6ef>   DW_AT_type        : <0x60e>
    <6f3>   DW_AT_data_member_location: 65
 <2><6f4>: Abbrev Number: 16 (DW_TAG_member)
    <6f5>   DW_AT_name        : (indirect string, offset: 0xd1e62): Mode
    <6f9>   DW_AT_decl_file   : 9
    <6fa>   DW_AT_decl_line   : 214
    <6fb>   DW_AT_decl_column : 30
    <6fc>   DW_AT_type        : <0x646>
    <700>   DW_AT_data_member_location: 66
 <2><701>: Abbrev Number: 16 (DW_TAG_member)
    <702>   DW_AT_name        : (indirect string, offset: 0xc46e9): ErrorCode
    <706>   DW_AT_decl_file   : 9
    <707>   DW_AT_decl_line   : 216
    <708>   DW_AT_decl_column : 30
    <709>   DW_AT_type        : <0xee>
    <70d>   DW_AT_data_member_location: 68
 <2><70e>: Abbrev Number: 16 (DW_TAG_member)
    <70f>   DW_AT_name        : (indirect string, offset: 0xa676): AddrEventCount
    <713>   DW_AT_decl_file   : 9
    <714>   DW_AT_decl_line   : 218
    <715>   DW_AT_decl_column : 30
    <716>   DW_AT_type        : <0xee>
    <71a>   DW_AT_data_member_location: 72
 <2><71b>: Abbrev Number: 16 (DW_TAG_member)
    <71c>   DW_AT_name        : (indirect string, offset: 0x82399): Devaddress
    <720>   DW_AT_decl_file   : 9
    <721>   DW_AT_decl_line   : 220
    <722>   DW_AT_decl_column : 30
    <723>   DW_AT_type        : <0xee>
    <727>   DW_AT_data_member_location: 76
 <2><728>: Abbrev Number: 16 (DW_TAG_member)
    <729>   DW_AT_name        : (indirect string, offset: 0x7a879): Memaddress
    <72d>   DW_AT_decl_file   : 9
    <72e>   DW_AT_decl_line   : 222
    <72f>   DW_AT_decl_column : 30
    <730>   DW_AT_type        : <0xee>
    <734>   DW_AT_data_member_location: 80
 <2><735>: Abbrev Number: 0
 <1><736>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <737>   DW_AT_byte_size   : 4
    <738>   DW_AT_type        : <0x253>
 <1><73c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <73d>   DW_AT_byte_size   : 4
    <73e>   DW_AT_type        : <0xc0>
 <1><742>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <743>   DW_AT_prototyped  : 1
    <743>   DW_AT_type        : <0x371>
    <747>   DW_AT_sibling     : <0x75b>
 <2><74b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <74c>   DW_AT_type        : <0x75b>
 <2><750>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <751>   DW_AT_type        : <0xe2>
 <2><755>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <756>   DW_AT_type        : <0xe2>
 <2><75a>: Abbrev Number: 0
 <1><75b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <75c>   DW_AT_byte_size   : 4
    <75d>   DW_AT_type        : <0x64b>
 <1><761>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <762>   DW_AT_byte_size   : 4
    <763>   DW_AT_type        : <0x742>
 <1><767>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <768>   DW_AT_byte_size   : 4
    <769>   DW_AT_type        : <0x527>
 <1><76d>: Abbrev Number: 3 (DW_TAG_typedef)
    <76e>   DW_AT_name        : (indirect string, offset: 0x14e4a): I2C_HandleTypeDef
    <772>   DW_AT_decl_file   : 9
    <773>   DW_AT_decl_line   : 253
    <774>   DW_AT_decl_column : 3
    <775>   DW_AT_type        : <0x64b>
 <1><779>: Abbrev Number: 15 (DW_TAG_structure_type)
    <77a>   DW_AT_byte_size   : 32
    <77b>   DW_AT_decl_file   : 10
    <77c>   DW_AT_decl_line   : 46
    <77d>   DW_AT_decl_column : 9
    <77e>   DW_AT_sibling     : <0x7eb>
 <2><782>: Abbrev Number: 16 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0xb764d): BaudRate
    <787>   DW_AT_decl_file   : 10
    <788>   DW_AT_decl_line   : 48
    <789>   DW_AT_decl_column : 12
    <78a>   DW_AT_type        : <0xe2>
    <78e>   DW_AT_data_member_location: 0
 <2><78f>: Abbrev Number: 16 (DW_TAG_member)
    <790>   DW_AT_name        : (indirect string, offset: 0x5f80): WordLength
    <794>   DW_AT_decl_file   : 10
    <795>   DW_AT_decl_line   : 68
    <796>   DW_AT_decl_column : 12
    <797>   DW_AT_type        : <0xe2>
    <79b>   DW_AT_data_member_location: 4
 <2><79c>: Abbrev Number: 16 (DW_TAG_member)
    <79d>   DW_AT_name        : (indirect string, offset: 0xb7993): StopBits
    <7a1>   DW_AT_decl_file   : 10
    <7a2>   DW_AT_decl_line   : 71
    <7a3>   DW_AT_decl_column : 12
    <7a4>   DW_AT_type        : <0xe2>
    <7a8>   DW_AT_data_member_location: 8
 <2><7a9>: Abbrev Number: 16 (DW_TAG_member)
    <7aa>   DW_AT_name        : (indirect string, offset: 0x38e2a): Parity
    <7ae>   DW_AT_decl_file   : 10
    <7af>   DW_AT_decl_line   : 74
    <7b0>   DW_AT_decl_column : 12
    <7b1>   DW_AT_type        : <0xe2>
    <7b5>   DW_AT_data_member_location: 12
 <2><7b6>: Abbrev Number: 16 (DW_TAG_member)
    <7b7>   DW_AT_name        : (indirect string, offset: 0xd1e62): Mode
    <7bb>   DW_AT_decl_file   : 10
    <7bc>   DW_AT_decl_line   : 81
    <7bd>   DW_AT_decl_column : 12
    <7be>   DW_AT_type        : <0xe2>
    <7c2>   DW_AT_data_member_location: 16
 <2><7c3>: Abbrev Number: 16 (DW_TAG_member)
    <7c4>   DW_AT_name        : (indirect string, offset: 0x6c000): HwFlowCtl
    <7c8>   DW_AT_decl_file   : 10
    <7c9>   DW_AT_decl_line   : 84
    <7ca>   DW_AT_decl_column : 12
    <7cb>   DW_AT_type        : <0xe2>
    <7cf>   DW_AT_data_member_location: 20
 <2><7d0>: Abbrev Number: 16 (DW_TAG_member)
    <7d1>   DW_AT_name        : (indirect string, offset: 0xa8643): OverSampling
    <7d5>   DW_AT_decl_file   : 10
    <7d6>   DW_AT_decl_line   : 88
    <7d7>   DW_AT_decl_column : 12
    <7d8>   DW_AT_type        : <0xe2>
    <7dc>   DW_AT_data_member_location: 24
 <2><7dd>: Abbrev Number: 16 (DW_TAG_member)
    <7de>   DW_AT_name        : (indirect string, offset: 0x28699): OneBitSampling
    <7e2>   DW_AT_decl_file   : 10
    <7e3>   DW_AT_decl_line   : 92
    <7e4>   DW_AT_decl_column : 12
    <7e5>   DW_AT_type        : <0xe2>
    <7e9>   DW_AT_data_member_location: 28
 <2><7ea>: Abbrev Number: 0
 <1><7eb>: Abbrev Number: 3 (DW_TAG_typedef)
    <7ec>   DW_AT_name        : (indirect string, offset: 0x38029): UART_InitTypeDef
    <7f0>   DW_AT_decl_file   : 10
    <7f1>   DW_AT_decl_line   : 101
    <7f2>   DW_AT_decl_column : 3
    <7f3>   DW_AT_type        : <0x779>
 <1><7f7>: Abbrev Number: 15 (DW_TAG_structure_type)
    <7f8>   DW_AT_byte_size   : 40
    <7f9>   DW_AT_decl_file   : 10
    <7fa>   DW_AT_decl_line   : 106
    <7fb>   DW_AT_decl_column : 9
    <7fc>   DW_AT_sibling     : <0x883>
 <2><800>: Abbrev Number: 16 (DW_TAG_member)
    <801>   DW_AT_name        : (indirect string, offset: 0x2707c): AdvFeatureInit
    <805>   DW_AT_decl_file   : 10
    <806>   DW_AT_decl_line   : 108
    <807>   DW_AT_decl_column : 12
    <808>   DW_AT_type        : <0xe2>
    <80c>   DW_AT_data_member_location: 0
 <2><80d>: Abbrev Number: 16 (DW_TAG_member)
    <80e>   DW_AT_name        : (indirect string, offset: 0xbace0): TxPinLevelInvert
    <812>   DW_AT_decl_file   : 10
    <813>   DW_AT_decl_line   : 113
    <814>   DW_AT_decl_column : 12
    <815>   DW_AT_type        : <0xe2>
    <819>   DW_AT_data_member_location: 4
 <2><81a>: Abbrev Number: 16 (DW_TAG_member)
    <81b>   DW_AT_name        : (indirect string, offset: 0xa8921): RxPinLevelInvert
    <81f>   DW_AT_decl_file   : 10
    <820>   DW_AT_decl_line   : 116
    <821>   DW_AT_decl_column : 12
    <822>   DW_AT_type        : <0xe2>
    <826>   DW_AT_data_member_location: 8
 <2><827>: Abbrev Number: 16 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0x874de): DataInvert
    <82c>   DW_AT_decl_file   : 10
    <82d>   DW_AT_decl_line   : 119
    <82e>   DW_AT_decl_column : 12
    <82f>   DW_AT_type        : <0xe2>
    <833>   DW_AT_data_member_location: 12
 <2><834>: Abbrev Number: 16 (DW_TAG_member)
    <835>   DW_AT_name        : (indirect string, offset: 0x3f6af): Swap
    <839>   DW_AT_decl_file   : 10
    <83a>   DW_AT_decl_line   : 123
    <83b>   DW_AT_decl_column : 12
    <83c>   DW_AT_type        : <0xe2>
    <840>   DW_AT_data_member_location: 16
 <2><841>: Abbrev Number: 16 (DW_TAG_member)
    <842>   DW_AT_name        : (indirect string, offset: 0x27297): OverrunDisable
    <846>   DW_AT_decl_file   : 10
    <847>   DW_AT_decl_line   : 126
    <848>   DW_AT_decl_column : 12
    <849>   DW_AT_type        : <0xe2>
    <84d>   DW_AT_data_member_location: 20
 <2><84e>: Abbrev Number: 16 (DW_TAG_member)
    <84f>   DW_AT_name        : (indirect string, offset: 0x74ef): DMADisableonRxError
    <853>   DW_AT_decl_file   : 10
    <854>   DW_AT_decl_line   : 129
    <855>   DW_AT_decl_column : 12
    <856>   DW_AT_type        : <0xe2>
    <85a>   DW_AT_data_member_location: 24
 <2><85b>: Abbrev Number: 16 (DW_TAG_member)
    <85c>   DW_AT_name        : (indirect string, offset: 0xb594d): AutoBaudRateEnable
    <860>   DW_AT_decl_file   : 10
    <861>   DW_AT_decl_line   : 132
    <862>   DW_AT_decl_column : 12
    <863>   DW_AT_type        : <0xe2>
    <867>   DW_AT_data_member_location: 28
 <2><868>: Abbrev Number: 16 (DW_TAG_member)
    <869>   DW_AT_name        : (indirect string, offset: 0xc46d8): AutoBaudRateMode
    <86d>   DW_AT_decl_file   : 10
    <86e>   DW_AT_decl_line   : 135
    <86f>   DW_AT_decl_column : 12
    <870>   DW_AT_type        : <0xe2>
    <874>   DW_AT_data_member_location: 32
 <2><875>: Abbrev Number: 16 (DW_TAG_member)
    <876>   DW_AT_name        : (indirect string, offset: 0x58887): MSBFirst
    <87a>   DW_AT_decl_file   : 10
    <87b>   DW_AT_decl_line   : 139
    <87c>   DW_AT_decl_column : 12
    <87d>   DW_AT_type        : <0xe2>
    <881>   DW_AT_data_member_location: 36
 <2><882>: Abbrev Number: 0
 <1><883>: Abbrev Number: 3 (DW_TAG_typedef)
    <884>   DW_AT_name        : (indirect string, offset: 0x9547f): UART_AdvFeatureInitTypeDef
    <888>   DW_AT_decl_file   : 10
    <889>   DW_AT_decl_line   : 141
    <88a>   DW_AT_decl_column : 3
    <88b>   DW_AT_type        : <0x7f7>
 <1><88f>: Abbrev Number: 3 (DW_TAG_typedef)
    <890>   DW_AT_name        : (indirect string, offset: 0x3cabb): HAL_UART_StateTypeDef
    <894>   DW_AT_decl_file   : 10
    <895>   DW_AT_decl_line   : 183
    <896>   DW_AT_decl_column : 18
    <897>   DW_AT_type        : <0xe2>
 <1><89b>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <89c>   DW_AT_type        : <0x88f>
 <1><8a0>: Abbrev Number: 3 (DW_TAG_typedef)
    <8a1>   DW_AT_name        : (indirect string, offset: 0x51bca): HAL_UART_RxTypeTypeDef
    <8a5>   DW_AT_decl_file   : 10
    <8a6>   DW_AT_decl_line   : 207
    <8a7>   DW_AT_decl_column : 18
    <8a8>   DW_AT_type        : <0xe2>
 <1><8ac>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <8ad>   DW_AT_type        : <0x8a0>
 <1><8b1>: Abbrev Number: 17 (DW_TAG_structure_type)
    <8b2>   DW_AT_name        : (indirect string, offset: 0x74263): __UART_HandleTypeDef
    <8b6>   DW_AT_byte_size   : 132
    <8b7>   DW_AT_decl_file   : 10
    <8b8>   DW_AT_decl_line   : 212
    <8b9>   DW_AT_decl_column : 16
    <8ba>   DW_AT_sibling     : <0x9b8>
 <2><8be>: Abbrev Number: 16 (DW_TAG_member)
    <8bf>   DW_AT_name        : (indirect string, offset: 0xa3beb): Instance
    <8c3>   DW_AT_decl_file   : 10
    <8c4>   DW_AT_decl_line   : 214
    <8c5>   DW_AT_decl_column : 29
    <8c6>   DW_AT_type        : <0x9b8>
    <8ca>   DW_AT_data_member_location: 0
 <2><8cb>: Abbrev Number: 16 (DW_TAG_member)
    <8cc>   DW_AT_name        : (indirect string, offset: 0xd2aca): Init
    <8d0>   DW_AT_decl_file   : 10
    <8d1>   DW_AT_decl_line   : 216
    <8d2>   DW_AT_decl_column : 28
    <8d3>   DW_AT_type        : <0x7eb>
    <8d7>   DW_AT_data_member_location: 4
 <2><8d8>: Abbrev Number: 16 (DW_TAG_member)
    <8d9>   DW_AT_name        : (indirect string, offset: 0x9cb5c): AdvancedInit
    <8dd>   DW_AT_decl_file   : 10
    <8de>   DW_AT_decl_line   : 218
    <8df>   DW_AT_decl_column : 30
    <8e0>   DW_AT_type        : <0x883>
    <8e4>   DW_AT_data_member_location: 36
 <2><8e5>: Abbrev Number: 16 (DW_TAG_member)
    <8e6>   DW_AT_name        : (indirect string, offset: 0x5ff32): pTxBuffPtr
    <8ea>   DW_AT_decl_file   : 10
    <8eb>   DW_AT_decl_line   : 220
    <8ec>   DW_AT_decl_column : 29
    <8ed>   DW_AT_type        : <0x9be>
    <8f1>   DW_AT_data_member_location: 76
 <2><8f2>: Abbrev Number: 16 (DW_TAG_member)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x540bd): TxXferSize
    <8f7>   DW_AT_decl_file   : 10
    <8f8>   DW_AT_decl_line   : 222
    <8f9>   DW_AT_decl_column : 28
    <8fa>   DW_AT_type        : <0xd1>
    <8fe>   DW_AT_data_member_location: 80
 <2><8ff>: Abbrev Number: 16 (DW_TAG_member)
    <900>   DW_AT_name        : (indirect string, offset: 0x610be): TxXferCount
    <904>   DW_AT_decl_file   : 10
    <905>   DW_AT_decl_line   : 224
    <906>   DW_AT_decl_column : 28
    <907>   DW_AT_type        : <0xdd>
    <90b>   DW_AT_data_member_location: 82
 <2><90c>: Abbrev Number: 16 (DW_TAG_member)
    <90d>   DW_AT_name        : (indirect string, offset: 0xba4b7): pRxBuffPtr
    <911>   DW_AT_decl_file   : 10
    <912>   DW_AT_decl_line   : 226
    <913>   DW_AT_decl_column : 29
    <914>   DW_AT_type        : <0x73c>
    <918>   DW_AT_data_member_location: 84
 <2><919>: Abbrev Number: 16 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0x63e6b): RxXferSize
    <91e>   DW_AT_decl_file   : 10
    <91f>   DW_AT_decl_line   : 228
    <920>   DW_AT_decl_column : 28
    <921>   DW_AT_type        : <0xd1>
    <925>   DW_AT_data_member_location: 88
 <2><926>: Abbrev Number: 16 (DW_TAG_member)
    <927>   DW_AT_name        : (indirect string, offset: 0x785f8): RxXferCount
    <92b>   DW_AT_decl_file   : 10
    <92c>   DW_AT_decl_line   : 230
    <92d>   DW_AT_decl_column : 28
    <92e>   DW_AT_type        : <0xdd>
    <932>   DW_AT_data_member_location: 90
 <2><933>: Abbrev Number: 16 (DW_TAG_member)
    <934>   DW_AT_name        : (indirect string, offset: 0xd4053): Mask
    <938>   DW_AT_decl_file   : 10
    <939>   DW_AT_decl_line   : 232
    <93a>   DW_AT_decl_column : 28
    <93b>   DW_AT_type        : <0xd1>
    <93f>   DW_AT_data_member_location: 92
 <2><940>: Abbrev Number: 16 (DW_TAG_member)
    <941>   DW_AT_name        : (indirect string, offset: 0xa79a7): ReceptionType
    <945>   DW_AT_decl_file   : 10
    <946>   DW_AT_decl_line   : 243
    <947>   DW_AT_decl_column : 31
    <948>   DW_AT_type        : <0x8ac>
    <94c>   DW_AT_data_member_location: 96
 <2><94d>: Abbrev Number: 16 (DW_TAG_member)
    <94e>   DW_AT_name        : (indirect string, offset: 0xacd1a): RxISR
    <952>   DW_AT_decl_file   : 10
    <953>   DW_AT_decl_line   : 245
    <954>   DW_AT_decl_column : 10
    <955>   DW_AT_type        : <0x9d5>
    <959>   DW_AT_data_member_location: 100
 <2><95a>: Abbrev Number: 16 (DW_TAG_member)
    <95b>   DW_AT_name        : (indirect string, offset: 0x6496c): TxISR
    <95f>   DW_AT_decl_file   : 10
    <960>   DW_AT_decl_line   : 247
    <961>   DW_AT_decl_column : 10
    <962>   DW_AT_type        : <0x9d5>
    <966>   DW_AT_data_member_location: 104
 <2><967>: Abbrev Number: 16 (DW_TAG_member)
    <968>   DW_AT_name        : (indirect string, offset: 0xa4a50): hdmatx
    <96c>   DW_AT_decl_file   : 10
    <96d>   DW_AT_decl_line   : 249
    <96e>   DW_AT_decl_column : 29
    <96f>   DW_AT_type        : <0x767>
    <973>   DW_AT_data_member_location: 108
 <2><974>: Abbrev Number: 16 (DW_TAG_member)
    <975>   DW_AT_name        : (indirect string, offset: 0xc2e88): hdmarx
    <979>   DW_AT_decl_file   : 10
    <97a>   DW_AT_decl_line   : 251
    <97b>   DW_AT_decl_column : 29
    <97c>   DW_AT_type        : <0x767>
    <980>   DW_AT_data_member_location: 112
 <2><981>: Abbrev Number: 16 (DW_TAG_member)
    <982>   DW_AT_name        : (indirect string, offset: 0x8f173): Lock
    <986>   DW_AT_decl_file   : 10
    <987>   DW_AT_decl_line   : 253
    <988>   DW_AT_decl_column : 29
    <989>   DW_AT_type        : <0x398>
    <98d>   DW_AT_data_member_location: 116
 <2><98e>: Abbrev Number: 16 (DW_TAG_member)
    <98f>   DW_AT_name        : (indirect string, offset: 0x51347): gState
    <993>   DW_AT_decl_file   : 10
    <994>   DW_AT_decl_line   : 255
    <995>   DW_AT_decl_column : 33
    <996>   DW_AT_type        : <0x89b>
    <99a>   DW_AT_data_member_location: 120
 <2><99b>: Abbrev Number: 11 (DW_TAG_member)
    <99c>   DW_AT_name        : (indirect string, offset: 0xb4a9a): RxState
    <9a0>   DW_AT_decl_file   : 10
    <9a1>   DW_AT_decl_line   : 259
    <9a3>   DW_AT_decl_column : 33
    <9a4>   DW_AT_type        : <0x89b>
    <9a8>   DW_AT_data_member_location: 124
 <2><9a9>: Abbrev Number: 11 (DW_TAG_member)
    <9aa>   DW_AT_name        : (indirect string, offset: 0xc46e9): ErrorCode
    <9ae>   DW_AT_decl_file   : 10
    <9af>   DW_AT_decl_line   : 262
    <9b1>   DW_AT_decl_column : 33
    <9b2>   DW_AT_type        : <0xee>
    <9b6>   DW_AT_data_member_location: 128
 <2><9b7>: Abbrev Number: 0
 <1><9b8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9b9>   DW_AT_byte_size   : 4
    <9ba>   DW_AT_type        : <0x33d>
 <1><9be>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9bf>   DW_AT_byte_size   : 4
    <9c0>   DW_AT_type        : <0xcc>
 <1><9c4>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <9c5>   DW_AT_prototyped  : 1
    <9c5>   DW_AT_sibling     : <0x9cf>
 <2><9c9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <9ca>   DW_AT_type        : <0x9cf>
 <2><9ce>: Abbrev Number: 0
 <1><9cf>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9d0>   DW_AT_byte_size   : 4
    <9d1>   DW_AT_type        : <0x8b1>
 <1><9d5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9d6>   DW_AT_byte_size   : 4
    <9d7>   DW_AT_type        : <0x9c4>
 <1><9db>: Abbrev Number: 12 (DW_TAG_typedef)
    <9dc>   DW_AT_name        : (indirect string, offset: 0x74265): UART_HandleTypeDef
    <9e0>   DW_AT_decl_file   : 10
    <9e1>   DW_AT_decl_line   : 284
    <9e3>   DW_AT_decl_column : 3
    <9e4>   DW_AT_type        : <0x8b1>
 <1><9e8>: Abbrev Number: 21 (DW_TAG_variable)
    <9e9>   DW_AT_name        : (indirect string, offset: 0x56d5): hi2c1
    <9ed>   DW_AT_decl_file   : 1
    <9ee>   DW_AT_decl_line   : 4
    <9ef>   DW_AT_decl_column : 26
    <9f0>   DW_AT_type        : <0x76d>
    <9f4>   DW_AT_external    : 1
    <9f4>   DW_AT_declaration : 1
 <1><9f4>: Abbrev Number: 21 (DW_TAG_variable)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x6be74): huart2
    <9f9>   DW_AT_decl_file   : 1
    <9fa>   DW_AT_decl_line   : 6
    <9fb>   DW_AT_decl_column : 27
    <9fc>   DW_AT_type        : <0x9db>
    <a00>   DW_AT_external    : 1
    <a00>   DW_AT_declaration : 1
 <1><a00>: Abbrev Number: 22 (DW_TAG_variable)
    <a01>   DW_AT_name        : (indirect string, offset: 0xce603): status
    <a05>   DW_AT_decl_file   : 1
    <a06>   DW_AT_decl_line   : 8
    <a07>   DW_AT_decl_column : 19
    <a08>   DW_AT_type        : <0xdd>
    <a0c>   DW_AT_external    : 1
    <a0c>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><a12>: Abbrev Number: 22 (DW_TAG_variable)
    <a13>   DW_AT_name        : (indirect string, offset: 0x81375): TIMER_50MS_FLG
    <a17>   DW_AT_decl_file   : 1
    <a18>   DW_AT_decl_line   : 9
    <a19>   DW_AT_decl_column : 15
    <a1a>   DW_AT_type        : <0x119>
    <a1e>   DW_AT_external    : 1
    <a1e>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><a24>: Abbrev Number: 22 (DW_TAG_variable)
    <a25>   DW_AT_name        : (indirect string, offset: 0x869d8): EC_DATA_AVAIL
    <a29>   DW_AT_decl_file   : 1
    <a2a>   DW_AT_decl_line   : 10
    <a2b>   DW_AT_decl_column : 15
    <a2c>   DW_AT_type        : <0x119>
    <a30>   DW_AT_external    : 1
    <a30>   DW_AT_location    : 5 byte block: 3 95 0 0 20 	(DW_OP_addr: 20000095)
 <1><a36>: Abbrev Number: 23 (DW_TAG_subprogram)
    <a37>   DW_AT_external    : 1
    <a37>   DW_AT_name        : (indirect string, offset: 0xbf282): HAL_I2C_Master_Receive
    <a3b>   DW_AT_decl_file   : 9
    <a3c>   DW_AT_decl_line   : 627
    <a3e>   DW_AT_decl_column : 19
    <a3f>   DW_AT_prototyped  : 1
    <a3f>   DW_AT_type        : <0x371>
    <a43>   DW_AT_declaration : 1
    <a43>   DW_AT_sibling     : <0xa61>
 <2><a47>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <a48>   DW_AT_type        : <0xa61>
 <2><a4c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <a4d>   DW_AT_type        : <0xd1>
 <2><a51>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <a52>   DW_AT_type        : <0x73c>
 <2><a56>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <a57>   DW_AT_type        : <0xd1>
 <2><a5b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <a5c>   DW_AT_type        : <0xe2>
 <2><a60>: Abbrev Number: 0
 <1><a61>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a62>   DW_AT_byte_size   : 4
    <a63>   DW_AT_type        : <0x76d>
 <1><a67>: Abbrev Number: 23 (DW_TAG_subprogram)
    <a68>   DW_AT_external    : 1
    <a68>   DW_AT_name        : (indirect string, offset: 0x4cb4f): HAL_I2C_Master_Transmit
    <a6c>   DW_AT_decl_file   : 9
    <a6d>   DW_AT_decl_line   : 625
    <a6f>   DW_AT_decl_column : 19
    <a70>   DW_AT_prototyped  : 1
    <a70>   DW_AT_type        : <0x371>
    <a74>   DW_AT_declaration : 1
    <a74>   DW_AT_sibling     : <0xa92>
 <2><a78>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <a79>   DW_AT_type        : <0xa61>
 <2><a7d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <a7e>   DW_AT_type        : <0xd1>
 <2><a82>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <a83>   DW_AT_type        : <0x73c>
 <2><a87>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <a88>   DW_AT_type        : <0xd1>
 <2><a8c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <a8d>   DW_AT_type        : <0xe2>
 <2><a91>: Abbrev Number: 0
 <1><a92>: Abbrev Number: 24 (DW_TAG_subprogram)
    <a93>   DW_AT_external    : 1
    <a93>   DW_AT_name        : (indirect string, offset: 0x2bb4a): StartI2CTimer
    <a97>   DW_AT_decl_file   : 11
    <a98>   DW_AT_decl_line   : 107
    <a99>   DW_AT_decl_column : 6
    <a9a>   DW_AT_declaration : 1
    <a9a>   DW_AT_sibling     : <0xaa0>
 <2><a9e>: Abbrev Number: 25 (DW_TAG_unspecified_parameters)
 <2><a9f>: Abbrev Number: 0
 <1><aa0>: Abbrev Number: 24 (DW_TAG_subprogram)
    <aa1>   DW_AT_external    : 1
    <aa1>   DW_AT_name        : (indirect string, offset: 0x7975): StopI2CTimer
    <aa5>   DW_AT_decl_file   : 11
    <aa6>   DW_AT_decl_line   : 108
    <aa7>   DW_AT_decl_column : 6
    <aa8>   DW_AT_declaration : 1
    <aa8>   DW_AT_sibling     : <0xaae>
 <2><aac>: Abbrev Number: 25 (DW_TAG_unspecified_parameters)
 <2><aad>: Abbrev Number: 0
 <1><aae>: Abbrev Number: 23 (DW_TAG_subprogram)
    <aaf>   DW_AT_external    : 1
    <aaf>   DW_AT_name        : (indirect string, offset: 0x41cde): HAL_UART_Transmit
    <ab3>   DW_AT_decl_file   : 10
    <ab4>   DW_AT_decl_line   : 1674
    <ab6>   DW_AT_decl_column : 19
    <ab7>   DW_AT_prototyped  : 1
    <ab7>   DW_AT_type        : <0x371>
    <abb>   DW_AT_declaration : 1
    <abb>   DW_AT_sibling     : <0xad4>
 <2><abf>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <ac0>   DW_AT_type        : <0xad4>
 <2><ac4>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <ac5>   DW_AT_type        : <0x9be>
 <2><ac9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <aca>   DW_AT_type        : <0xd1>
 <2><ace>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <acf>   DW_AT_type        : <0xe2>
 <2><ad3>: Abbrev Number: 0
 <1><ad4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ad5>   DW_AT_byte_size   : 4
    <ad6>   DW_AT_type        : <0x9db>
 <1><ada>: Abbrev Number: 26 (DW_TAG_subprogram)
    <adb>   DW_AT_external    : 1
    <adb>   DW_AT_name        : (indirect string, offset: 0x4408a): strlen
    <adf>   DW_AT_decl_file   : 12
    <ae0>   DW_AT_decl_line   : 41
    <ae1>   DW_AT_decl_column : 9
    <ae2>   DW_AT_prototyped  : 1
    <ae2>   DW_AT_type        : <0x93>
    <ae6>   DW_AT_declaration : 1
    <ae6>   DW_AT_sibling     : <0xaf0>
 <2><aea>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <aeb>   DW_AT_type        : <0xba>
 <2><aef>: Abbrev Number: 0
 <1><af0>: Abbrev Number: 26 (DW_TAG_subprogram)
    <af1>   DW_AT_external    : 1
    <af1>   DW_AT_name        : (indirect string, offset: 0x3445f): sprintf
    <af5>   DW_AT_decl_file   : 13
    <af6>   DW_AT_decl_line   : 244
    <af7>   DW_AT_decl_column : 5
    <af8>   DW_AT_prototyped  : 1
    <af8>   DW_AT_type        : <0x85>
    <afc>   DW_AT_declaration : 1
    <afc>   DW_AT_sibling     : <0xb0c>
 <2><b00>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <b01>   DW_AT_type        : <0xa8>
 <2><b05>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <b06>   DW_AT_type        : <0xba>
 <2><b0a>: Abbrev Number: 25 (DW_TAG_unspecified_parameters)
 <2><b0b>: Abbrev Number: 0
 <1><b0c>: Abbrev Number: 27 (DW_TAG_subprogram)
    <b0d>   DW_AT_external    : 1
    <b0d>   DW_AT_name        : (indirect string, offset: 0xb99f6): i2c_cmd_WrRd
    <b11>   DW_AT_decl_file   : 1
    <b12>   DW_AT_decl_line   : 33
    <b13>   DW_AT_decl_column : 7
    <b14>   DW_AT_prototyped  : 1
    <b14>   DW_AT_type        : <0x101>
    <b18>   DW_AT_low_pc      : 0x8000eac
    <b1c>   DW_AT_high_pc     : 0xe8
    <b20>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b22>   DW_AT_GNU_all_tail_call_sites: 1
    <b22>   DW_AT_sibling     : <0xb81>
 <2><b26>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <b27>   DW_AT_name        : (indirect string, offset: 0x4e860): ucCmd
    <b2b>   DW_AT_decl_file   : 1
    <b2c>   DW_AT_decl_line   : 33
    <b2d>   DW_AT_decl_column : 26
    <b2e>   DW_AT_type        : <0x101>
    <b32>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><b35>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <b36>   DW_AT_name        : (indirect string, offset: 0xb18a5): ucBytes_wr
    <b3a>   DW_AT_decl_file   : 1
    <b3b>   DW_AT_decl_line   : 33
    <b3c>   DW_AT_decl_column : 39
    <b3d>   DW_AT_type        : <0x101>
    <b41>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><b44>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <b45>   DW_AT_name        : (indirect string, offset: 0x1958a): ucData_wr
    <b49>   DW_AT_decl_file   : 1
    <b4a>   DW_AT_decl_line   : 33
    <b4b>   DW_AT_decl_column : 58
    <b4c>   DW_AT_type        : <0xb81>
    <b50>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><b53>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <b54>   DW_AT_name        : (indirect string, offset: 0x69146): usBytes_rd
    <b58>   DW_AT_decl_file   : 1
    <b59>   DW_AT_decl_line   : 33
    <b5a>   DW_AT_decl_column : 76
    <b5b>   DW_AT_type        : <0x11e>
    <b5f>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b62>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <b63>   DW_AT_name        : (indirect string, offset: 0x1739e): ucData_rd
    <b67>   DW_AT_decl_file   : 1
    <b68>   DW_AT_decl_line   : 33
    <b69>   DW_AT_decl_column : 95
    <b6a>   DW_AT_type        : <0xb81>
    <b6e>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><b71>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <b72>   DW_AT_name        : (indirect string, offset: 0xa22a8): bAdjust
    <b76>   DW_AT_decl_file   : 1
    <b77>   DW_AT_decl_line   : 33
    <b78>   DW_AT_decl_column : 111
    <b79>   DW_AT_type        : <0x10d>
    <b7d>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><b80>: Abbrev Number: 0
 <1><b81>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b82>   DW_AT_byte_size   : 4
    <b83>   DW_AT_type        : <0x101>
 <1><b87>: Abbrev Number: 29 (DW_TAG_subprogram)
    <b88>   DW_AT_external    : 1
    <b88>   DW_AT_name        : (indirect string, offset: 0xa3c73): error_handler
    <b8c>   DW_AT_decl_file   : 1
    <b8d>   DW_AT_decl_line   : 15
    <b8e>   DW_AT_decl_column : 6
    <b8f>   DW_AT_prototyped  : 1
    <b8f>   DW_AT_low_pc      : 0x8000e5c
    <b93>   DW_AT_high_pc     : 0x50
    <b97>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b99>   DW_AT_GNU_all_tail_call_sites: 1
    <b99>   DW_AT_sibling     : <0xbde>
 <2><b9d>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <b9e>   DW_AT_name        : str
    <ba2>   DW_AT_decl_file   : 1
    <ba3>   DW_AT_decl_line   : 15
    <ba4>   DW_AT_decl_column : 26
    <ba5>   DW_AT_type        : <0xa8>
    <ba9>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><bad>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <bae>   DW_AT_name        : (indirect string, offset: 0xd5789): offset
    <bb2>   DW_AT_decl_file   : 1
    <bb3>   DW_AT_decl_line   : 15
    <bb4>   DW_AT_decl_column : 38
    <bb5>   DW_AT_type        : <0x11e>
    <bb9>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><bbd>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <bbe>   DW_AT_name        : (indirect string, offset: 0xb49dc): errval
    <bc2>   DW_AT_decl_file   : 1
    <bc3>   DW_AT_decl_line   : 15
    <bc4>   DW_AT_decl_column : 53
    <bc5>   DW_AT_type        : <0x11e>
    <bc9>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <2><bcd>: Abbrev Number: 31 (DW_TAG_variable)
    <bce>   DW_AT_name        : (indirect string, offset: 0x52b94): err_buf
    <bd2>   DW_AT_decl_file   : 1
    <bd3>   DW_AT_decl_line   : 16
    <bd4>   DW_AT_decl_column : 7
    <bd5>   DW_AT_type        : <0xbde>
    <bd9>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><bdd>: Abbrev Number: 0
 <1><bde>: Abbrev Number: 32 (DW_TAG_array_type)
    <bdf>   DW_AT_type        : <0xae>
 <2><be3>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <be4>   DW_AT_type        : <0x8c>
    <be8>   DW_AT_upper_bound : 63
 <2><be9>: Abbrev Number: 0
 <1><bea>: Abbrev Number: 0
  Compilation Unit @ offset 0xbeb:
   Length:        0x182 (32-bit)
   Version:       4
   Abbrev Offset: 0x1eb
   Pointer Size:  4
 <0><bf6>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <bf7>   DW_AT_producer    : (indirect string, offset: 0x358fb): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <bfb>   DW_AT_language    : 12	(ANSI C99)
    <bfc>   DW_AT_name        : (indirect string, offset: 0xcc9d6): ../Core/MikroeSDK_3D-Motion/interrupts.c
    <c00>   DW_AT_comp_dir    : (indirect string, offset: 0xb43c): C:/Users/pjura/Desktop/dev/stm32/embsys_bubble-level/Source/nucleo-l432kc_3d-motion/Debug
    <c04>   DW_AT_ranges      : 0x18
    <c08>   DW_AT_low_pc      : 0x0
    <c0c>   DW_AT_stmt_list   : 0xa21
    <c10>   DW_AT_GNU_macros  : 0x42e
 <1><c14>: Abbrev Number: 2 (DW_TAG_base_type)
    <c15>   DW_AT_byte_size   : 1
    <c16>   DW_AT_encoding    : 6	(signed char)
    <c17>   DW_AT_name        : (indirect string, offset: 0x64980): signed char
 <1><c1b>: Abbrev Number: 2 (DW_TAG_base_type)
    <c1c>   DW_AT_byte_size   : 1
    <c1d>   DW_AT_encoding    : 8	(unsigned char)
    <c1e>   DW_AT_name        : (indirect string, offset: 0xc1f9b): unsigned char
 <1><c22>: Abbrev Number: 2 (DW_TAG_base_type)
    <c23>   DW_AT_byte_size   : 2
    <c24>   DW_AT_encoding    : 5	(signed)
    <c25>   DW_AT_name        : (indirect string, offset: 0x95302): short int
 <1><c29>: Abbrev Number: 2 (DW_TAG_base_type)
    <c2a>   DW_AT_byte_size   : 2
    <c2b>   DW_AT_encoding    : 7	(unsigned)
    <c2c>   DW_AT_name        : (indirect string, offset: 0xc075e): short unsigned int
 <1><c30>: Abbrev Number: 2 (DW_TAG_base_type)
    <c31>   DW_AT_byte_size   : 4
    <c32>   DW_AT_encoding    : 5	(signed)
    <c33>   DW_AT_name        : (indirect string, offset: 0x11394): long int
 <1><c37>: Abbrev Number: 3 (DW_TAG_typedef)
    <c38>   DW_AT_name        : (indirect string, offset: 0x7fe1a): __uint32_t
    <c3c>   DW_AT_decl_file   : 2
    <c3d>   DW_AT_decl_line   : 79
    <c3e>   DW_AT_decl_column : 25
    <c3f>   DW_AT_type        : <0xc43>
 <1><c43>: Abbrev Number: 2 (DW_TAG_base_type)
    <c44>   DW_AT_byte_size   : 4
    <c45>   DW_AT_encoding    : 7	(unsigned)
    <c46>   DW_AT_name        : (indirect string, offset: 0x3d754): long unsigned int
 <1><c4a>: Abbrev Number: 2 (DW_TAG_base_type)
    <c4b>   DW_AT_byte_size   : 8
    <c4c>   DW_AT_encoding    : 5	(signed)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x5b6d8): long long int
 <1><c51>: Abbrev Number: 2 (DW_TAG_base_type)
    <c52>   DW_AT_byte_size   : 8
    <c53>   DW_AT_encoding    : 7	(unsigned)
    <c54>   DW_AT_name        : (indirect string, offset: 0x297c8): long long unsigned int
 <1><c58>: Abbrev Number: 4 (DW_TAG_base_type)
    <c59>   DW_AT_byte_size   : 4
    <c5a>   DW_AT_encoding    : 5	(signed)
    <c5b>   DW_AT_name        : int
 <1><c5f>: Abbrev Number: 2 (DW_TAG_base_type)
    <c60>   DW_AT_byte_size   : 4
    <c61>   DW_AT_encoding    : 7	(unsigned)
    <c62>   DW_AT_name        : (indirect string, offset: 0x10af7): unsigned int
 <1><c66>: Abbrev Number: 2 (DW_TAG_base_type)
    <c67>   DW_AT_byte_size   : 8
    <c68>   DW_AT_encoding    : 4	(float)
    <c69>   DW_AT_name        : (indirect string, offset: 0x12a99): long double
 <1><c6d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <c6e>   DW_AT_byte_size   : 4
 <1><c6f>: Abbrev Number: 2 (DW_TAG_base_type)
    <c70>   DW_AT_byte_size   : 1
    <c71>   DW_AT_encoding    : 8	(unsigned char)
    <c72>   DW_AT_name        : (indirect string, offset: 0xcaedf): char
 <1><c76>: Abbrev Number: 3 (DW_TAG_typedef)
    <c77>   DW_AT_name        : (indirect string, offset: 0xccbdb): uint32_t
    <c7b>   DW_AT_decl_file   : 3
    <c7c>   DW_AT_decl_line   : 48
    <c7d>   DW_AT_decl_column : 20
    <c7e>   DW_AT_type        : <0xc37>
 <1><c82>: Abbrev Number: 2 (DW_TAG_base_type)
    <c83>   DW_AT_byte_size   : 4
    <c84>   DW_AT_encoding    : 4	(float)
    <c85>   DW_AT_name        : (indirect string, offset: 0xc9804): float
 <1><c89>: Abbrev Number: 2 (DW_TAG_base_type)
    <c8a>   DW_AT_byte_size   : 8
    <c8b>   DW_AT_encoding    : 4	(float)
    <c8c>   DW_AT_name        : (indirect string, offset: 0xca07d): double
 <1><c90>: Abbrev Number: 3 (DW_TAG_typedef)
    <c91>   DW_AT_name        : (indirect string, offset: 0xcb247): UINT32
    <c95>   DW_AT_decl_file   : 4
    <c96>   DW_AT_decl_line   : 32
    <c97>   DW_AT_decl_column : 23
    <c98>   DW_AT_type        : <0xc43>
 <1><c9c>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <c9d>   DW_AT_type        : <0xc90>
 <1><ca1>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <ca2>   DW_AT_encoding    : 5	(signed)
    <ca3>   DW_AT_byte_size   : 4
    <ca4>   DW_AT_type        : <0xc58>
    <ca8>   DW_AT_decl_file   : 5
    <ca9>   DW_AT_decl_line   : 176
    <caa>   DW_AT_decl_column : 14
    <cab>   DW_AT_sibling     : <0xce3>
 <2><caf>: Abbrev Number: 8 (DW_TAG_enumerator)
    <cb0>   DW_AT_name        : (indirect string, offset: 0xcced2): osOK
    <cb4>   DW_AT_const_value : 0
 <2><cb5>: Abbrev Number: 9 (DW_TAG_enumerator)
    <cb6>   DW_AT_name        : (indirect string, offset: 0xcb956): osError
    <cba>   DW_AT_const_value : -1
 <2><cbb>: Abbrev Number: 9 (DW_TAG_enumerator)
    <cbc>   DW_AT_name        : (indirect string, offset: 0xcc7b6): osErrorTimeout
    <cc0>   DW_AT_const_value : -2
 <2><cc1>: Abbrev Number: 9 (DW_TAG_enumerator)
    <cc2>   DW_AT_name        : (indirect string, offset: 0xcc6dc): osErrorResource
    <cc6>   DW_AT_const_value : -3
 <2><cc7>: Abbrev Number: 9 (DW_TAG_enumerator)
    <cc8>   DW_AT_name        : (indirect string, offset: 0xcaacd): osErrorParameter
    <ccc>   DW_AT_const_value : -4
 <2><ccd>: Abbrev Number: 9 (DW_TAG_enumerator)
    <cce>   DW_AT_name        : (indirect string, offset: 0xca3d0): osErrorNoMemory
    <cd2>   DW_AT_const_value : -5
 <2><cd3>: Abbrev Number: 9 (DW_TAG_enumerator)
    <cd4>   DW_AT_name        : (indirect string, offset: 0xccfdb): osErrorISR
    <cd8>   DW_AT_const_value : -6
 <2><cd9>: Abbrev Number: 10 (DW_TAG_enumerator)
    <cda>   DW_AT_name        : (indirect string, offset: 0xcbbca): osStatusReserved
    <cde>   DW_AT_const_value : 0x7fffffff
 <2><ce2>: Abbrev Number: 0
 <1><ce3>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce4>   DW_AT_name        : (indirect string, offset: 0xcb07f): osStatus_t
    <ce8>   DW_AT_decl_file   : 5
    <ce9>   DW_AT_decl_line   : 185
    <cea>   DW_AT_decl_column : 3
    <ceb>   DW_AT_type        : <0xca1>
 <1><cef>: Abbrev Number: 3 (DW_TAG_typedef)
    <cf0>   DW_AT_name        : (indirect string, offset: 0xcd1b2): osTimerId_t
    <cf4>   DW_AT_decl_file   : 5
    <cf5>   DW_AT_decl_line   : 192
    <cf6>   DW_AT_decl_column : 15
    <cf7>   DW_AT_type        : <0xc6d>
 <1><cfb>: Abbrev Number: 11 (DW_TAG_variable)
    <cfc>   DW_AT_name        : (indirect string, offset: 0xc9922): i2cTimerHandle
    <d00>   DW_AT_decl_file   : 1
    <d01>   DW_AT_decl_line   : 5
    <d02>   DW_AT_decl_column : 20
    <d03>   DW_AT_type        : <0xcef>
    <d07>   DW_AT_external    : 1
    <d07>   DW_AT_declaration : 1
 <1><d07>: Abbrev Number: 12 (DW_TAG_variable)
    <d08>   DW_AT_name        : (indirect string, offset: 0xca6a0): I2C_TIMEOUT_50MS_CNTR
    <d0c>   DW_AT_decl_file   : 1
    <d0d>   DW_AT_decl_line   : 8
    <d0e>   DW_AT_decl_column : 17
    <d0f>   DW_AT_type        : <0xc9c>
    <d13>   DW_AT_external    : 1
    <d13>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><d19>: Abbrev Number: 13 (DW_TAG_subprogram)
    <d1a>   DW_AT_external    : 1
    <d1a>   DW_AT_name        : (indirect string, offset: 0xcabf4): osTimerStart
    <d1e>   DW_AT_decl_file   : 5
    <d1f>   DW_AT_decl_line   : 486
    <d21>   DW_AT_decl_column : 12
    <d22>   DW_AT_prototyped  : 1
    <d22>   DW_AT_type        : <0xce3>
    <d26>   DW_AT_declaration : 1
    <d26>   DW_AT_sibling     : <0xd35>
 <2><d2a>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d2b>   DW_AT_type        : <0xcef>
 <2><d2f>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d30>   DW_AT_type        : <0xc76>
 <2><d34>: Abbrev Number: 0
 <1><d35>: Abbrev Number: 13 (DW_TAG_subprogram)
    <d36>   DW_AT_external    : 1
    <d36>   DW_AT_name        : (indirect string, offset: 0xcb24e): osTimerStop
    <d3a>   DW_AT_decl_file   : 5
    <d3b>   DW_AT_decl_line   : 491
    <d3d>   DW_AT_decl_column : 12
    <d3e>   DW_AT_prototyped  : 1
    <d3e>   DW_AT_type        : <0xce3>
    <d42>   DW_AT_declaration : 1
    <d42>   DW_AT_sibling     : <0xd4c>
 <2><d46>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d47>   DW_AT_type        : <0xcef>
 <2><d4b>: Abbrev Number: 0
 <1><d4c>: Abbrev Number: 15 (DW_TAG_subprogram)
    <d4d>   DW_AT_external    : 1
    <d4d>   DW_AT_name        : (indirect string, offset: 0x2bb4a): StartI2CTimer
    <d51>   DW_AT_decl_file   : 1
    <d52>   DW_AT_decl_line   : 20
    <d53>   DW_AT_decl_column : 6
    <d54>   DW_AT_low_pc      : 0x8000fac
    <d58>   DW_AT_high_pc     : 0x24
    <d5c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d5e>   DW_AT_GNU_all_tail_call_sites: 1
 <1><d5e>: Abbrev Number: 15 (DW_TAG_subprogram)
    <d5f>   DW_AT_external    : 1
    <d5f>   DW_AT_name        : (indirect string, offset: 0x7975): StopI2CTimer
    <d63>   DW_AT_decl_file   : 1
    <d64>   DW_AT_decl_line   : 15
    <d65>   DW_AT_decl_column : 6
    <d66>   DW_AT_low_pc      : 0x8000f94
    <d6a>   DW_AT_high_pc     : 0x18
    <d6e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d70>   DW_AT_GNU_all_tail_call_sites: 1
 <1><d70>: Abbrev Number: 0
  Compilation Unit @ offset 0xd71:
   Length:        0x800 (32-bit)
   Version:       4
   Abbrev Offset: 0x2bf
   Pointer Size:  4
 <0><d7c>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <d7d>   DW_AT_producer    : (indirect string, offset: 0x358fb): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <d81>   DW_AT_language    : 12	(ANSI C99)
    <d82>   DW_AT_name        : (indirect string, offset: 0xce19f): ../Core/MikroeSDK_3D-Motion/sensors.c
    <d86>   DW_AT_comp_dir    : (indirect string, offset: 0xb43c): C:/Users/pjura/Desktop/dev/stm32/embsys_bubble-level/Source/nucleo-l432kc_3d-motion/Debug
    <d8a>   DW_AT_ranges      : 0x30
    <d8e>   DW_AT_low_pc      : 0x0
    <d92>   DW_AT_stmt_list   : 0x155e
    <d96>   DW_AT_GNU_macros  : 0x14bd
 <1><d9a>: Abbrev Number: 2 (DW_TAG_base_type)
    <d9b>   DW_AT_byte_size   : 1
    <d9c>   DW_AT_encoding    : 6	(signed char)
    <d9d>   DW_AT_name        : (indirect string, offset: 0x64980): signed char
 <1><da1>: Abbrev Number: 2 (DW_TAG_base_type)
    <da2>   DW_AT_byte_size   : 1
    <da3>   DW_AT_encoding    : 8	(unsigned char)
    <da4>   DW_AT_name        : (indirect string, offset: 0xc1f9b): unsigned char
 <1><da8>: Abbrev Number: 3 (DW_TAG_typedef)
    <da9>   DW_AT_name        : (indirect string, offset: 0xce1d8): __int16_t
    <dad>   DW_AT_decl_file   : 2
    <dae>   DW_AT_decl_line   : 55
    <daf>   DW_AT_decl_column : 24
    <db0>   DW_AT_type        : <0xdb4>
 <1><db4>: Abbrev Number: 2 (DW_TAG_base_type)
    <db5>   DW_AT_byte_size   : 2
    <db6>   DW_AT_encoding    : 5	(signed)
    <db7>   DW_AT_name        : (indirect string, offset: 0x95302): short int
 <1><dbb>: Abbrev Number: 2 (DW_TAG_base_type)
    <dbc>   DW_AT_byte_size   : 2
    <dbd>   DW_AT_encoding    : 7	(unsigned)
    <dbe>   DW_AT_name        : (indirect string, offset: 0xc075e): short unsigned int
 <1><dc2>: Abbrev Number: 2 (DW_TAG_base_type)
    <dc3>   DW_AT_byte_size   : 4
    <dc4>   DW_AT_encoding    : 5	(signed)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x11394): long int
 <1><dc9>: Abbrev Number: 2 (DW_TAG_base_type)
    <dca>   DW_AT_byte_size   : 4
    <dcb>   DW_AT_encoding    : 7	(unsigned)
    <dcc>   DW_AT_name        : (indirect string, offset: 0x3d754): long unsigned int
 <1><dd0>: Abbrev Number: 2 (DW_TAG_base_type)
    <dd1>   DW_AT_byte_size   : 8
    <dd2>   DW_AT_encoding    : 5	(signed)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x5b6d8): long long int
 <1><dd7>: Abbrev Number: 2 (DW_TAG_base_type)
    <dd8>   DW_AT_byte_size   : 8
    <dd9>   DW_AT_encoding    : 7	(unsigned)
    <dda>   DW_AT_name        : (indirect string, offset: 0x297c8): long long unsigned int
 <1><dde>: Abbrev Number: 4 (DW_TAG_base_type)
    <ddf>   DW_AT_byte_size   : 4
    <de0>   DW_AT_encoding    : 5	(signed)
    <de1>   DW_AT_name        : int
 <1><de5>: Abbrev Number: 2 (DW_TAG_base_type)
    <de6>   DW_AT_byte_size   : 4
    <de7>   DW_AT_encoding    : 7	(unsigned)
    <de8>   DW_AT_name        : (indirect string, offset: 0x10af7): unsigned int
 <1><dec>: Abbrev Number: 3 (DW_TAG_typedef)
    <ded>   DW_AT_name        : (indirect string, offset: 0xce1da): int16_t
    <df1>   DW_AT_decl_file   : 3
    <df2>   DW_AT_decl_line   : 32
    <df3>   DW_AT_decl_column : 19
    <df4>   DW_AT_type        : <0xda8>
 <1><df8>: Abbrev Number: 2 (DW_TAG_base_type)
    <df9>   DW_AT_byte_size   : 8
    <dfa>   DW_AT_encoding    : 4	(float)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x12a99): long double
 <1><dff>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <e00>   DW_AT_byte_size   : 4
    <e01>   DW_AT_type        : <0xe05>
 <1><e05>: Abbrev Number: 2 (DW_TAG_base_type)
    <e06>   DW_AT_byte_size   : 1
    <e07>   DW_AT_encoding    : 8	(unsigned char)
    <e08>   DW_AT_name        : (indirect string, offset: 0xcaedf): char
 <1><e0c>: Abbrev Number: 2 (DW_TAG_base_type)
    <e0d>   DW_AT_byte_size   : 4
    <e0e>   DW_AT_encoding    : 4	(float)
    <e0f>   DW_AT_name        : (indirect string, offset: 0xc9804): float
 <1><e13>: Abbrev Number: 2 (DW_TAG_base_type)
    <e14>   DW_AT_byte_size   : 8
    <e15>   DW_AT_encoding    : 4	(float)
    <e16>   DW_AT_name        : (indirect string, offset: 0xca07d): double
 <1><e1a>: Abbrev Number: 3 (DW_TAG_typedef)
    <e1b>   DW_AT_name        : (indirect string, offset: 0xadd77): UINT8
    <e1f>   DW_AT_decl_file   : 4
    <e20>   DW_AT_decl_line   : 28
    <e21>   DW_AT_decl_column : 23
    <e22>   DW_AT_type        : <0xda1>
 <1><e26>: Abbrev Number: 3 (DW_TAG_typedef)
    <e27>   DW_AT_name        : (indirect string, offset: 0x48873): UINT16
    <e2b>   DW_AT_decl_file   : 4
    <e2c>   DW_AT_decl_line   : 31
    <e2d>   DW_AT_decl_column : 22
    <e2e>   DW_AT_type        : <0xde5>
 <1><e32>: Abbrev Number: 6 (DW_TAG_array_type)
    <e33>   DW_AT_type        : <0xe13>
    <e37>   DW_AT_sibling     : <0xe42>
 <2><e3b>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <e3c>   DW_AT_type        : <0xde5>
    <e40>   DW_AT_upper_bound : 3
 <2><e41>: Abbrev Number: 0
 <1><e42>: Abbrev Number: 8 (DW_TAG_variable)
    <e43>   DW_AT_name        : (indirect string, offset: 0xce25f): prev_dat
    <e47>   DW_AT_decl_file   : 1
    <e48>   DW_AT_decl_line   : 4
    <e49>   DW_AT_decl_column : 15
    <e4a>   DW_AT_type        : <0xe32>
    <e4e>   DW_AT_location    : 5 byte block: 3 a0 0 0 20 	(DW_OP_addr: 200000a0)
 <1><e54>: Abbrev Number: 6 (DW_TAG_array_type)
    <e55>   DW_AT_type        : <0xe05>
    <e59>   DW_AT_sibling     : <0xe64>
 <2><e5d>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <e5e>   DW_AT_type        : <0xde5>
    <e62>   DW_AT_upper_bound : 10
 <2><e63>: Abbrev Number: 0
 <1><e64>: Abbrev Number: 9 (DW_TAG_variable)
    <e65>   DW_AT_name        : _x
    <e68>   DW_AT_decl_file   : 1
    <e69>   DW_AT_decl_line   : 347
    <e6b>   DW_AT_decl_column : 8
    <e6c>   DW_AT_type        : <0xe54>
    <e70>   DW_AT_external    : 1
    <e70>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><e76>: Abbrev Number: 9 (DW_TAG_variable)
    <e77>   DW_AT_name        : _y
    <e7a>   DW_AT_decl_file   : 1
    <e7b>   DW_AT_decl_line   : 347
    <e7d>   DW_AT_decl_column : 16
    <e7e>   DW_AT_type        : <0xe54>
    <e82>   DW_AT_external    : 1
    <e82>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><e88>: Abbrev Number: 9 (DW_TAG_variable)
    <e89>   DW_AT_name        : _z
    <e8c>   DW_AT_decl_file   : 1
    <e8d>   DW_AT_decl_line   : 347
    <e8f>   DW_AT_decl_column : 24
    <e90>   DW_AT_type        : <0xe54>
    <e94>   DW_AT_external    : 1
    <e94>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><e9a>: Abbrev Number: 9 (DW_TAG_variable)
    <e9b>   DW_AT_name        : _w
    <e9e>   DW_AT_decl_file   : 1
    <e9f>   DW_AT_decl_line   : 347
    <ea1>   DW_AT_decl_column : 32
    <ea2>   DW_AT_type        : <0xe54>
    <ea6>   DW_AT_external    : 1
    <ea6>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><eac>: Abbrev Number: 10 (DW_TAG_subprogram)
    <ead>   DW_AT_external    : 1
    <ead>   DW_AT_name        : (indirect string, offset: 0xce231): ret_exponent
    <eb1>   DW_AT_decl_file   : 5
    <eb2>   DW_AT_decl_line   : 162
    <eb3>   DW_AT_decl_column : 8
    <eb4>   DW_AT_prototyped  : 1
    <eb4>   DW_AT_type        : <0xe13>
    <eb8>   DW_AT_declaration : 1
    <eb8>   DW_AT_sibling     : <0xec2>
 <2><ebc>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ebd>   DW_AT_type        : <0xe1a>
 <2><ec1>: Abbrev Number: 0
 <1><ec2>: Abbrev Number: 12 (DW_TAG_subprogram)
    <ec3>   DW_AT_external    : 1
    <ec3>   DW_AT_name        : (indirect string, offset: 0xa3c73): error_handler
    <ec7>   DW_AT_decl_file   : 7
    <ec8>   DW_AT_decl_line   : 106
    <ec9>   DW_AT_decl_column : 6
    <eca>   DW_AT_prototyped  : 1
    <eca>   DW_AT_declaration : 1
    <eca>   DW_AT_sibling     : <0xede>
 <2><ece>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ecf>   DW_AT_type        : <0xdff>
 <2><ed3>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ed4>   DW_AT_type        : <0xe26>
 <2><ed8>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ed9>   DW_AT_type        : <0xe26>
 <2><edd>: Abbrev Number: 0
 <1><ede>: Abbrev Number: 13 (DW_TAG_subprogram)
    <edf>   DW_AT_external    : 1
    <edf>   DW_AT_name        : (indirect string, offset: 0xce207): HOST_SF_LIB_VREG_write
    <ee3>   DW_AT_decl_file   : 6
    <ee4>   DW_AT_decl_line   : 440
    <ee6>   DW_AT_decl_column : 7
    <ee7>   DW_AT_prototyped  : 1
    <ee7>   DW_AT_type        : <0xe1a>
    <eeb>   DW_AT_declaration : 1
    <eeb>   DW_AT_sibling     : <0xefa>
 <2><eef>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ef0>   DW_AT_type        : <0xe1a>
 <2><ef4>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ef5>   DW_AT_type        : <0xe26>
 <2><ef9>: Abbrev Number: 0
 <1><efa>: Abbrev Number: 13 (DW_TAG_subprogram)
    <efb>   DW_AT_external    : 1
    <efb>   DW_AT_name        : (indirect string, offset: 0xce189): HOST_SF_LIB_VREG_read
    <eff>   DW_AT_decl_file   : 6
    <f00>   DW_AT_decl_line   : 439
    <f02>   DW_AT_decl_column : 7
    <f03>   DW_AT_prototyped  : 1
    <f03>   DW_AT_type        : <0xe1a>
    <f07>   DW_AT_declaration : 1
    <f07>   DW_AT_sibling     : <0xf16>
 <2><f0b>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <f0c>   DW_AT_type        : <0xe1a>
 <2><f10>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <f11>   DW_AT_type        : <0xf16>
 <2><f15>: Abbrev Number: 0
 <1><f16>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <f17>   DW_AT_byte_size   : 4
    <f18>   DW_AT_type        : <0xe26>
 <1><f1c>: Abbrev Number: 14 (DW_TAG_subprogram)
    <f1d>   DW_AT_external    : 1
    <f1d>   DW_AT_name        : (indirect string, offset: 0xce1c5): _rawGyro
    <f21>   DW_AT_decl_file   : 1
    <f22>   DW_AT_decl_line   : 501
    <f24>   DW_AT_decl_column : 6
    <f25>   DW_AT_low_pc      : 0x8000fd0
    <f29>   DW_AT_high_pc     : 0x2ac
    <f2d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f2f>   DW_AT_GNU_all_tail_call_sites: 1
    <f2f>   DW_AT_sibling     : <0xff4>
 <2><f33>: Abbrev Number: 15 (DW_TAG_variable)
    <f34>   DW_AT_name        : (indirect string, offset: 0xce271): ucRetStat
    <f38>   DW_AT_decl_file   : 1
    <f39>   DW_AT_decl_line   : 502
    <f3b>   DW_AT_decl_column : 9
    <f3c>   DW_AT_type        : <0xe1a>
    <f40>   DW_AT_location    : 2 byte block: 91 4f 	(DW_OP_fbreg: -49)
 <2><f43>: Abbrev Number: 15 (DW_TAG_variable)
    <f44>   DW_AT_name        : (indirect string, offset: 0xce22b): wdata
    <f48>   DW_AT_decl_file   : 1
    <f49>   DW_AT_decl_line   : 503
    <f4b>   DW_AT_decl_column : 10
    <f4c>   DW_AT_type        : <0xe26>
    <f50>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><f53>: Abbrev Number: 15 (DW_TAG_variable)
    <f54>   DW_AT_name        : (indirect string, offset: 0xce1f2): dDataX
    <f58>   DW_AT_decl_file   : 1
    <f59>   DW_AT_decl_line   : 504
    <f5b>   DW_AT_decl_column : 10
    <f5c>   DW_AT_type        : <0xe13>
    <f60>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><f63>: Abbrev Number: 15 (DW_TAG_variable)
    <f64>   DW_AT_name        : (indirect string, offset: 0xce1f9): dDataY
    <f68>   DW_AT_decl_file   : 1
    <f69>   DW_AT_decl_line   : 504
    <f6b>   DW_AT_decl_column : 22
    <f6c>   DW_AT_type        : <0xe13>
    <f70>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><f73>: Abbrev Number: 15 (DW_TAG_variable)
    <f74>   DW_AT_name        : (indirect string, offset: 0xce200): dDataZ
    <f78>   DW_AT_decl_file   : 1
    <f79>   DW_AT_decl_line   : 504
    <f7b>   DW_AT_decl_column : 34
    <f7c>   DW_AT_type        : <0xe13>
    <f80>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><f83>: Abbrev Number: 15 (DW_TAG_variable)
    <f84>   DW_AT_name        : (indirect string, offset: 0xce1eb): dDataW
    <f88>   DW_AT_decl_file   : 1
    <f89>   DW_AT_decl_line   : 504
    <f8b>   DW_AT_decl_column : 46
    <f8c>   DW_AT_type        : <0xe13>
    <f90>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><f93>: Abbrev Number: 15 (DW_TAG_variable)
    <f94>   DW_AT_name        : (indirect string, offset: 0xce246): dMult
    <f98>   DW_AT_decl_file   : 1
    <f99>   DW_AT_decl_line   : 505
    <f9b>   DW_AT_decl_column : 10
    <f9c>   DW_AT_type        : <0xe13>
    <fa0>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><fa3>: Abbrev Number: 15 (DW_TAG_variable)
    <fa4>   DW_AT_name        : (indirect string, offset: 0xce1e2): wRMWdata
    <fa8>   DW_AT_decl_file   : 1
    <fa9>   DW_AT_decl_line   : 506
    <fab>   DW_AT_decl_column : 10
    <fac>   DW_AT_type        : <0xe26>
    <fb0>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><fb3>: Abbrev Number: 16 (DW_TAG_variable)
    <fb4>   DW_AT_name        : _x
    <fb7>   DW_AT_decl_file   : 1
    <fb8>   DW_AT_decl_line   : 508
    <fba>   DW_AT_decl_column : 8
    <fbb>   DW_AT_type        : <0xff4>
    <fbf>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><fc3>: Abbrev Number: 16 (DW_TAG_variable)
    <fc4>   DW_AT_name        : _y
    <fc7>   DW_AT_decl_file   : 1
    <fc8>   DW_AT_decl_line   : 508
    <fca>   DW_AT_decl_column : 16
    <fcb>   DW_AT_type        : <0xff4>
    <fcf>   DW_AT_location    : 3 byte block: 91 a4 7f 	(DW_OP_fbreg: -92)
 <2><fd3>: Abbrev Number: 16 (DW_TAG_variable)
    <fd4>   DW_AT_name        : _z
    <fd7>   DW_AT_decl_file   : 1
    <fd8>   DW_AT_decl_line   : 508
    <fda>   DW_AT_decl_column : 24
    <fdb>   DW_AT_type        : <0xff4>
    <fdf>   DW_AT_location    : 3 byte block: 91 94 7f 	(DW_OP_fbreg: -108)
 <2><fe3>: Abbrev Number: 16 (DW_TAG_variable)
    <fe4>   DW_AT_name        : _w
    <fe7>   DW_AT_decl_file   : 1
    <fe8>   DW_AT_decl_line   : 508
    <fea>   DW_AT_decl_column : 32
    <feb>   DW_AT_type        : <0xff4>
    <fef>   DW_AT_location    : 3 byte block: 91 84 7f 	(DW_OP_fbreg: -124)
 <2><ff3>: Abbrev Number: 0
 <1><ff4>: Abbrev Number: 6 (DW_TAG_array_type)
    <ff5>   DW_AT_type        : <0xe05>
    <ff9>   DW_AT_sibling     : <0x1004>
 <2><ffd>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <ffe>   DW_AT_type        : <0xde5>
    <1002>   DW_AT_upper_bound : 14
 <2><1003>: Abbrev Number: 0
 <1><1004>: Abbrev Number: 14 (DW_TAG_subprogram)
    <1005>   DW_AT_external    : 1
    <1005>   DW_AT_name        : (indirect string, offset: 0xce254): _rawMagnet
    <1009>   DW_AT_decl_file   : 1
    <100a>   DW_AT_decl_line   : 426
    <100c>   DW_AT_decl_column : 6
    <100d>   DW_AT_low_pc      : 0x0
    <1011>   DW_AT_high_pc     : 0x2a4
    <1015>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1017>   DW_AT_GNU_all_tail_call_sites: 1
    <1017>   DW_AT_sibling     : <0x10dc>
 <2><101b>: Abbrev Number: 15 (DW_TAG_variable)
    <101c>   DW_AT_name        : (indirect string, offset: 0xce271): ucRetStat
    <1020>   DW_AT_decl_file   : 1
    <1021>   DW_AT_decl_line   : 427
    <1023>   DW_AT_decl_column : 9
    <1024>   DW_AT_type        : <0xe1a>
    <1028>   DW_AT_location    : 2 byte block: 91 4f 	(DW_OP_fbreg: -49)
 <2><102b>: Abbrev Number: 15 (DW_TAG_variable)
    <102c>   DW_AT_name        : (indirect string, offset: 0xce22b): wdata
    <1030>   DW_AT_decl_file   : 1
    <1031>   DW_AT_decl_line   : 428
    <1033>   DW_AT_decl_column : 10
    <1034>   DW_AT_type        : <0xe26>
    <1038>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><103b>: Abbrev Number: 15 (DW_TAG_variable)
    <103c>   DW_AT_name        : (indirect string, offset: 0xce1f2): dDataX
    <1040>   DW_AT_decl_file   : 1
    <1041>   DW_AT_decl_line   : 429
    <1043>   DW_AT_decl_column : 10
    <1044>   DW_AT_type        : <0xe13>
    <1048>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><104b>: Abbrev Number: 15 (DW_TAG_variable)
    <104c>   DW_AT_name        : (indirect string, offset: 0xce1f9): dDataY
    <1050>   DW_AT_decl_file   : 1
    <1051>   DW_AT_decl_line   : 429
    <1053>   DW_AT_decl_column : 22
    <1054>   DW_AT_type        : <0xe13>
    <1058>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><105b>: Abbrev Number: 15 (DW_TAG_variable)
    <105c>   DW_AT_name        : (indirect string, offset: 0xce200): dDataZ
    <1060>   DW_AT_decl_file   : 1
    <1061>   DW_AT_decl_line   : 429
    <1063>   DW_AT_decl_column : 34
    <1064>   DW_AT_type        : <0xe13>
    <1068>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><106b>: Abbrev Number: 15 (DW_TAG_variable)
    <106c>   DW_AT_name        : (indirect string, offset: 0xce1eb): dDataW
    <1070>   DW_AT_decl_file   : 1
    <1071>   DW_AT_decl_line   : 429
    <1073>   DW_AT_decl_column : 46
    <1074>   DW_AT_type        : <0xe13>
    <1078>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><107b>: Abbrev Number: 15 (DW_TAG_variable)
    <107c>   DW_AT_name        : (indirect string, offset: 0xce246): dMult
    <1080>   DW_AT_decl_file   : 1
    <1081>   DW_AT_decl_line   : 430
    <1083>   DW_AT_decl_column : 10
    <1084>   DW_AT_type        : <0xe13>
    <1088>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><108b>: Abbrev Number: 15 (DW_TAG_variable)
    <108c>   DW_AT_name        : (indirect string, offset: 0xce1e2): wRMWdata
    <1090>   DW_AT_decl_file   : 1
    <1091>   DW_AT_decl_line   : 431
    <1093>   DW_AT_decl_column : 10
    <1094>   DW_AT_type        : <0xe26>
    <1098>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><109b>: Abbrev Number: 16 (DW_TAG_variable)
    <109c>   DW_AT_name        : _x
    <109f>   DW_AT_decl_file   : 1
    <10a0>   DW_AT_decl_line   : 433
    <10a2>   DW_AT_decl_column : 8
    <10a3>   DW_AT_type        : <0xff4>
    <10a7>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><10ab>: Abbrev Number: 16 (DW_TAG_variable)
    <10ac>   DW_AT_name        : _y
    <10af>   DW_AT_decl_file   : 1
    <10b0>   DW_AT_decl_line   : 433
    <10b2>   DW_AT_decl_column : 16
    <10b3>   DW_AT_type        : <0xff4>
    <10b7>   DW_AT_location    : 3 byte block: 91 a4 7f 	(DW_OP_fbreg: -92)
 <2><10bb>: Abbrev Number: 16 (DW_TAG_variable)
    <10bc>   DW_AT_name        : _z
    <10bf>   DW_AT_decl_file   : 1
    <10c0>   DW_AT_decl_line   : 433
    <10c2>   DW_AT_decl_column : 24
    <10c3>   DW_AT_type        : <0xff4>
    <10c7>   DW_AT_location    : 3 byte block: 91 94 7f 	(DW_OP_fbreg: -108)
 <2><10cb>: Abbrev Number: 16 (DW_TAG_variable)
    <10cc>   DW_AT_name        : _w
    <10cf>   DW_AT_decl_file   : 1
    <10d0>   DW_AT_decl_line   : 433
    <10d2>   DW_AT_decl_column : 32
    <10d3>   DW_AT_type        : <0xff4>
    <10d7>   DW_AT_location    : 3 byte block: 91 84 7f 	(DW_OP_fbreg: -124)
 <2><10db>: Abbrev Number: 0
 <1><10dc>: Abbrev Number: 14 (DW_TAG_subprogram)
    <10dd>   DW_AT_external    : 1
    <10dd>   DW_AT_name        : (indirect string, offset: 0xce1ce): _rawAccel
    <10e1>   DW_AT_decl_file   : 1
    <10e2>   DW_AT_decl_line   : 349
    <10e4>   DW_AT_decl_column : 6
    <10e5>   DW_AT_low_pc      : 0x0
    <10e9>   DW_AT_high_pc     : 0x264
